[
  {
    "id": "20200",
    "coname": "Pandit Ramlall Way",
    "reason": "Pandit Ramlall was a scholar, author, freedom fighter for Guyana’s independence and founder of the Annual Phagwah Parade held in Richmond Hill. He was the leader of the Arya Spiritual Center which educated youths regarding religion and culture. He received a plaque for his dedication to community involvement by the Guyana Cultural Association. Before he migrated to the United States in 1974, he was highly regarded in Guyana where he was born and raised. There, he served as a Member of Parliament advocating for the working class and at one point was jailed for nearly three years at Sibley Hall for his activism. In the United States, he studied psychology and received a diploma in Education. In 1975, he received the prestigious literary award at the first Vishwa Hindi Sammelan (World Hindi Conference) in Nagpur, India and also received numerous awards from Canada and the United States for his teachings and community work. In 2003, Queens Borough President Helen Marshall declared one day of the year as Pandit Ramlall Day.",
    "year": 2020,
    "group": -1,
    "location": "133rd Street and Liberty Avenue,Queens,NY",
    "lat": 22.879904587968326,
    "long": 41.33407559383107,
    "nlat": 22.879904587968326,
    "nlong": 41.33407559383107
  },
  {
    "id": "20201",
    "coname": "Henry Clayton Street",
    "reason": "Henry Clayton, Jr. relentlessly served his community starting in the 1970s, providing free extermination services in his Southeast Queens community. He then went on to open what became one of the largest black owned travel agencies in NYC in March of 1988, growing to employ over 30 black and brown community members who also went on to become professional entrepreneurs. He also partnered with Greater Allen A.M.E. Cathedral of New York to provide safe, affordable, and memorable trips for seniors and their families. Additionally, he used his community route as a Frito-Lay salesman as a pathway to support, employ and mentor young men throughout Jamaica Queens. He provided holiday gifts out of his own pocket for over 150 families every year.",
    "year": 2020,
    "group": 2,
    "location": "169th Street,Queens,NY",
    "lat": 26.928085102360207,
    "long": 43.01508120327214,
    "nlat": 26.928085102360207,
    "nlong": 43.01508120327214
  },
  {
    "id": "20202",
    "coname": "Little Guyana Avenue",
    "reason": "This co-naming will commemorate the contributions of the Guyanese community in Richmond Hill. Guyanese now makes up the second largest immigrant group based on the 2010 census.",
    "year": 2020,
    "group": 1,
    "location": "Liberty Avenue,Queens,NY",
    "lat": 21.757102460288213,
    "long": 39.30941382994887,
    "nlat": 21.757102460288213,
    "nlong": 39.30941382994887
  },
  {
    "id": "20203",
    "coname": "Coach Skip Branch Way",
    "reason": "Floyd Branch, Jr. founded the NYC Bombsquad Basketball Classic, a non-profit league that served disadvantaged youth and aimed to keep kids in a safe environment. He founded the league in 1995 and ran the nonprofit for nearly 25 years until his death. He was a coach and mentor to thousands of youths. He served as head basketball coach of the varsity team at Rice High School for 11 years leading the team to four championship games. He also coached at Cardinal Hayes High School in the Bronx and received the Pepsi Cola Heroes in our Community Award in 2006, sponsored by 98.7 Kiss FM and later received the Native New Yorker Award from the John Hunter Memorial Camp Fund Inc.",
    "year": 2020,
    "group": 2,
    "location": "East 100th Street and Third Avenue,Manhattan,NY",
    "lat": 37.62671719853057,
    "long": 28.026504973528475,
    "nlat": 37.62671719853057,
    "nlong": 28.026504973528475
  },
  {
    "id": "20204",
    "coname": "Lou ‘Big Lou’ Torres Way",
    "reason": "Lou ‘Big Lou’ Torres was born in the South Bronx and served as the Tenant Association President of Robert E. Moore Houses. He secured funding to install security cameras throughout the development to ensure safety throughout the community. He also hosted block parties and other events to celebrate the community. He was also the CEO of BIG LOU Films and led a successful career in the motion picture industry.",
    "year": 2020,
    "group": 2,
    "location": "East 149th Street and Jackson Avenue,Bronx,NY",
    "lat": 41.509158646288284,
    "long": 31.83480561126756,
    "nlat": 41.509158646288284,
    "nlong": 31.83480561126756
  },
  {
    "id": "20205",
    "coname": "Terence Cardinal Cooke Way",
    "reason": "Terence Cardinal Cooke was ordained a priest in 1945 and served as chaplain for St. Agatha’s Home for Children in Nanuet. Later he was appointed an Auxiliary Bishop of the Roman Catholic Archdiocese of New York by Pope Paul VI. In March 1968, he was named the seventh Archbishop of New York and was also named Vicar Apostolic for the United States Military. In 1969, he delivered the benediction at the inauguration of President Nixon. As archbishop, he founded Birthright, which offers women alternatives to abortion, the Inner-City Scholarship Fund, which provides financial aid for Catholic School students, an Archdiocesan Housing Development Program providing housing to the City’s disadvantaged and nine nursing homes. After his death, there was a movement to canonize him as a saint. In 1992, the Congregation for the Cause of Saints designated him as a Servant of God, the first step in the process that leads to beautification and then canonization as a saint. Documentation of Cooke’s life’s work was presented to Pope Benedict XVI in 2010. If approved, Cooke will receive the title Venerable, the second step leading to sainthood.",
    "year": 2020,
    "group": 1,
    "location": "Fifth Avenue and East 106th Street,Manhattan,NY",
    "lat": 38.613985327746924,
    "long": 27.658875578584087,
    "nlat": 38.613985327746924,
    "nlong": 27.658875578584087
  },
  {
    "id": "20206",
    "coname": "Police Officer Randolph Holder Way",
    "reason": "Randolph Holder served with the NYPD for five years and was assigned to Police Service Area 5. He was killed in the line of duty",
    "year": 2020,
    "group": 0,
    "location": "East 120th Street and the FDR Drive,Manhattan,NY",
    "lat": 39.1436032191504,
    "long": 29.550240169184,
    "nlat": 39.1436032191504,
    "nlong": 29.550240169184
  },
  {
    "id": "20207",
    "coname": "Akai Gurley Way",
    "reason": "On November 20, 2014, Akai Gurley, a 28-year-old public housing resident was fatally shot by New York City Police Department (“NYPD”) Police Officer Peter Liang in a darkened stairwell at the Louis H. Pink Houses in Brooklyn, New York. At a press conference on November 21, 2014, NYPD Commissioner William J. Bratton stated that the shooting appeared to be an accidental discharge.",
    "year": 2020,
    "group": 0,
    "location": "Eldert Lane and Linden Boulevard,Brooklyn,NY",
    "lat": 19.598149089530782,
    "long": 36.42500118128938,
    "nlat": 19.598149089530782,
    "nlong": 36.42500118128938
  },
  {
    "id": "20208",
    "coname": "MaryLou Cerqua Way",
    "reason": "MaryLou Cerqua was born and raised in Brooklyn, NY. She was a Con Edison employee for 30 years and upon retiring moved to Staten Island where she was heavily involved in volunteer work at St. Clare Church, Seaside Wildlife Nature Park, Crescent Beach, and cleanups at local parks.",
    "year": 2020,
    "group": 3,
    "location": "Wiman Avenue and Hylan Boulevard,Staten Island,NY",
    "lat": 0.0,
    "long": 8.21103837187659,
    "nlat": 0.0,
    "nlong": 8.21103837187659
  },
  {
    "id": "20209",
    "coname": "Clifford Holtermann Way",
    "reason": "Clifford E. Holtermann was a lifelong Staten Islander who was a member of the Masonic Lodge No. 916, St. Andrew’s Episcopal Church, and Historic Richmond Town. He worked his entire life at Holtermann’s Bakery, founded by his grandfather, which is still in business today and celebrated 140 years of business in October. Holtermann’s Bakery was featured in “Cooks Illustrated” for having the “Best Crumbs” and served as a backdrop for NBC’s “The Blacklist” and FX’s “The Americans.” He won a Louis R. Miller Business Leadership Award in 2010.",
    "year": 2020,
    "group": -1,
    "location": "Arthur Kill Road and Miles Avenue,Staten Island,NY",
    "lat": 3.6571308509168,
    "long": 7.41416388683003,
    "nlat": 3.6571308509168,
    "nlong": 7.41416388683003
  },
  {
    "id": "202010",
    "coname": "Peter Catello Way",
    "reason": "Peter N. Catello was the owner of Catello Electrical Contracting for almost 50 years, and worked for six months as an electrician at the Fresh Kills Recovery site, working day and night to maintain the electrical and lights for the recovery operation. He will be included on the wall at the 9/11 Responders Remembered Park. He later sent several of his crews out to affected areas after Hurricane Sandy to help people restore power. He died of 9/11 related illness.",
    "year": 2020,
    "group": 0,
    "location": "Arthur Kill Road and Industrial Loop West,Staten Island,NY",
    "lat": 0.7591825084447451,
    "long": 0.0,
    "nlat": 0.7591825084447451,
    "nlong": 0.0
  },
  {
    "id": "202011",
    "coname": "Anthony M. Scarpaci Sr. Way",
    "reason": "Anthony Scarpaci took over the Scarpaci Funeral Home at the age of 21 after his father’s death in 1939. The Scarpaci Funeral Home was established in 1910 and still operates currently. The Scarpaci family continues to give back to the community and those in need through charitable endeavors.  Many of the family members have been active in community and service organizations including the Lions International, Knights of Columbus, Kiwanis International and Peitro’s Fight. He was a founder of the Little Sons of Italy, a charity that donates to orphanages in Sicily and New York which also established free schools to teach new Americans how to speak English while guiding them through the citizenship application process and he was a founding member and president of the Ben-Bay Kiwanis Club, which has raised millions of dollars for various children’s charities over the past 50 years and still continues today. In 1962, after St. Frances Cabrini Church burned down, he opened his funeral home so services could be held every Sunday to the community until the church was rebuilt.",
    "year": 2020,
    "group": 2,
    "location": "14th Street and 86th Street,Brooklyn,NY",
    "lat": 10.938488697571362,
    "long": 21.647458955627823,
    "nlat": 10.938488697571362,
    "nlong": 21.647458955627823
  },
  {
    "id": "202012",
    "coname": "Nilda Velazquez Way",
    "reason": "Nilda Velazquez moved to New York from Puerto Rico with her mother in 1948.  In 1960, her mother died of cancer when she was 12 years old and she grew up in an orphanage. She attended school and raised her family the best way she could. She organized with her fellow mothers for better housing, better schools, and better living situations. She organized along with NYS Assemblyman Jose Rivera, and former NYC Council Member Maria Baez while serving in their state and city legislative offices respectively.  She was renowned for her legendary constituent services. In addition to her being a public servant, she also was a community activist.  She participated in the Creston Avenue Block Association, providing block parties. She started the Davidson Family Community Association. She was active in the Bronx County Democratic Party with Roberto Ramirez and Jose Rivera as a judicial delegate and also served as the Democratic District Leader of the 78th Assembly District, running the North End Democratic Club. She ran for State Committee Member, and won with the highest plurality of everyone running with her. Whether it was fighting for Criminal Justice Reform or protesting cancer clusters stemming from the United States Naval bases in Vieques, Puerto Rico or fighting for basic living conditions in the West Bronx, she fought hard for the community.",
    "year": 2020,
    "group": 3,
    "location": "West Fordham Road and Davidson Avenue,Bronx,NY",
    "lat": 49.05547028879434,
    "long": 32.509093948499185,
    "nlat": 49.05547028879434,
    "nlong": 32.509093948499185
  },
  {
    "id": "202013",
    "coname": "Five Points",
    "reason": "This co-naming would recognize the lives of tens of thousands of 19th century Irish, Italian, Chinese and Jewish immigrants, as well as the free African-Americans who lived together in this notorious slum where they faced considerable poverty and adversity while helping make the City the melting pot it is today.",
    "year": 2020,
    "group": 2,
    "location": "Baxter Street and Worth Street,Manhattan,NY",
    "lat": 26.435503107264076,
    "long": 22.762696089195455,
    "nlat": 26.435503107264076,
    "nlong": 22.762696089195455
  },
  {
    "id": "202014",
    "coname": "Bishop Michel White Way",
    "reason": "Bishop Michel White was the founder and pastor of the Cathedral at Greater Faith and served the Bronx community for over 30 years.  Her contributions were numerous as she worked tirelessly to support less fortunate members in the community by hosting an annual Thanksgiving food drive, an annual coat drive, created a prison ministry, annual back to school rally, conducted neighborhood health fairs, toy drives for children, provided drug rehabilitation program, free concerts for the community, provided immigrants with immigration lawyers, visited the sick in hospitals, taught children how to sing and play instruments and worked closely with the NYPD for the safety of the community. In 2017, she gave the Opening Prayer for the New York State Assembly in Albany. She was a member of the Fresh Winds Ministry Alliance, Presiding Prelate of the Churches of the Living God and served on the Executive Council and later became the First Assistant to the Presiding Prelate.",
    "year": 2020,
    "group": 3,
    "location": "White Plains Road,Bronx,NY",
    "lat": 48.075917336001126,
    "long": 35.948861851793865,
    "nlat": 48.075917336001126,
    "nlong": 35.948861851793865
  },
  {
    "id": "202015",
    "coname": "Lt. Paramedic Edith Elida Torres Way",
    "reason": "Edith Elida Torres served as a paramedic for 23 years, as saving lives was the only calling she ever had. Like many of her fellow Bravest and Best, she rushed to the World Trade Center despite being off duty on the morning of September 11, 2001. She spent the rest of the day working the pile, rescuing survivors and looking for her colleague Carlos Lillo, who unbeknownst to Torres, had lost his life in the collapse of the south tower. She continued on in her duty, rising to the rank of lieutenant in 2005. She also collaborated with Lillo’s family to honor him by having a park named in his memory as well as with the Carlos Lillo Memorial Paramedic Scholarship. She died of 9/11 related illness.",
    "year": 2020,
    "group": -1,
    "location": "21st Street and 34th Avenue,Queens,NY",
    "lat": 33.82595598811979,
    "long": 29.363606258336073,
    "nlat": 33.82595598811979,
    "nlong": 29.363606258336073
  },
  {
    "id": "202016",
    "coname": "Yusuf Kirriem Hawkins Way",
    "reason": "On the evening of Wednesday August 23rd, 1989, Yusuf Kirriem Hawkins, a 16-year-old from East New York was shot in the chest and killed in Bensonhurst, Brooklyn, marking the third killing of a black male by white mobs in New York City during the 1980’s. Yusuf was a smart young man who was accepted to a technical school and had the brightest of futures ahead of him. On the night of August 23rd, Yusuf and his friends were visiting Bensonhurst to look at a used car. The group's attackers had been lying in wait for black youths that were expected to attend a party at the home of a teenage girl in the neighborhood. Some say the girl had previously dated one of the killers and/or she had invited black youths to her neighborhood to taunt the neighborhood boys. Hawkins and his friends walked onto the ambushers' block unaware that local residents were waiting to attack any group of black youths they saw. After the murder of Hawkins, police said that he had not in any way been involved with the neighborhood girl whom the killers believed Hawkins was dating. Yusuf’s death led to demands of greater racial justice within New York City. A few days after his murder, 300 demonstrators marched through Bensonhurst in his name facing opposition from local residents in their fight for justice.",
    "year": 2020,
    "group": -1,
    "location": "Verona Place,Brooklyn,NY",
    "lat": 21.336076439405673,
    "long": 28.00394133971415,
    "nlat": 21.336076439405673,
    "nlong": 28.00394133971415
  },
  {
    "id": "202017",
    "coname": "Richard Wright Way",
    "reason": "Richard Wright was an African American writer and poet who was employed by the Federal Writer’s Project and received critical acclaim for “Uncle Tom’s Children,” a collection of four stories and was also well known for his 1940 bestseller “Native Son,” and his 1945 autobiography, “Black Boy.” Raised in Jackson, Mississippi, he was interested in American literature. By the age of 16, a short story he wrote was published in a Southern African American newspaper. In 1927, he moved to Chicago and joined the Communist Party after being frustrated with American capitalism. He joined the Federal Writers’ Project and moved to New York City in 1937. In 1938, “Uncle Tom’s Children” was published earning him a $500 prize from Story magazine and led to a 1939 Guggenheim Fellowship. He published “Native Son” in 1940, which became a bestseller and the first novel written by an African American to be selected by the Book-of-the-Month Club. After becoming disillusioned with both the Communist Party and white America, he moved to Paris and wrote four more novels and lived there until his death.",
    "year": 2020,
    "group": 2,
    "location": "Carlton Avenue,Brooklyn,NY",
    "lat": 22.354372995541002,
    "long": 25.618092679058435,
    "nlat": 22.354372995541002,
    "nlong": 25.618092679058435
  },
  {
    "id": "202018",
    "coname": "Melquain Jatelle Anderson Drive",
    "reason": "Melquain Jatelle Anderson was killed while waiting at a bus stop outside of the Farragut Houses. His family later started a scholarship and emergency fund in his name at John Jay College where he earned his bachelor degree.",
    "year": 2020,
    "group": -1,
    "location": "Gold Street and York Street,Brooklyn,NY",
    "lat": 24.457185497541307,
    "long": 24.51241506127004,
    "nlat": 24.457185497541307,
    "nlong": 24.51241506127004
  },
  {
    "id": "202019",
    "coname": "Ida B. Wells Plaza",
    "reason": "Ida B. Wells was an African-American journalist, abolitionist and feminist who led an anti-lynching crusade in the United States in the 1890s.  She went on to found and become integral in groups for African-American justice.  She was a teacher who became a vocal critic of the condition of African-American only schools in Memphis.  In 1896, she formed the National Association of Colored Women and later became a founding member of the National Association for the Advancement of Colored People.  She worked with the National Equal Rights League to end discriminatory hiring practices for government jobs and also created the first African-American kindergarten in her community and fought for women’s suffrage.",
    "year": 2020,
    "group": 3,
    "location": "Barclays Times Plaza,Brooklyn,NY",
    "lat": 21.598163727021074,
    "long": 25.25053277176778,
    "nlat": 21.598163727021074,
    "nlong": 25.25053277176778
  },
  {
    "id": "202020",
    "coname": "Jitu Weusi Plaza",
    "reason": "Jitu K.Weusi, formerly known as, Leslie R. Campbell, was a long-time educator and activist throughout his life.  He was born and raised in Brooklyn and was very active in education, politics, social justice and music. He began his career in education with the New York City Department of Education in 1962 and was a founding member of the African-American Teachers Association (ATA).  He was widely known for his involvement in the Ocean-Hill/Brownsville conflict that proved to be instrumental in bringing about changes nationwide in community control of public education.  In the late 1960’s, he left the Department of Education and opened the first Black independent private school for inner-city youth: Uhuru Sasa Shule (Freedom Now School). The school was one of the founding member schools of the Council of Independent Black Institutions (CIBI), an international umbrella organization for independent schools.  Among his political accolades, he was essential in forming the New York Chapter of the National Black United Front (NBUF); African-Americans United for Political Power, which was a vital force in the election of Mayor David Dinkins; and, he worked vigorously on Reverend Sharpton’s campaign to become the first black US Senator from New York.  In 1970, he was the principal operator of the East Cultural and Educational Center, where he presented Jazz programs weekly which featured Freddie Hubbard, Max Roach, Betty Carter, Roland Kirk, Gary Bartz, Randy Weston, Pharoah Sanders, McCoy Tyner, Hugh Masekela, Sun Ra and a host of other performers.  An avid enthusiast, collector of and writer on Jazz music, he served as the chairperson of the Central Brooklyn Jazz Consortium for several years.",
    "year": 2020,
    "group": 2,
    "location": "Putnam Plaza,Brooklyn,NY",
    "lat": 21.584410586441813,
    "long": 26.589460589183915,
    "nlat": 21.584410586441813,
    "nlong": 26.589460589183915
  },
  {
    "id": "202021",
    "coname": "Dr. Sam Pinn Way",
    "reason": "Dr. Sam Pinn Jr. was born in Rice, Virginia and later moved to New York to become a life-long resident of Bedford-Stuyvesant, Brooklyn. He served in the United States Army Reserves for eight years and was honorably discharged with the rank of Lieutenant. He earned his Bachelor of Arts degree in sociology from Morgan State University, a Masters of Social Work Degree from Rutgers University, and two Doctors of Law degrees bestowed by Mary Holmes College and Morgan State University. He was also a Licensed Master of Social Work (LMSW) in the State of New York. In May 1973, he helped found and then served as Chairman of the Fort Greene Council Inc. Under his leadership, the Council expanded its sponsorship of senior centers, offering a range of comprehensive services, from their first center located in Fort Greene-Clinton Hills to its present sponsorship of 13 centers located throughout Brooklyn. The expansion also included a meals-on-wheels program, two child care centers, COMPASS, and UPK for ALLs. He was a visionary who created and organized Jazz 966 in November 1990, opening its doors to the Brooklyn community at affordable admission fees at a modest $15.00 donation, which was an alternative to the expensive Jazz clubs in New York City. Jazz 966 featured world renowned artist, such as Wynton Marsalis, Trumpeter; Houston Person, Saxophonist; Etta Jones, Jazz Singer; and their own Danny Mixon, Pianist. For five years, he hosted and produced \"The Grand Ones,\" a weekly radio show formerly aired on WNYE, 91.5FM. He served as Chairman of Independent Brooklyn CORE for 16 years and helped fight for social justice and political empowerment. He was elected to Central Brooklyn's Community School Board No. 16, where he held the position of Chairman and was instrumental in initiating policies which dramatically improved the districts overall reading and math scores as well as its attendance rating. He was the recipient of more than 90 awards and accolades from various elected officials, block and tenant associations, PTAs, academic and religious orders, schools, fraternal groups, cultural institutions and other groups and was also honored by Ramapo College's Board of Trustees with its most prestigious award, the Fred and Florence Thomas Award. He was also the recipient of the inaugural Sam Pinn Educator Activist Award presented by Ramapo College's Minority Faculty and Staff Association for his years of advocacy on behalf of Ramapo's students, faculty and staff of color.",
    "year": 2020,
    "group": -1,
    "location": "Fulton Street,Brooklyn,NY",
    "lat": 22.673485500194328,
    "long": 24.501912498763907,
    "nlat": 22.673485500194328,
    "nlong": 24.501912498763907
  },
  {
    "id": "202022",
    "coname": "Joe Torres Way",
    "reason": "Joe Torres decided from a young age that he wanted to become a cook and eventually he opened Joe’s Place, renowned for its Puerto Rican cuisine. Many famous people visited Joe’s Place and author Kevin Fitzpatrick referred to Mr. Torres as one of the most beloved chefs in the Bronx in his book, 111 Places in the Bronx That You Must Not Miss. He died of the coronavirus.",
    "year": 2020,
    "group": 2,
    "location": "Westchester Avenue and Thieriot Avenue,Bronx,NY",
    "lat": 44.4299628177281,
    "long": 36.25366448104852,
    "nlat": 44.4299628177281,
    "nlong": 36.25366448104852
  },
  {
    "id": "202023",
    "coname": "Janta-Połczyńska Polish Heroes Way",
    "reason": "Walentyna Janta-Połczyńska (1913 -2020) and Aleksander Janta-Połczyński (1908 – 1974) were heroes in the fight against Nazism. Walentyna was one of the last surviving members of the Polish government in exile which was formed after Nazi Germany invaded Poland. They moved to New York and opened an antiquarian bookstore and opened their home to Polish artists and writers who escaped Communist dictatorship that had taken power after the War. Walentyna was known as the first lady of American Polonia. When Poland was invaded in 1939, she became a personal secretary to General Wladyslaw Sikorski, the prime minister of the Polish government in exile and commander of the Free Polish Armed Forces. She translated and prepared reports by Jan Karski, the underground courier who delivered eyewitness accounts of atrocities against Jews in the Warsaw ghetto and helped organize Dawn, a clandestine radio station that broadcast to Poland from an intelligence complex in England. She was active with the Jozef Pilsudksi Institute of America, a scientific research organization and archive in Brooklyn and the Kosciuszko Foundation (the American Center of Polish Culture). She was awarded the Medal of Merit for Polish Culture by Poland’s Ministry of Culture and National Heritage in 2011 and received the Jan Karski Eagle Award in 2016. Aleksander Janta-Połczyński was awarded the Cross of Valor, the Award of the Association of Polish Writers In Exile, Award for the Jurzykowski Foundation, among others for his writings. He was president of the American Council of Polish Cultural Clubs, a board member of the Polish Institute of Arts and Sciences of America and was second lieutenant of the cavalry of the Polish Army.",
    "year": 2020,
    "group": -1,
    "location": "43rd Avenue and Judge Street,Queens,NY",
    "lat": 30.746518031098937,
    "long": 35.043884431310126,
    "nlat": 30.746518031098937,
    "nlong": 35.043884431310126
  },
  {
    "id": "202024",
    "coname": "Dr. Roy Hastick Sr. Way",
    "reason": "Roy Hastick Sr. was uniquely adept at forging bonds and creating relationships with elected officials and business leaders that led to new opportunities for New Yorkers. He was a driving force in uniting businesspeople and a valued partner on so many issues directly impacting the Caribbean community. He joined the Battlehill Seminary in Grenada where he studied as a Catholic Priest for two years and later became the head detail for the Chief of Police in Tortola. He migrated to the United States in 1972 and worked at the Port Authority. He later joined the Brooklyn Economic Development Corporation to start discussions leading to the formation of a Caribbean American Chamber of Commerce (CACCI). In 1985, he founded the Caribbean American Chamber of Commerce and Industry, Inc. with 10 founding members and is still a well-recognized business entity. He was a well sought out motivational speaker and convened over 600 business development seminars. He was an elected delegate to the 1995 White House Conference on Small Business and was successful in getting Two-Way trade with the Caribbean region into the final recommendations that were submitted to the United States Congress. CACCI has provided emergency disaster relief in response to hurricane disasters in the Caribbean region and accomplished initiatives including providing weekly small business clinics, business services for microenterprises on how to start, manage, operate and expand a business in New York, workshops and business seminars. He received an Honorary Doctorate of Humane Letters from CUNY, the Goodwill Ambassador Award from the Jewish Community among many more.",
    "year": 2020,
    "group": 2,
    "location": "Caton Avenue and Flatbush Avenue,Brooklyn,NY",
    "lat": 17.06580252624722,
    "long": 26.84184967398427,
    "nlat": 17.06580252624722,
    "nlong": 26.84184967398427
  },
  {
    "id": "202025",
    "coname": "Bishop Ceacer Gooding Road",
    "reason": "Ceacer Gooding served in the United States Army and was later employed by the United States Postal Service. He attended the Manhattan Bible Institute and in 1958, was ordained as an Elder at Washington Temple COGIC and served as the Junior Pastor and Assistant Pastor of the Gospel Temple Church of America in New York City. He was Pastor of Gospel Temple Church of America in May 1965 for four years. In 1969, he and his wife founded Miracle Revival Center Church in Harlem, however, the congregation grew so much that they relocated to the Bronx. He was consecrated to the Bishopric in 1984 and became known as the “Radio Preacher” for 19 years, he was the recipient of numerous awards and was a very popular guest speaker and counselor.",
    "year": 2020,
    "group": 1,
    "location": "Macombs Road and West Mount Eden Avenue,Bronx,NY",
    "lat": 46.340094125151424,
    "long": 31.00929228611581,
    "nlat": 46.340094125151424,
    "nlong": 31.00929228611581
  },
  {
    "id": "202026",
    "coname": "Naimah Bilal Way",
    "reason": "Naimah Bilal was a lifelong, tireless community advocate born and raised in Harlem, NY. She began her community involvement at an early age under the leadership of other prominent community members, who marched for the construction of an overpass for the FDR Drive. The community successfully won the attention of the city who addressed the public safety concern. Later, Ms. Bilal and her family moved to Lenox Avenue in Harlem, and she continued to be active on several committees at Masjid Malcolm Shabazz. Ms. Bilal worked for the NYS Division of Housing & Community Renewal (DHCR) Representing the Clerical Staff of this Agency and Delegate of DC 37 until retiring after 22 years in October 2007. Upon moving to the Bronx, she became involved with several community-based organizations, including the 44th Precinct Community Council, CASA (Community Action for Safe Apartments), the Tenant, Block, and Neighborhood Council for District 16, and the Bronx Community Board 4. She advocated for Bronx residents to know their rights, to have more affordable housing, to prevent displacement, to organize tenant associations, and to become vocal community members. Naimah Bilal was the President of the 1515 Macombs Road Tenant Association.  She modeled for her community civil engagement through her membership with the Bronx Democratic Club and her local community board.  Furthermore, she was an active member of the DC37 Retirees. Ms. Bilal was a proud and accomplished mother, grandmother, great-grandmother, and a community organizer.  She encouraged all to get involved, especially the Youth, so they have a full understanding of what is going on in their communities and awareness of their rights and responsibilities; she empowered her community to become civically engaged and united. Ms. Bilal served as a beautiful example of those essential values. She made significant contributions to the Bronx. District 16 mourned the passing of an incredible community leader and advocate, Ms. Naimah Bilal, on July 17, 2018. She was persistent and steadfast in her efforts to fight for affordable housing and improved quality of life for Bronxites. Her work and her memory will live on. Council Member Vanessa L. Gibson, Congressman Jose Serrano, and NYS Senator Jose Serrano have had the honor and the privilege of working with and honoring Ms. Bilal and her many contributions.",
    "year": 2020,
    "group": 3,
    "location": "Macombs Road and Goble Place,Bronx,NY",
    "lat": 46.229764052827974,
    "long": 31.00466639374498,
    "nlat": 46.229764052827974,
    "nlong": 31.00466639374498
  },
  {
    "id": "202027",
    "coname": "Joanne Webb-Dixon Way",
    "reason": "Joanna Webb Dixon was a prominent member of her community. She was well known for her advocacy as a member of Community Board 3, participant of the 42nd precinct, and founding member of OEMs Bronx CERT 3. Joanne Webb-Dixon joined the Bronx 3 team in 2007, serving as deputy team chief until she passed away in 2017. Her accomplishments led to the annual Joanne Webb-Dixon NYC Cert Ambassador Award for community service. Each spring, NYC Emergency Management will present the award in Joanne’s honor to the CERT team that shows exemplary service in preparing communities for emergencies through education and resiliency. The Bronx 3 CERT team serves neighborhoods including Claremont Village, Concourse Village, Crotona Park, Morrisania, Woodstock, and Melrose. She was a member of the Parkchester Branch of the NAACP – Executive Committee Member; SDFCA community School District Twelve Advisory Council Member; Big Brother/Big Sister Program – School Volunteer; The Taino Lions Club; South East Bronx Neighborhood Centers (SEBNC); Woodstock Terrace Board of Directors; Voz Entertainment Group – Administrator; Vice President; NYPD 42nd Precinct Community Council Inc. – Correspondence Secretary, City of New York Community Board #3 – Chairperson of the Health and Human Services Committee and an active supporter of the Williamsbridge Club of the National Association of Negro Business and Professional Women’s Clubs Inc (NANBPWC).   In addition to her many acts and deeds of kindnesses throughout her lifetime, The Williamsbridge Club was proud to present their Community Service Award to Joanne Webb-Dixon in May 2003 for her commitment and service to the community.   Joanne served the seniors of the Davidson Center in the Bronx by helping them to monitor blood pressures through the New York City Department of Health.",
    "year": 2020,
    "group": 3,
    "location": "Trinity Avenue and 161st Street,Bronx,NY",
    "lat": 42.80436294751419,
    "long": 32.09405412016123,
    "nlat": 42.80436294751419,
    "nlong": 32.09405412016123
  },
  {
    "id": "202028",
    "coname": "Brandon Hendricks-Ellison Boulevard",
    "reason": "Brandon Hendricks-Ellison was killed a week after he graduated from Metropolitan Soundview High School. He was the victim of random gun violence at a party. He was a star athlete on his high school basketball team and had earned a scholarship to St. John’s University. A vigil was held in the Bronx after his death to protest gun violence and honor his life. As a result of his death, his family, along with local politicians and activists called for justice and change.",
    "year": 2020,
    "group": -1,
    "location": "Park Avenue and East 156th Street,Bronx,NY",
    "lat": 43.161014512155084,
    "long": 30.887083356992196,
    "nlat": 43.161014512155084,
    "nlong": 30.887083356992196
  },
  {
    "id": "202029",
    "coname": "Daniel C. Cestaro Way",
    "reason": "Daniel C. Cestaro was a veteran during the Korean War 1950-1953 and businessman who was the owner of Cestaro furniture located on Morris Park Avenue since the 1960’s. In 1973, he was one of the original founders of the Morris Park Community Association, serving as the first president and remained an active member throughout his life. He helped establish and develop the Morris Park Patrol and the Morris Park Columbus Day Parade. He helped establish Community Associations in Allerton Avenue, Pelham Parkway, Pelham Bay and Zerega Avenue which are vital associations in the community currently. He served on the advisory board of Jacobi Hospital, Westchester Square Hospital and Calvary Hospital for over 30 years. He actively campaigned for numerous local politicians for the benefit of the community and was an active member of St. Francis Xavier Church where he founded the Home School Association.",
    "year": 2020,
    "group": 2,
    "location": "Morris Park Avenue and Hone Avenue,Bronx,NY",
    "lat": 46.93503181061716,
    "long": 37.23808614324868,
    "nlat": 46.93503181061716,
    "nlong": 37.23808614324868
  },
  {
    "id": "202030",
    "coname": "Beatrice Castiglia Catullo Way",
    "reason": "Beatrice Castiglia Catullo was a humanitarian and nurse who devoted her life to charity work. She helped build a chapel for the Sister Servants of Mary, organized and became the first president of the Parkchester chapter of Cancer Care Inc. and founded the Medical Mission Aid Center at St. Raymonds Parish. In 1964, she founded a home attendant service for the elderly being discharged from hospitals without proper home care. In 1965, she incorporated and named this organization Regional Aid for Interim Needs R.A.I.N., which has since become one of the largest non-profit social services agency in the Bronx. R.A.I.N. was awarded its first government contract by the New York City Department for the Aging in 1975 to provide home care services and continues today. She was the first female inducted into the Rotary Club of the Bronx, which created an award in her honor called the Beatrice Castiglia Catullo Award in 2016 and she was also awarded with an Honorary Doctorate Degree by Mercy College.",
    "year": 2020,
    "group": 3,
    "location": "Morris Park Avenue and Matthews Avenue,Bronx,NY",
    "lat": 46.527408240478884,
    "long": 36.537432204866874,
    "nlat": 46.527408240478884,
    "nlong": 36.537432204866874
  },
  {
    "id": "202031",
    "coname": "Joe DeSimone Way",
    "reason": "Joseph Thomas DeSimone was born in the South Bronx. He attended Blessed Sacrament Cardinal Hayes. He was a gifted athlete and an even bigger sports fan, and from childhood filled his days with basketball, football, and baseball. Over the years, Joe took his passion for youth sports, determination, teamwork, hard-earned victories, and community to Spellman High School, where he coached both junior varsity and varsity football, leading his team to two A Division City Championships in 2006 and 2008 and joining the Catholic High School Football League Board of Governors. In 2018, he was inducted into the Spellman High School Hall of Fame, honored for his years of youth mentorship, the sense of family he created among his players, and the absolute conviction he cultivated that every single one of them was capable of and worthy of excellence.  In 2015, he returned to the Warriors, and served three more years as League President. During this time, he evolved the league with a transition to technology and connectivity, while maintaining Warrior traditions and values. He led the Warriors until 2018, during which he also initiated a free youth training clinic, open to all children of the community. Each spring, more than 100 children participate in the free program that was dedicated to ‘taking children back outdoors for fitness and fun. In 2019, he was honored by the Morris Park Community Association for his lifelong commitment as a Bronxite, demonstrated through his level of involvement with Little League baseball and football in the Bronx. Youth sports was his passion, and made him a local celebrity in the neighborhood. On 9/11, he was at the World Trade Center performing search and rescue efforts with his team from Con Ed, and continued for weeks with16-hour shifts. In 2006, Joe was diagnosed with Chronic Lymphocytic Leukemia. In 2008, the family had organized its first Team DeSimone for the Lymphoma Research Foundation’s Lymphomathon. Over the next 12 years the family, and the dear friends who are part of that family, have helped raise over $100,000 to find a cure in Joe’s honor, and in 2018 were recognized with the LRF’s Marnie Gordon Founder’s Award.",
    "year": 2020,
    "group": 2,
    "location": "Middletown Road and Stadium Avenue,Bronx,NY",
    "lat": 46.87802184096257,
    "long": 40.63760084147503,
    "nlat": 46.87802184096257,
    "nlong": 40.63760084147503
  },
  {
    "id": "202032",
    "coname": "Lorraine Nugent Way",
    "reason": "Lorraine Nugent was a dedicated community leader who devoted her time and leadership to many senior organizations in her community. Since 1990, she ran the local AARP group of seniors hosting monthly meetings. She was the first woman to be given the title of “commodore” for the Turner Club in Throggs Neck, which was originally organized in 1850 to give men a place to exercise and develop their physical abilities.  She was president of the local chapter of the Red Hat Society, (One of the premier women's social organizations in the world, the Red Hat Society based in Fullerton, CA, began with the gift of a red hat and has grown into a universal symbol for women around the globe as they victoriously celebrate turning 50 and entering into the next phase of their lives. The social message behind the first red hat has resonated with millions of women around the globe regardless of race, creed, occupation, age or socio-economic status. Today, it is commonplace to see Red Hat Society members out frolicking and embracing life to the fullest in their now famous symbol, the \"red hat.\") a group for women 50 years old and over that offered several community service events and programs. It provides women with opportunities for social interaction, both for reconnecting with old friends and making new ones.",
    "year": 2020,
    "group": 3,
    "location": "Bayshore Avenue and Ampere Avenue,Bronx,NY",
    "lat": 46.51897643699699,
    "long": 41.02847881996407,
    "nlat": 46.51897643699699,
    "nlong": 41.02847881996407
  },
  {
    "id": "202033",
    "coname": "5th Bombardment Squadron Memorial Way",
    "reason": "5th Bombardment Squadron was a bomber squadron based in Mitchel Field on Long Island. In the early morning of June 17, 1940, two Army B-18 bombers took off from Mitchel Field on for training drills. At 8:49 a.m., while the planes were flying at approximately 2,500 feet, the two Army B-18s locked wings. The two planes burst into flames and crashed into the residential community of Bellerose, Queens below. Local residents, many of whom were women, desperately tried to save the victims of the plane crash before the fire department and emergency medical staff arrived. Neighbors used garden hoses, a fire extinguisher and blankets to treat burn victims and put out fires. Three fire trucks, two engines and a rescue squad responded to the crash. Ultimately, the efforts of the community and the first responders were not enough to combat the impact of the crash and the subsequent heat and fire caused by the gasoline used to power the large planes. All eleven Army Airmen were killed as was Mrs. Emily Kraft, who died the next day from burns she received after her home was set ablaze by one of the planes.",
    "year": 2020,
    "group": -1,
    "location": "Hillside Avenue and 239th Street,Queens,NY",
    "lat": 29.351992268965876,
    "long": 50.0,
    "nlat": 29.351992268965876,
    "nlong": 50.0
  },
  {
    "id": "202034",
    "coname": "Council Member Thomas V. Ognibene Way",
    "reason": "Thomas V. Ognibene was elected to the New York City Council in the November 1991 election in the newly created 30th Council District, and subsequently re-elected in 1993 and 1997, serving the full ten years allowed by term limits. During this time, he served on the Finance, Public Safety, Housing and Buildings, Standard and Ethics, and General Welfare committees. In 1995, he was appointed by Speaker Peter F. Vallone to the Council’s Leadership Team and Budget Negotiating Committee, where he gained extensive experience in negotiating the City’s legislative and financial agenda with the Mayor. On November 23, 1994, he was elected as the Minority Leader of the New York City Council. As Minority Leader, he was well known as respected for his passionate defense of his communities’ middle class principles. He made numerous appearances on national and local television and radio and was particular well known for his appearances on NY1, where he was earned a reputation as an aggressive debate. He was instrumental in the complete renovation and reconstruction of Juniper Valley Park in the 1990s and early 2000s. He served as Executive Vice Chairman and Executive Director of the Queens County Republican Party, President of the Evergreen Republican Club, Law Chairman of the Queens County Conservative Party and was a member of the Blackstone Lawyers Club, Catholic War Veterans, American Legion, Americans of Italian Heritage and Glendale Kiwanis.",
    "year": 2020,
    "group": 2,
    "location": "83rd Street and Furmanville Avenue,Queens,NY",
    "lat": 27.070266960351187,
    "long": 35.75712556180742,
    "nlat": 27.070266960351187,
    "nlong": 35.75712556180742
  },
  {
    "id": "202035",
    "coname": "Neir’s Tavern Way",
    "reason": "Neir’s Tavern recently celebrated 191 years in existence as a staple in the local community of Woodhaven. According to its website, founded in October of 1829, “it is one of the few old drinking establishments that have been in almost continuous operation (Prohibition notwithstanding) and in the same location, for its entire history.” Neir’s Tavern has been included in several Hollywood films, including Goodfellas starring Robert DeNiro, Joe Pesci, Ray Liotta, and Lorraine Bracco, and Tower Heist, starring Ben Stiller, Eddie Murphy, Tea Leoni, and Alan Alda. The Tavern has survived several ownerships and attempts to sell the property. Recently, Council Member Holden, along with the Queens Chamber of Commerce, Assembly Miller Mike Miller, Community Board 9, and the Mayor’s office, helped broker a lease agreement deal that would allow for the Tavern’s continued operation at this location. Neir’s Tavern has contributed to several philanthropic efforts over the years and has hosted food giveaways during the coronavirus pandemic. Under the leadership of Loycent Gordon, an active FDNY firefighter, Neir’s Tavern continues to serve the community with honor and distinction.",
    "year": 2020,
    "group": -1,
    "location": "78th Street and 88th Avenue,Queens,NY",
    "lat": 22.67517795984469,
    "long": 36.3757145812491,
    "nlat": 22.67517795984469,
    "nlong": 36.3757145812491
  },
  {
    "id": "202036",
    "coname": "Detective Jeffrey A. Lee Way",
    "reason": "Detective Lee served with the NYPD for 25 years. He was assigned to the 112th Precinct Detective Squad and made hundreds of arrests, earning him promotions to Detective Investigator and Detective 2nd Grade. He died as a result of 9/11 related illness following his assignment to the search and recovery efforts at Ground Zero.",
    "year": 2020,
    "group": 0,
    "location": "Yellowstone Boulevard and Austin Street,Queens,NY",
    "lat": 27.686794941893556,
    "long": 37.563000484825494,
    "nlat": 27.686794941893556,
    "nlong": 37.563000484825494
  },
  {
    "id": "202037",
    "coname": "Rabbi Dr. Asher Murciano Way",
    "reason": "Rabbi Dr. Asher Murciano was the Rabbi for the Sephardic Jewish Center for 67 years making him the country’s longest serving Sephardic rabbi of the same congregation. Additionally, he was a noted rabbinical scholar. He was sent to Menkes, Morocco, to the home of the Chief Rabbi, where he studied and sang with the famous Sephardic singer, Joe Amar. Ordained by Rabbi Baruch Toledano, he achieved the highest degree of Yore Yore Yadin Yadin, an ordination that permits a rabbi to make rabbinical decisions on Jewish law. In 1948, arrangements were made by the Mirrer Yeshiva in Brooklyn, to bring the top eighteen students from Morocco to study at the world-renowned graduate school for Talmudic scholars. Shortly after arriving, he officiated at both Sephardic and Syrian synagogues in Brooklyn. While attending the Mirrer Yeshiva and Yeshiva University (YU) on weekdays, he commuted to Philadelphia to officiate at Mikve Israel, the Spanish and Portuguese Synagogue, as Assistant Rabbi and Hazan for three years. In 1953, he became the rabbi of the Sephardic Jewish Center of the Bronx. He earned his Ph.D. at NYU. He taught at York College and YU. He became a respected member of the Rabbinical Council of America and the New York Board of Rabbis. He was Chaplin to the Sephardic Jewish Brotherhood of America and the Sephardic Home for the Aged. For thirty-five years, he was a chaplain at Jacobi Hospital. He was beloved by all who knew him for his distinct religious services, Tora reading, Haftarot, scholarship, divre Tora. His services and compassion touched so many people, young and old, from all the Sephardic communities in the greater New York area.",
    "year": 2020,
    "group": 1,
    "location": "108th Street and 67th Avenue,Queens,NY",
    "lat": 28.66006597238221,
    "long": 37.94209534261988,
    "nlat": 28.66006597238221,
    "nlong": 37.94209534261988
  },
  {
    "id": "202038",
    "coname": "Mary Sansone Way",
    "reason": "Mary Sansone was a lifelong community activist. She founded the Congress of Italian-American Organization, a social services organization and CURE, a nonprofit corporation dedicated to reducing ethnic and racial tension and building diverse relationships throughout the community. When her son was killed in a plane accident, she created a scholarship program in his name for high school graduates. Working for the United Nations Relief Fund, she accompanied two orphaned children to twenty-three states to raise funds for war torn Italy. The trip culminated in a visit with President Truman where she was awarded his pen used to sign the bill allocating funding for this cause. In conjunction with Bayard Rustin, she formed the first coalition of Italian, African and Spanish Americans to stop gang violence that was plaguing the city. She helped establish the New Era Democratic Club, a group which backed candidates based on their platform not party ties and also helped start the first pre-K programs and after school and senior center activities",
    "year": 2020,
    "group": 3,
    "location": "DeGraw Street and Henry Street,Brooklyn,NY",
    "lat": 21.928955727999472,
    "long": 22.901314031384544,
    "nlat": 21.928955727999472,
    "nlong": 22.901314031384544
  },
  {
    "id": "202039",
    "coname": "Joseph A. Ferris Way",
    "reason": "Joseph A. Ferris was a five term New York State Assembly Member from Brooklyn, fighting against redlining policies and chairing the Science and Technology Committee, where he advocated for projects utilizing reusable energy. He also co-founded the Slope Independent Democrats which would become the Central Brooklyn Independent Democrats, a very important civic organization today. After his time in the Assembly, he stayed through the Park Slope Civic Council, the Kensington Community Council, both which he also co-founded, and the Magnolia Tree Institute. All remain important community organizations to this day. Afterwards, he remained active in the community, testifying at community board hearings, working as a substitute teacher, and advocating for local issues ranging from manufacturing jobs to City Council term limits. Additionally, he worked to preserve important cultural touchstones, namely the Old Stone House in Washington Park, and helped found the Brooklyn Irish-American Day Parade. He passed away from COVID-19.",
    "year": 2020,
    "group": 2,
    "location": ",Brooklyn,NY",
    "lat": 20.91689535201763,
    "long": 28.353424530253818,
    "nlat": 20.91689535201763,
    "nlong": 28.353424530253818
  },
  {
    "id": "202040",
    "coname": "Jose A. Perez Way",
    "reason": "Jose A. Perez died after giving his life in the line of duty while responding to another officer’s request for help. He was an outstanding and devoted man of peace who offered himself for the sake of saving others, and was posthumously awarded the New York Police Department Purple Shield Medal for his sacrifice.",
    "year": 2020,
    "group": 0,
    "location": "3rd Street and Prospect Park West,Brooklyn,NY",
    "lat": 19.40188475966004,
    "long": 25.405251995983356,
    "nlat": 19.40188475966004,
    "nlong": 25.405251995983356
  },
  {
    "id": "202041",
    "coname": "Pete Hamill Way",
    "reason": "Pete Hamill was born in Park slope to Irish immigrants, and was the editor of three New York daily newspapers, working for over 40 years covering events and issues like conflicts in Vietnam, Lebanon, Nicaragua, and Northern Ireland as well as racial and class tensions throughout New York City. He wrote for the New York Daily News, the New York Post, Newsday, the Village Voice, New York magazine, and Esquire, among other publications. He won a Grammy award in 1975 for writing the liner notes to Blood on the Tracks by Bob Dylan, and is considered a legendary columnist and journalist for his extensive work and dedication covering New York City. He also authored numerous novels that popularized his writing style and love for New York City. He was considered a bona fide New York celebrity, featured in numerous gossip columns for being associated with figures like Jacqueline Kennedy, promoting his books on television, and attending numerous charity events and parties. He was also well-known for his advocacy, standing up to publishers over pay and treatment of employees, and also made news when, as Editor-in-Chief of the New York Post, promoted and hired several women and minority employees and reporters. He was a nationally recognized author and journalist for his books and columns, and won a George Polk Career Award in 2014 for his lifetime contributions to journalism.",
    "year": 2020,
    "group": 2,
    "location": "7th Avenue,Brooklyn,NY",
    "lat": 19.285196528108877,
    "long": 24.679721477601095,
    "nlat": 19.285196528108877,
    "nlong": 24.679721477601095
  },
  {
    "id": "202042",
    "coname": "Firefighter John “Jack” Toomey Way",
    "reason": "John Toomey was assigned to Brooklyn’s Ladder Company 123. He died in the line of duty when he suffered a heart attack while fighting a fire in a building on Crown Street.",
    "year": 2020,
    "group": 0,
    "location": "Hoyt Street,Brooklyn,NY",
    "lat": 21.748152245741682,
    "long": 23.82351446316025,
    "nlat": 21.748152245741682,
    "nlong": 23.82351446316025
  },
  {
    "id": "202043",
    "coname": "St. Raphael of Brooklyn Place",
    "reason": "Raphael Hawaweeny was the first Orthodox bishop consecrated in North America in 1904. He founded The Word, the official news magazine of the Antiochian Archdiocese which is still published monthly today, and informs readers of Orthodox news and also educates and inspires with articles on faith and practice. He traveled throughout the United States and founded thirty parishes in North America. His feast day is celebrated in the Antiochian Archdiocese on the first Saturday of November. He founded a cathedral in Brooklyn’s Little Syria and became St. Raphael of Brooklyn.",
    "year": 2020,
    "group": 1,
    "location": "State Street,Brooklyn,NY",
    "lat": 22.590006071508302,
    "long": 23.95469722641056,
    "nlat": 22.590006071508302,
    "nlong": 23.95469722641056
  },
  {
    "id": "202044",
    "coname": "Cecil Corbin-Mark Way",
    "reason": "Cecil Corbin-Mark was a long-time Harlem activist and was the Deputy Director of the non-profit WE ACT for Environmental Justice. He was an environmental advocate from Harlem who advocated for health protections and climate action and was instrumental in getting environmental laws passed. Prior to joining WE ACT, he worked for the Bronx County District Attorney, NYS Justice Hon. W. T. Martin, the Mellon Minority Scholars Program and the NY Public Library. He served on the Center for Environmental Health, Clean and Healthy New York, the Louis E. Burnham Fund, the West Harlem Development Corporation, and Friends of the Earth USA and was the recipient of the 2010 Earth Day New York Award and the 2018 Marshall England Memorial Public Health Award. He assisted in the passage of a number of environmental justice laws, from lead paint regulations to emission reductions targeting climate change. He advocated at City Hall and the State Capitol, and testified before Congress about the health risks of climate change. He helped run summer basketball teams for neighborhood youth and mentored formerly incarcerated teens through the Friends of Island Academy.",
    "year": 2020,
    "group": 2,
    "location": "143rd Street and Convent Avenue,Manhattan,NY",
    "lat": 43.05425232774206,
    "long": 28.05233452706431,
    "nlat": 43.05425232774206,
    "nlong": 28.05233452706431
  },
  {
    "id": "202045",
    "coname": "Lewis A. Fidler Way",
    "reason": "Lewis A. Fidler was a Council Member who represented the 46th District in Brooklyn, New York. While he served at the Council, he chaired the Youth Services Committee and served as assistant majority leader under Speaker Christine Quinn. He was president and chairperson of Hillel Foundation of Brooklyn, president of Brooklyn Division of American Jewish Congress, chairperson of the Wyckoff House Neighborhood Advisory Board, board member of the B’nai Brith Metro North Region and Community Advisory Board Member of the Fenichel House Home for Disabled Adults. He also was the Democratic State Committeeman and District Leader of the 41st Assembly District and Chairperson of Community Board 17.",
    "year": 2020,
    "group": 2,
    "location": "Avenue R and Haring Street,Brooklyn,NY",
    "lat": 10.251197605794047,
    "long": 28.53165043501203,
    "nlat": 10.251197605794047,
    "nlong": 28.53165043501203
  },
  {
    "id": "202046",
    "coname": "Mary “Mary C” Cali-Dalton Way",
    "reason": "Mary “Mary C” Cali-Dalton attended Bishop Kearney where she graduated in 1971 and spent her early years performing as a singer in a band called \"The Underground Railroad\" where her and her friend Maryanna performed a different variety of genres of music including Rock, Jazz and Disco. They were based in Brooklyn and Manhattan and performed at bars in the neighborhood and venues for parties and weddings. In 2002, she moved to New Dorp Beach and instantly fell in love with the neighborhood and was widely known throughout her neighborhood and community. When New Dorp Beach was hit by Hurricane Sandy in October 2012, although a victim herself of the storm, she worked tirelessly to make sure her neighbors and co-workers who were also affected did not go without help. She set up clothing and food donations within the Recreation Centers on the island and helped set up housing situations for those who had lost their homes. She joined the New York City Parks and Recreation in 1999 as a WEP participant and is recognized as a true success story for the Parks Department. In 2000, she was promoted to a Playground Associate and 5 months later, was promoted to a Recreation Specialist position. In 2002, she was promoted to Borough Director of Recreation. She was Chief of Recreation for Staten Island from 2003 until 2019 and was nicknamed \"The Chief of Magic.\" She was Vice President of the Emerald Society in 2006 and became President of the Emerald Society in 2009 until her passing in 2019. Mary dedicated herself to everything she did in her life and she juggled many plates. No matter the situation at hand she always faced it with a smile and a coffee in hand for back up. She had the ability to make anyone laugh even through the toughest times. She had a hand in so many things in our community between the parks department and outreach for people struggling with addictions. Mary had struggled with alcohol addiction herself and was 20 years sober to the date of her death.",
    "year": 2020,
    "group": -1,
    "location": "Cedar Grove Avenue and Milbank Avenue,Staten Island,NY",
    "lat": 2.9700227277502775,
    "long": 12.759531422912868,
    "nlat": 2.9700227277502775,
    "nlong": 12.759531422912868
  },
  {
    "id": "202047",
    "coname": "Floyd H. Flake Boulevard",
    "reason": "Rev. Floyd H. Flake is a former member of the United States House of Representatives serving from 1987 to 1997, former president of Wilberforce University and senior pastor of the Greater Allen African Methodist Episcopal Cathedral. Greater Allen African Methodist Episcopal Cathedral has become one of the nation’s foremost Christian churches and is listed among the top twenty churches in America in Outreach Magazine’s Annual Survey. He also authored a best-selling book called, The Way of the Bootstrapper: Nine Action Steps for Achieving Your Dreams, and the, African American Church Management Handbook. In Congress, he funded the Nation’s first One Stop Small Business Capital Center which is the model for additional centers that are now operating in the Federal Empowerment Zones and provides technical assistance and loans to small businesses.",
    "year": 2020,
    "group": 1,
    "location": "Merrick Boulevard,Queens,NY",
    "lat": 21.764726152404883,
    "long": 45.68701053393091,
    "nlat": 21.764726152404883,
    "nlong": 45.68701053393091
  },
  {
    "id": "202048",
    "coname": "David F. Bluford Way",
    "reason": "David Franklin Bluford served in the U.S. Army during the Korean War, and earned an honorable discharge. Upon completing his undergraduate studies at Fayetteville State University in North Carolina, he earned a Masters of Arts from CUNY Hunter College, as well as certifications for Advanced Study in Education at Columbia University and St. John’s University. He later served as an Assistant Superintendent and Junior High School Principal in East Harlem’s Community School District 4, and a middle school teacher in Brooklyn’s Community School District 23. His history as an administrator included stints as director of the Upward Bound college preparatory program at CUNY Queens College, and adjunct professor of educational administration at CUNY Brooklyn College and St. John’s University. Locally, he served on the Board of Directors of the Queens Urban League, and as Chairman of the Alpha Phi Alpha Senior Center and Community School Board 29 in Southeast Queens. His personal affiliations also include the Jamaica NAACP branch, Freemasons, and Alpha Phi Alpha Fraternity, Inc. He received many awards, such as Outstanding Educator, Jamaica Branch of the NAACP, the Jackie Robinson Junior High School Man of the Year Award, The Distinguished Citizens Service Award and the Community Service Award.",
    "year": 2020,
    "group": 1,
    "location": "178th Place and Murdock Avenue,Queens,NY",
    "lat": 23.515842489641166,
    "long": 45.456341304294355,
    "nlat": 23.515842489641166,
    "nlong": 45.456341304294355
  },
  {
    "id": "202049",
    "coname": "Priscilla Carrow Way",
    "reason": "Priscilla Carrow was a community activist and public servant who dedicated her life to the East Elmhurst/Corona community. She worked with the New York State Department of Labor and the New York State Senate. In 1994, she worked for the New York City Health and Hospitals/Elmhurst. She was a member of the Communications Workers of America Local 1180 since 2006, was a Senior Shop Steward in her Union and was a long time member of Queens Community Board 4. She served as Executive Director for the Lefrak City Youth and Adult Activities Association and Program Director for the Kenny Anderson Basketball Classic to assist in encouraging healthy sports activities and opportunities for all ages. She served as a Delegate for the 11th Judicial Convention and County Committee person of the 35th Assembly District, Queens County. She also served as the chairperson of the National Council of Negro Women/Empress Life Members Guild, secretary for the Better Community League (BCL), member of the Ericsson Street Block Association 27th & 29th Avenues, the Fredrick Douglas Democratic Association, a member of the Corona East Elmhurst N.A.A.C.P., Friends of the Queens Library, chair of EHC Sports and Recreation Committee, You Can Go To College Committee, Co-Founder/Vice-President of the Democratic Association of the 21st Century Club,  Sherwood Village Tenant Association President, member of First Baptist Church and received numerous awards from various civic organizations and elected officials. Her latest award from the late New York State Senator Jose Peralta who presented her with the 2015 Woman History Month Award in recognition of her Outstanding Community Service. She died of complications from COVID-19.",
    "year": 2020,
    "group": 3,
    "location": "98th Place and 57th Avenue,Queens,NY",
    "lat": 30.031644421241026,
    "long": 36.566309288354496,
    "nlat": 30.031644421241026,
    "nlong": 36.566309288354496
  },
  {
    "id": "202050",
    "coname": "Lorena Borjas Way",
    "reason": "Lorena Borjas was born in Veracruz, Mexico in 1960 and came to the United States in 1980. She became an advocate for the LGBT Community and inspired many people. She made sure people were treated fair and justly whether it be at health clinics or courthouses. In 2012, she co-founded the Lorena Borjas Community Fund and was actively involved in many organizations including the Latino Commission on Aids, AIDS Center of Queens County, Hispanic AIDS Forum, the Latino Commission on AIDS and she became a counselor for the Community Healthcare Network's Transgender Family Program, where she worked to obtain legal aid for victims of human trafficking. She died of complications from COVID-19.",
    "year": 2020,
    "group": 3,
    "location": "83rd Street,Queens,NY",
    "lat": 30.556367902304203,
    "long": 34.553807863858275,
    "nlat": 30.556367902304203,
    "nlong": 34.553807863858275
  },
  {
    "id": "202051",
    "coname": "Vera E. Thompson Way",
    "reason": "Vera E. Thompson was a dedicated Funeral Director in East Elmhurst who opened the Vera E. Thompson Funeral Home On January 26, 1955 and continued to serve the community for over 50 years while providing comfort to hundreds of family’s during their time of loss. She became the first African-American female Funeral Director in the history of Queens as she made her career in a then male dominated industry while balancing her profession and raising five children. She was a devoted catholic and standing member of the St. Gabriel Catholic Church and school where she raised her children. Her name and business graced Astoria Blvd along 94th Street for five decades as she became a true staple in the community.",
    "year": 2020,
    "group": 3,
    "location": "94th Street and Astoria Boulevard,Queens,NY",
    "lat": 33.83925170717424,
    "long": 35.189619894593335,
    "nlat": 33.83925170717424,
    "nlong": 35.189619894593335
  },
  {
    "id": "202052",
    "coname": "Lamont “Big L” Coleman Way",
    "reason": "Lamont “Big L” Coleman was an American rapper and songwriter from Harlem who was considered one of the greatest rappers of all time. He was known amongst underground hip-hop fans for his freestyling ability and eventually signed to Colombia Records. He was killed by an unknown assailant in 1999 and since then, many tributes have been given to him by The Source magazine and a mural was constructed in his honor at 140th Street and Malcolm X Boulevard. The mural attracts over 4,000 visitors each year.",
    "year": 2020,
    "group": -1,
    "location": "140th Street and Malcolm X Boulevard,Manhattan,NY",
    "lat": 42.132837651035935,
    "long": 28.90469986694101,
    "nlat": 42.132837651035935,
    "nlong": 28.90469986694101
  },
  {
    "id": "202053",
    "coname": "Calle Frenchie",
    "reason": "Santos “Frenchie” Ramos grew up in Puerto Rico and later came to New York in his 20’s. When he was 36 years-old, he opened Frenchie’s Gym in Williamsburg and remained open for 43 years, helping kids stay off the streets and away from drugs and gang violence. He also was a referee at the first WrestleMania.",
    "year": 2020,
    "group": 2,
    "location": "Marcy Avenue and Broadway,Brooklyn,NY",
    "lat": 25.52628633794657,
    "long": 26.987674478535368,
    "nlat": 25.52628633794657,
    "nlong": 26.987674478535368
  },
  {
    "id": "202054",
    "coname": "Antoinette Ali-Sanders Way",
    "reason": "Antoinette Ali-Sanders was a 3rd generation college graduate. She worked to improve the society as a community developer, organizer, and scholastically trained as a Landscape Architect, with a minor in Civil Engineering. She was one of the first Black women, to graduate in Landscape and Architecture from Rutgers University in New Brunswick, NJ. She worked for the NYC Parks Department for 35 years. As a Parks employee, she worked with the first group of women out in the field in 1981. While working for the Parks Department, she prepared contract drawings and documents, inspected, monitored, managed and supervised the construction of parks, playgrounds, structures, and the restoration of monuments. She founded a construction company called Metro Skyway Construction, a foundation for PEACE (Progressive Economics and Cultural Enrichment) and a trade union Jersey City Monitoring Trade Association. She worked closely with Rev. Al Sharpton, Mayor Dinkins and Dr. Fulani where she became a member of the Committee for Independent Community Actions. One of her last architectural projects was for a Pan African activist named Queen Makkada who was planning to build a school in Africa. She was given the honorary title of Lady Jamilah before her passing.  She also hosted a cable access show promoting fairness and equal opportunities in education and wellness in the black community and was a member of the Association of Black Educator of New York.",
    "year": 2020,
    "group": 3,
    "location": "Beach 17th Street and Seagirt Boulevard,Queens,NY",
    "lat": 8.269174881703295,
    "long": 47.50238541188014,
    "nlat": 8.269174881703295,
    "nlong": 47.50238541188014
  },
  {
    "id": "202055",
    "coname": "Chanta Howard Way",
    "reason": "Chanta Monique Howard served as president of Redfern Housing Advisory Board, served as manager of the Stack Angels Dance group, co-founded the Rockaway Female Softball league and she was a strong pillar for the NYCHA Redfern Housing Development. She organized barbeque events and offered free school supplies for students. She assisted in founding multiple organizations. She founded the Redfern’s Fallen Angels, an event where hundreds of residents gather in the middle of Redfern and honor former residents of Redfern that have lost their lives to gun violence or sickness. She organized the It Takes a Village to Raise a Child event to honor all the seniors in the development by providing certificates labeled as Redfern Heroes.",
    "year": 2020,
    "group": 3,
    "location": "Hassock Street and Beach Channel Drive,Queens,NY",
    "lat": 10.444275232362523,
    "long": 47.26299051831063,
    "nlat": 10.444275232362523,
    "nlong": 47.26299051831063
  },
  {
    "id": "202056",
    "coname": "Benjamin Wright Way",
    "reason": "Benjamin Wright Jr. moved to New York City in 1950. He was employed by the City of New York for twenty-seven years, retiring as Assistant Deputy Commissioner of the Department of Homeless Services (DHS) in 1996. After retirement, he founded Green World Unlimited, Inc., located on Wall Street where he served as Chairman. He then spent the rest of his life organizing Southeast Queens and working with community based organizations. He served as president of the Southeast Queens Democratic Club, president of the Thurgood Marshall Regular Democratic Club, chairman of the board of the S.G.G.C. Community Service Agency, and afterschool service program which includes tutoring and free meals five days a week, was a lifelong member of the NAACP and was a board member as the treasurer of the Jamaica Branch, was a board member of the United Black Men of Queens where he served as vice president and treasurer, was a member of the Advisory Board of the Emblem Health Insurance Plan, was a member of the of the York College Community Advisory Committee, served on Community Board 12, was a member of the administrative board of the Springfield Gardens United Methodist Church and served as administrator of a GED Program for Adolescents in the Riker’s Island Correctional Institution for Women.",
    "year": 2020,
    "group": 2,
    "location": "158th Street and 140th Avenue,Queens,NY",
    "lat": 19.568355700737364,
    "long": 44.947165558901,
    "nlat": 19.568355700737364,
    "nlong": 44.947165558901
  },
  {
    "id": "202057",
    "coname": "Jules Taylor Way",
    "reason": "Jules Taylor, Jr. was born in Port-au-Prince, Haiti and later moved to the United States. He began his career in Human Resources and worked in various positions over the course of his more than 30-year career. His last position was at East Side House Settlement in the Bronx as their Human Resources Manager. After settling in Rosedale, Queens, NY, he became active with the JFK Rotary Club, and served as president from 2008 until 2010. As president, he assisted in helping the biggest fundraiser for the JFK Rotary Club, the “5K Runway Run” go from 150 runners to 1,500 runners and from $10,000 to $40,000 in 5 years. In addition, he served as president of the Brookville Park Tennis Club where he was instrumental in securing a brand new tennis court for the club. He was also served on the Board of the Rosedale Civic Association, Inc. for many years, where he held the positions of second vice-president and co-chair of the fundraising committee. He died of COVID-19.",
    "year": 2020,
    "group": 2,
    "location": "232nd Street and Edgewood Avenue,Queens,NY",
    "lat": 18.42580821047186,
    "long": 48.00579368202305,
    "nlat": 18.42580821047186,
    "nlong": 48.00579368202305
  },
  {
    "id": "202058",
    "coname": "Harry T. Burleigh Place",
    "reason": "Henry “Harry” Thacker Burleigh was a baritone singer, composer and arranger. Born in Erie, Pennsylvania, he later became the first African-American soloist at St. George’s Episcopal Church of New York, a position he held for over 50 years. He also became the first African-American chosen as a soloist at Temple Emanu-El, a synagogue. He also worked as an editor for G. Ricordi, a music publisher. Several of his compositions were published, including Ethiopia Saluting the Colors, Jubilee Songs of the USA and Deep River, his most memorable composition. He was a charter member of the American Society of Composers, Authors and Publishers (ASCAP) when it was established in 1914 and became a member of its board of directors in 1941. He received numerous awards, including the Spingarn Medal in 1917 and also received honorary degrees from Atlanta University and Howard University for his contributions as a vocalist and composer.",
    "year": 2020,
    "group": 1,
    "location": "East 16th Street and 3rd Avenue,Manhattan,NY",
    "lat": 29.52248851948278,
    "long": 24.178894177450786,
    "nlat": 29.52248851948278,
    "nlong": 24.178894177450786
  },
  {
    "id": "202059",
    "coname": "Walther Delgado Way",
    "reason": "Walther Delgado was born in the Dominican Republic and migrated to New York City when he was 11 years-old. He saw a neighborhood, Washington Heights, with so much promise but plagued with inequality and lack of access to basic resources like education, housing and economic development. He made it his life mission to fill the gap through community actions by leading from the front and engaging Washington Heights' best resource; its people. He was on the steering committee that founded both Alianza Dominicana and the Audubon Partnership. If not for his contribution, Alianza Dominicana would not have been the agent for change that it was for the community in the 1990’s. Alianza Dominicana offered the first drug treatment program in the neighborhood, access to immigration lawyers, and so much more. The majority of his efforts, however, were spent on launching the Audubon Partnership based in Inwood, which allowed residents of Washington Heights and Inwood access to development services through lending and business advocacy classes. His goal was to teach residents how to help themselves, so that immigrants could create a fruitful, sustainable, and equitable livelihood. In 1998, the federally financed Upper Manhattan Empowerment Zone provided his organization with a $750,000 revolving loan to fund commercial development within Community Board 12. As a result, many small businesses were begun which still function today. From 1998 until 2002, he served on the community board and eventually as the board Chair.  In 2003, he helped create Sherman Creek Park.",
    "year": 2020,
    "group": 2,
    "location": "207th Street and Post Avenue,Manhattan,NY",
    "lat": 49.37368319777812,
    "long": 30.811689252801127,
    "nlat": 49.37368319777812,
    "nlong": 30.811689252801127
  },
  {
    "id": "202060",
    "coname": "Victor Victor Way",
    "reason": "Victor José Victor Rojas was born in Santiago de los Caballeros. His professional life began in 1972, with the authorship of La Casita (The Little House), which he sang with Wilfrido Vargas. This piece became such a great success that it inspired the budding author to launch his career as a performer and composer, work that kept him busy for the rest of his life. In the 1970s, his dissatisfaction with domestic politics and economic policies in the Dominican Republic, added to increasing international turmoil, inspired him to write songs with social and political content as his aesthetic compass. Mr. Víctor also took part in the movement opposed to the Dominican dictator Rafael Trujillo, and he began to write protest songs. As a young man he traveled the country as part of youth groups protesting the government while receiving an education in local rhythms. Between 1973 and 1978, he founded and led the group Nueva Fortuna, with which he traveled all over the country. In 1978, he created the group Flamboyán, through which he projected his music as a sample of rhythmic intermixing. For five years he shared the stage with the most important figures of the Latin American song and performed in Puerto Rico, Venezuela, Cuba, the United States and Italy. Victor Victor studied the musical roots of merengue and bachata, recreated the genre and enriched it. Successes such as “Mesita de noche”, “Ando buscando un amor” y “Así es mi amor” were made with simplicity and beautiful metaphors and have been performed by leading Dominican and foreign vocalists. In 1990, he released his fourth album, entitled “Un chin de veneno”, which was an international success. It succesfully fuses Caribbean rhythms in a new style. Victor Victor has to his credit the long-running albums entitled “Álbum rojo”, “Flamboyan”, “Con sus flores y sus vainas”, “Cotidiano”, “Artistas por la paz”, “Inspiraciones”, “Tu corazón” y “Alma de Barrio”. In 2007, he recorded the social-themed album “Verde y negro” as a tribute to the freedom fighters of the Dominican Republic. Victor died of COVID-19 at a hospital in Santo Domingo at age 71. The artist was awarded the Awards: Premios A Lo Nuestro, Aplauso 92, Ronda, ACE, Aplauso 98, ASCAP and ONDA. Victor Victor remains a beloved and influential artist for hundreds of thousands of Dominicans in New York City.",
    "year": 2020,
    "group": -1,
    "location": "176th Street and Fort Washington Avenue,Manhattan,NY",
    "lat": 46.692827112042536,
    "long": 28.787821633531273,
    "nlat": 46.692827112042536,
    "nlong": 28.787821633531273
  },
  {
    "id": "202061",
    "coname": "Miguel A. Melenciano Way",
    "reason": "Miguel A. Melenciano was a renowned communicator and supervisor of the Central Electoral Board (JCE) in the United States. Many personalities of the Quisqueyan community in the City, including politicians, professionals, journalists, businessmen, artists, community members, winemakers, taxi drivers and ordinary citizens have lamented his death. He was a good communication and legal professional. He excelled as a JCE official during the 2004, 2008, 2010 and 2016 elections and was later transferred to the headquarters of that body in New Jersey, where he was appointed to supervise in all the states of the aforementioned constituency, which includes Canada. He was also financial and marketing manager of the Association of Winemakers of the United States (ASOBEU), where he did administrative work and began his first steps in media communication in the program \"Enlace\" that he produced and co-led with a reporter and Elías Barreras Corporán on a radio station and channel 35 of Time Warner Cable. He collaborated with several national media including El Nuevo Diario, and was one of the first publishers on the European platform Globedia. The three of them ventured as pioneers of one of the first community FM radio stations that broadcast from CULTURARTE on Audubon Avenue in Upper Manhattan. He worked for years in the public relations team of the entertainment entrepreneur Félix Cabrera, with whom he organized the deliveries of turkeys on Thanksgiving Day and toys to poor children at Christmas. He was part of the organization and assembly of large shows staged by the JCE at the United Palace Theater in Upper Manhattan, stages in New Jersey, Florida and Puerto, to attract the Dominican vote abroad with great success. He was currently the co-anchor of the program \"El Show de Carlos de La Vega\", which is broadcast on Super Canal from 9:00 to 10:30 at night. His most recent media project was the newspaper \"El Nacional USA\" in digital and printed editions. He was also working with businessman Carlos Gómez and other leading figures in the Dominican diaspora in New York, being a business advisor and aspiring candidates for elective positions.",
    "year": 2020,
    "group": 2,
    "location": "Broadway and 213th Street,Manhattan,NY",
    "lat": 50.0,
    "long": 30.994223392085512,
    "nlat": 50.0,
    "nlong": 30.994223392085512
  },
  {
    "id": "202062",
    "coname": "Healthcare Heroes Way",
    "reason": "This co-naming honors the thousands of dedicated medical and nursing professionals, EMT’s, social workers, administrators, custodial and food service staff, volunteers and others vital to the continuity of care during the COVID-19 pandemic, especially those at New York Presbyterian/Columbia University Irving Medical Center.",
    "year": 2020,
    "group": 3,
    "location": "West 168th Street,Manhattan,NY",
    "lat": 45.51210017165495,
    "long": 29.15997765277013,
    "nlat": 45.51210017165495,
    "nlong": 29.15997765277013
  },
  {
    "id": "202063",
    "coname": "Hon. Vito J. Titone Way",
    "reason": "Hon. Vito J. Titone served as an Associate Judge of the New York Court of Appeals from 1985 to 1998. He taught law at Staten Island College and also St. John’s. He ran for the State Senate twice unsuccessfully but was elected to the State Supreme Court on Staten Island in 1969. Governor Hugh L. Carey named him to the Appellate Division in 1975. Staten Island Legal Services holds an annual Hon. Vito J. Titone Awards Luncheon celebrating individuals and programs that improve the quality of life for all Staten Island residents.",
    "year": 2020,
    "group": 2,
    "location": "Hyatt Place and Central Avenue,Staten Island,NY",
    "lat": 31.418089069729348,
    "long": 24.035779391391273,
    "nlat": 31.418089069729348,
    "nlong": 24.035779391391273
  },
  {
    "id": "202064",
    "coname": "Coach John Tobin Corner",
    "reason": "John Tobin was an athlete, coach, and administrator, who was also considered to be one of the founders of modern interscholastic track on Staten Island. He was a Staten Island Sports Hall of Famer, Advance Service Award recipient, founding president of Board of Trustees of New World Prep Charter School. He was a high school principal, administrative superintendent, assistant to three Chancellors of the former New York City Board of Education and vice president of the Siemens Foundation. He coached cross country, track and field at St. Peter’s, Port Richmond and Tottenville where he led his teams to many championships. His Tottenville team of 1982 holds the record for scoring the most points in New York City PSAL outdoor track and field championships with over 240 points. He was active with Staten Island Track, Running and Community, a member of the Staten Island Catholic Regional strategic planning committee, a member of the Ancient Order of Hibernians and a member of the Board of Advisors for the Gateway to Higher Education Program at CUNY’s City College.",
    "year": 2020,
    "group": 2,
    "location": "Oakland Avenue and Nutly Place,Staten Island,NY",
    "lat": 13.045631456695173,
    "long": 11.94986128278961,
    "nlat": 13.045631456695173,
    "nlong": 11.94986128278961
  },
  {
    "id": "202065",
    "coname": "Nurse Patricia Mary Farrington Way",
    "reason": "Patricia Mary Farrington was the founder and executive director of Pax Christi Hospice who offered comfort and compassion to patients facing their last days of life. She attended St. Joseph’s of Yorkville Elementary School and St. Jean Baptist High School before going on to attend the former St. Vincent’s Nursing School in West Brighton in 1969. She earned her Bachelor of Science degree in nursing at C.W. Post College in Brookville, N.Y. and held a Master of Science degree in nursing from Wagner College. In 1988, she founded and became the executive director of Pax Christi Hospice at the former St. Vincent’s Hospital. She was named a 2003 Staten Island Advance Woman of Achievement. She was on the boards of the American Cancer Society, Meals on Wheels, the Staten Island Zoo and the Alzheimer’s Association. She was honored by the Deputy Borough President, the Richmond University Medical Center and the CEO of the Sisters of Charity Healthcare System for her work.",
    "year": 2020,
    "group": 3,
    "location": "Prospect Avenue and Pendleton Place,Staten Island,NY",
    "lat": 15.035598067973105,
    "long": 13.669660856571895,
    "nlat": 15.035598067973105,
    "nlong": 13.669660856571895
  },
  {
    "id": "202066",
    "coname": "Educator & Athlete Arnold Obey Way",
    "reason": "Arnold Obey was a long-time educator and a pillar in Staten Island’s sports community starting from when he starred on Wagner College’s basketball team in the mid-1960s.  He grew up in the Bronx and helped lead DeWitt Clinton H.S. to a 38-1 record, two public school city championship games and one city title between his junior and senior years. He went on to a Hall of Fame career at Wagner, starting three years for the Seahawks and leading them to a 54-29 record during his tenure. He scored 1,018 career points on Grymes Hill. He became the boys’ varsity basketball coach at Staten Island Academy. He was a Drug Awareness Teacher during his tenure. He was an Assistant Principal at PS 16 in Tompkinsville in the mid-1980s and later became principal at PS 31 in New Brighton. He ran the night center at PS 18 in West Brighton for several years. The Brighton Kiwanis Club honored him by naming a race after him in 2017 when the club held the Arnold Obey/Armed Forces Day 5K Run. The fundraiser helped collect funds for Staten Island’s high school track & field teams. He was the recipient of numerous awards, specifically by Lifestyles for the Disabled of Staten Island for his leadership and dedication. He was also recognized by the Brown Bombers.",
    "year": 2020,
    "group": 2,
    "location": "Jersey Street and Crescent Avenue,Staten Island,NY",
    "lat": 15.487652515772442,
    "long": 14.219169221495804,
    "nlat": 15.487652515772442,
    "nlong": 14.219169221495804
  },
  {
    "id": "202067",
    "coname": "Albert “Al” Quinones Way",
    "reason": "Albert Quinones was born on Avenue of St. John in the South Bronx. He attended St. Anselm’s Grammar School, Rice High School in Harlem, and the Borough of Manhattan Community College. He was a community and cultural activist who kept Playground 52 and Latin Jazz alive in the South Bronx. The late 1970’s was a pivotal time for Alberto as he witnessed his childhood neighborhood burning and suffering neglect. In May 1980, he and three others founded 52 People for Progress, Inc. Now, 39 years later, over 250,000 hours of volunteer work, 52 People for Progress have created one of the best playgrounds in the South Bronx. Playground 52 is a living testament to Al’s vision through a philosophy of community service, leadership development, empowerment, brotherhood, and caring, while providing access to world class music, culture and the arts. His other accomplishments in the South Bronx include the opening of Rainey Garden in 1984, and in 1989, the opening of Demera/Santiago Garden on Avenue St. John and Kelly Street. In 1990, the Miranda Theater was inaugurated and gave life to the 52 Latin Jazz Concert Series. Since then, over 200 concerts have been performed there, showcasing the talents of Johnny Pacheco, Conjunto Clasico, Tito Nieves, Manny Oquendo and Libre, and nine-time Grammy-award winner, Eddie Palmieri, among others. The success of 52 People for Progress, Inc. has to do with the many partners involved in realizing the dream. It has taken the effort of city-wide agencies, the community at large and the city with the leadership, passion and tenacity of Mr. Quinones.",
    "year": 2020,
    "group": 2,
    "location": "Avenue St. John and Kelly Street,Bronx,NY",
    "lat": 41.823559709213185,
    "long": 32.478132235402214,
    "nlat": 41.823559709213185,
    "nlong": 32.478132235402214
  },
  {
    "id": "202068",
    "coname": "Heidi Hynes Way",
    "reason": "Heidi Hynes graduated from Fordham University in the Bronx. She joined the Friars of Atonement's mission in Jamaica before returning to the Bronx. She participated in her community, in her parish, on the street, in civic organizations as a leader and advocate, agitator of the status quo and problem-solver with openness and humility. She served as the executive director at the Mary Mitchell Family and Youth Center in the Crotona neighborhood of the Bronx for many years and managed to secure funding to keep the doors open and start new programs and initiatives even during the austerity of recession. As executive director, she expanded programming to including after school programs, GED, sports, dance, music and youth employment initiatives. She started a farmer’s market and community garden to provide healthy foods for the community and launched a food delivery service that distributed healthy produce to low-income households. She also started a Safe and Healthy Neighborhood Campaign to address gun violence and helped create Bronx Peace Action to oppose the Iraq War. She was a member of the Northwest Bronx Community and Clergy Coalition, the Catholic Worker Movement and the Atlantic Life Community.",
    "year": 2020,
    "group": 3,
    "location": "East 178th Street and Mapes Avenue,Bronx,NY",
    "lat": 46.29981053600307,
    "long": 34.004031475127896,
    "nlat": 46.29981053600307,
    "nlong": 34.004031475127896
  },
  {
    "id": "202069",
    "coname": "Rev. Wendell T. Foster Way",
    "reason": "The late Rev. Foster was a trailblazer well known for his community advocacy. He was empowered to run for the City Council by the indifference of the political leaders before him. After numerous attempts, he led a successful campaign empowered by the African-American community’s support. In 1978, he became the first African-American from the Bronx to hold any political office. This historic achievement marked the start of diversity among Bronx political and government representation. As the former Council Member of District 16, he responded to the “Burning of the Bronx,” by creating low-income homeownership opportunities in Highbridge and expanding parks and open space throughout his district. He served as Council Member for 24 years before passing the reign onto his daughter, Helen Diane Foster. His retirement from the City Council allowed him to dedicate his time fully to the congregation of Christ Church UCC.  As their Pastor, he offered powerful sermons that encouraged worshippers to become more engaged in their spiritual and civic duties. He would serve in this role for 40 years before he became Pastor Emeritus.",
    "year": 2020,
    "group": -1,
    "location": "Forest Avenue and 161st Street,Bronx,NY",
    "lat": 42.75200343004929,
    "long": 32.253925357553506,
    "nlat": 42.75200343004929,
    "nlong": 32.253925357553506
  },
  {
    "id": "202070",
    "coname": "Union Grove Missionary Baptist Church Way",
    "reason": "Founded on October 23, 1946, by the late Reverend Jeremiah Crawford, Union Grove Missionary Baptist Church (UGMBC) has served thousands of New Yorkers of all backgrounds, age and race. From a membership of 13 at its original location at 221 East 98th Street, UGMBC has grown into one of the most respected members of the community in the Bronx, where they currently operate at 1488 Hoe Avenue, and the City. Currently under the leadership of Reverend Frederick Crawford, the third generation of the Crawford family to pastor at UGMBC, Union Grove continues to carry out many of the community service programming created under Rev. Jeremiah Crawford. Leaned upon by community leaders and elected officials alike, UGMBC has served as a critical partner to enhance the quality of life of New Yorkers. UGMBC’s congregants have spearheaded numerous volunteer opportunities to serve the community beyond the walls of the parish. For those less fortunate, UGMBC runs food distribution programs and organizes an annual winter coat program that collects warm clothing to distribute to members of the community. During the warmer months, UGMBC organizes outdoor community events to give neighborhood youth a safe place to enjoy and play.",
    "year": 2020,
    "group": 1,
    "location": "East 172nd Street and Hoe Avenue,Bronx,NY",
    "lat": 44.637022295639866,
    "long": 33.84709857280257,
    "nlat": 44.637022295639866,
    "nlong": 33.84709857280257
  },
  {
    "id": "202071",
    "coname": "Reverend Dr. Henry Bolden Boulevard",
    "reason": "Reverend Dr. Henry Bolden was born in Bluston, South Carolina. He eventually left South Carolina to pursue God’s calling at Grace Baptist Church in Detroit, Michigan, under the pastorate of Rev. F.R. Robinson. Three years later, due to the sudden transition of Rev. Robinson, Rev. Bolden was elected to pastor. He then moved to the Bronx where he united with Greater Zion Baptist under the pastorate which he shared with Rev. Dr. Charles Britt. In the Bronx, his skills and gifts made room for him as he preached across the country for many years. In 1962, he became pastor of the New Tabernacle Baptist Church. After six years at New Tabernacle Baptist Church, he left to become the founding pastor of his lifelong church, the Greater Eternal Baptist Church, located in the South Bronx, 1969. During his time at Greater Eternal Baptist Church, he taught, licensed and ordained countless individuals into the two offices of the gospel ministry. He ordained Mount Lebanon Baptist Church’s pastor, the Reverend James Morrison, as well as the Reverend Leon Davis and the Reverend Daniel E. Kelley, Jr., among others. He was also a lifetime member of the National Baptist Convention, the Baptist Ministers Conference of Greater New York and the Baptist Ministers Evening Conference of the Bronx, of which he was a founding member. At the commemoration of his 50th year of as a pastor, the National Baptist Convention honored him for his five decades of service to God and the community.",
    "year": 2020,
    "group": 1,
    "location": "Elton Avenue and East 156th Street,Bronx,NY",
    "lat": 42.60247233285891,
    "long": 31.349811569337266,
    "nlat": 42.60247233285891,
    "nlong": 31.349811569337266
  },
  {
    "id": "202072",
    "coname": "Frederick ‘Fred The Godson’ Thomas Avenue",
    "reason": "Frederick ‘Fred The Godson’ Thomas was a DJ and rapper from the South Bronx.  He first broke into the rap scene with his 2010 mixtape, \"Armageddon,\" with features from Busta Rhymes and Waka Flocka Flame and was named a part of the best emerging hip-hop talent in XXL Magazine’s freshman class in 2011, alongside present-day rappers Kendrick Lamar, YG, Meek Mill, Lil B and the late Mac Miller. On April 23, 2020, he died of COVID-19. He also recorded with Kevin Gates, Diddy, Meek Mill, Jadakiss, The Game, Fat Joe, Raekwon, Pusha-T, French Montana, Erick Sermon, Keith Murray and many more. He appeared on the “25/8 (Remix)” from the Queen of Hip-Hop Soul, Mary J. Blige. YouTube videos in which Fred The Godson appears or performs as a featured artist have been viewed over a combined fifty million times. On datpiff, his mixtapes have been downloaded over a million times and streamed over twelve and a half million times to date. A staple on the New York hip-hop scene, he frequently appeared on radio shows on Hot 97 with Funkmaster Flex as well as DJ Enuff, The Breakfast Club on Power 105, and Sway In The Morning on Sirius Radio. His last studio effort, the mixtape “Gordo” featured New York artists, such as Dave East, Jim Jones, Joelle Ortiz, Vado and Jaquae has been streamed over three million times and downloaded over thirty thousand times to date.  His last freestyle video with Hot 97’s Funkmaster Flex has a combined 15 million views with over two hundred and fifty thousand shares on social media. His music will inspire future generations.",
    "year": 2020,
    "group": -1,
    "location": "Leggett Avenue and Kelly Street,Bronx,NY",
    "lat": 41.911277910717324,
    "long": 32.69003979855747,
    "nlat": 41.911277910717324,
    "nlong": 32.69003979855747
  },
  {
    "id": "202073",
    "coname": "Pastor Marie C. Norwood Way",
    "reason": "Pastor Marie C. Norwood joined the Gospel Temple Church of God in Christ in 1952 and served as a missionary and charity board worker for over nine years. She then served was an Evangelist in the Deliverance Evangelistic Center for over a decade. She then founded the Bronx Deliverance Center of Faith Church. She was also the Executive Director of Carroll M. Christian Day Care Center, Director of Louis Irby After School Center, Founder and Director of the Bronx Christian Business Women Association, member of the Council of Churches of New York, a member of the Bronx Shepherds Restoration Inc., Executive Board Member of the Interdenominational Women’s Conference, President of the Bronx Chapter of the IWC and served on the Community Board.",
    "year": 2020,
    "group": -1,
    "location": "Bronx Park South and Mohegan Avenue,Bronx,NY",
    "lat": 46.69422987139446,
    "long": 34.52376934387406,
    "nlat": 46.69422987139446,
    "nlong": 34.52376934387406
  },
  {
    "id": "202074",
    "coname": "Carl Reiner Lane",
    "reason": "Carl Reiner was an actor, comedian, director, screenwriter, and author whose career spanned seven decades. He was part of Sid Caesar’s legendary team and went on to create “The Dick Van Dyke Show” and direct several hit films. He was born in the Bronx and graduated from high school at 16 and worked as a machinist while studying acting. He served the United States Army during WWII and later began his acting career. In 1995, he received the Writers Guild’s Laurel Award, a lifetime achievement award for a career in TV writing. In 2000 he won the Mark Twain Prize for Humor, presented by the Kennedy Center. In 2009 he was presented with the WGA’s Valentine Davies Award, recognizing both his writing legacy and valued service to the guild, the entertainment industry and community at large. He authored several memoirs and novels, including a sequel to “Enter Laughing,” “Continue Laughing,” “My Anecdotal Life” and “I Remember Me.”",
    "year": 2020,
    "group": -1,
    "location": "Arthur Avenue and 188th Street,Bronx,NY",
    "lat": 48.09558646166228,
    "long": 34.0454560434999,
    "nlat": 48.09558646166228,
    "nlong": 34.0454560434999
  },
  {
    "id": "202075",
    "coname": "Anne Bancroft Way",
    "reason": "Anne Bancroft was born in the Bronx and became an actress, director, screenwriter and singer. Through her career she received an Academy Award, three BAFTA Awards, two Golden Globe Awards, two Tony Awards and two Primetime Emmy Awards. She is also one of 24 thespians to achieve the Triple Crown of Acting. She was well known for her acting roles in The Graduate, The Turning Point and Agnes Of God.",
    "year": 2020,
    "group": -1,
    "location": "Arthur Avenue and 188th Street,Bronx,NY",
    "lat": 48.09558646166228,
    "long": 34.0454560434999,
    "nlat": 48.09558646166228,
    "nlong": 34.0454560434999
  },
  {
    "id": "202076",
    "coname": "Joseph Migliucci Way",
    "reason": "Joseph Migliucci was the fourth generation of the venerable Migliucci family of chefs and restaurateurs who opened Mario’s Pizzeria in 1919 at 2342 Arthur Avenue in the Little Italy section of The Bronx. Joseph was the son of Mario and Rose, grandson of Giuseppe and great grandson of Scolastica whom collectively guided Mario’s from a small pizzeria to a renowned Italian eatery patronized and beloved by multiple generations of customers. His parents urged Joseph to higher education and a professional career. While studying engineering in college he decided on a different course and left to join the family business. Joseph brought boundless energy, superior technical and mechanical skills and love for people, food and life to the restaurant. He learned all facets of the business: cooking, prepping, cleaning, repairing, purchasing, serving, hosting, marketing and finances. Trained by Mario and uncle Clemente, Joseph became both a world class chef and master pizza maker of Mario’s signature thin crust Neapolitan style pies for which it remains famous. Generations of customers fortunate enough to eat a Joseph made pie attest that no one did it better. Far beyond preparing meals, Joseph touched countless individuals though his acts of love, kindness and friendship. Employees struggling with all kinds of life’s obstacles, customers seeking comfort or advice, fellow businessmen needing assistance, friends needing help - or bail – and the ‘down and out’ fighting addiction needing guidance or a second chance, found it from Joseph. With a gentle heart, large frame and even bigger hands, he provided compassion to his fellow man so many times that the touching expressions of tribute arising from his sudden departure are far too many to list. Joseph displayed his generosity to the end. In his final days of life at the hospital as his condition deteriorated, he chose his fate and told the night nurse “…give the ventilator to somebody else who needs it…” Even in these trying times, true to his nature, he managed to touch the lives of those around him. He died of COVID-19.",
    "year": 2020,
    "group": -1,
    "location": "Arthur Avenue,Bronx,NY",
    "lat": 47.644721309835255,
    "long": 33.79110145078352,
    "nlat": 47.644721309835255,
    "nlong": 33.79110145078352
  },
  {
    "id": "202077",
    "coname": "Teitel Brothers Lane",
    "reason": "Teitel Brothers Wholesale and Retail Grocery Company is located at 2372 Arthur Avenue in Little Italy of the Bronx.  A third generation, family owned and operated business, Teitel Brothers offer the finest Italian imported, gourmet specialty items and the lowest retail and wholesale prices at market value. Jacob and Morris Teitel, brothers and Jewish Austrian immigrants, first arrived in America, through Ellis Island, in 1912.  Tailors by trade, the brothers assimilated to the area, people, customs and way of life.  In 1915, Jacob and Morris decided to start a new business together and opened Teitel Brothers Grocery Store.  Although the neighborhood was, predominantly, Italian, it was not uncommon to find merchants of Jewish descent.  In fact, Jacob learned to speak Italian before he learned to speak English. The family lived upstairs from the grocery store in a three bedroom apartment with five people. At the foot of the store’s entrance sits a mosaic tile Star of David.  Jacob had the Jewish Star installed during the Great Depression. Culture, religion and family values are at the heart of what makes Teitel Brothers still in business today. The store is run by Gilbert and his sons Jean, Michael, Eddie and Billy Fassbender, Eddie’s childhood friend. Teitel Brothers is open year round Monday-Saturday, 7:00am-5:30m, except for Jewish Holidays. The store is, always, stocked with the best olive oils, tomatoes, jarred and bulk olives, aged vinegars, beans, pastas, imported and domestic cheeses, baccala, prosciutto, soppressata, fresh and dried sausages, flours, rice, nuts, candied and dried fruits, cookies, panettones, and much more. For over 100 years, Teitel Brothers has catered to a vast and distinctive clientele, including neighborhood retail customers and wholesale grocery stores and restaurants spanning the tri-state area and beyond.",
    "year": 2020,
    "group": -1,
    "location": "Arthur Avenue and 186th Street,Bronx,NY",
    "lat": 47.84292205750589,
    "long": 33.90427698493518,
    "nlat": 47.84292205750589,
    "nlong": 33.90427698493518
  },
  {
    "id": "202078",
    "coname": "Cosenza Way",
    "reason": "Cosenza’s fish market is on a very short list of family-owned businesses that have lasted for a century. The business celebrated its 100th year in business in January 2018.",
    "year": 2020,
    "group": -1,
    "location": "86th Street,Bronx,NY",
    "lat": 36.14685182683475,
    "long": 27.556103338862197,
    "nlat": 36.14685182683475,
    "nlong": 27.556103338862197
  },
  {
    "id": "202079",
    "coname": "Madonia Way",
    "reason": "Madonia Bakery was established in the Bronx in 1918, selling traditional Italian breads and later expanding to desserts. Through its existence, the bakery has lasted through economic downturns and ownership changes. Still, the bakery draws many foodies and tourists from around the world each year.",
    "year": 2020,
    "group": -1,
    "location": "Arthur Avenue,Bronx,NY",
    "lat": 47.644721309835255,
    "long": 33.79110145078352,
    "nlat": 47.644721309835255,
    "nlong": 33.79110145078352
  },
  {
    "id": "202080",
    "coname": "Lawrence Fisk Way",
    "reason": "Lawrence S. Fisk served in the United States Navy on the U.S.S. Forrestal, from which he was honorably discharged on June 1, 1966. He became an accountant working in large firms before becoming a sole proprietor. He was very involved in community activities. He founded the local chapter of the New York State Society of Independent Accountants and was a delegate to the State and National societies. He also held several offices, as well as President of the local chapter. He was an officer and active member in the Parent-Teacher Association of every school that his children attended and even ran for the school board of District 21 because he believed that a parent of a child attending the public school should have a voice in decisions being made. As a former minor league baseball player, he enjoyed being a volunteer umpire for local neighborhood groups. He served as a member of the 70th Precinct rescue squad for many years. For thirty years, he was a member of Community Board 13, where he served as a chair and was a member of various committees, such as street closing, police, fire and public safety, education, housing and zoning and land use. For several years, he was recognized for perfect attendance at board meetings.",
    "year": 2020,
    "group": -1,
    "location": "East 2nd Street and Avenue Z,Brooklyn,NY",
    "lat": 6.941569888977478,
    "long": 26.029161784331844,
    "nlat": 6.941569888977478,
    "nlong": 26.029161784331844
  },
  {
    "id": "202081",
    "coname": "Carmela ‘Mrs. C’ Casamento Way",
    "reason": "Carmela ‘Mrs. C’ Casamento ran the Eagle Cheese Company in Gravesend, Brooklyn. She was known for her famous mozzarella cheese. She ran Eagle Cheese from 1979 until 2013. She donated food to the NYPD during the Holiday’s, donated food and clothing to the poor and donated to local charities.",
    "year": 2020,
    "group": 3,
    "location": "Avenue U and McDonald Avenue,Brooklyn,NY",
    "lat": 8.538123492224456,
    "long": 25.468257444211677,
    "nlat": 8.538123492224456,
    "nlong": 25.468257444211677
  },
  {
    "id": "202082",
    "coname": "Glenda Cohen Street",
    "reason": "Glenda Cohen was very involved in charitable community activities. In 1960, she joined Women’s American ORT (Obschestvo Remeslenovo i. Zemledelcheskovo Trouda (Society for Trades and Agricultural Labor)). She also volunteered for Cancer Care. In the early 1960s, she became a Cub Scout Den Mother for neighborhood boys. Around 1970, she began a career as a local, Howard Beach real estate agent. Over a span of forty years, her expertise earned her the title “Queen of the Condos” by her realtor peers. She was PS 232’s first school crossing guard from 1962 until 1964.",
    "year": 2020,
    "group": 3,
    "location": "153rd Avenue and 84th Street,Queens,NY",
    "lat": 19.110187051859842,
    "long": 37.66581243177849,
    "nlat": 19.110187051859842,
    "nlong": 37.66581243177849
  },
  {
    "id": "202083",
    "coname": "Msgr. John C. Tosi Way",
    "reason": "Msgr. John C. Tosi was a lifelong Queens resident. He was born in Flushing and attended St. Ann’s School and later went to Monsignor McClancy Memorial High School in Jackson Heights. He later studied at Cathedral College in Douglaston and Immaculate Conception Seminary in Huntington, LI. He was named a Monsignor in 1997 and also was a member of the Knights of the Holy Sepulchre. He served as an assistant at Our Lady of Grace, Howard Beach, 1973-87 and Resurrection-Ascension, Rego Park, 1987-91. In 1991, he was appointed executive secretary of the Diocesan Liturgical Commission, a position he held until 2005. In 1995, he assumed the additional duty of rector of St. James Cathedral in Downtown Brooklyn. In January 2005, he was named pastor of St. Luke’s, where he remained until his death.",
    "year": 2020,
    "group": 1,
    "location": "Clintonville Street and Locke Avenue,Queens,NY",
    "lat": 37.15535956228948,
    "long": 41.75966761871335,
    "nlat": 37.15535956228948,
    "nlong": 41.75966761871335
  },
  {
    "id": "202084",
    "coname": "Don McCallian Way",
    "reason": "Don McCallian was a Sunnyside civic leader and member of Community Board 2, vice president of the NYPD 108th Precinct Community Council and former president of the United Forties Civic Association.  He was also a member of numerous clubs such as the Sunnyside-Woodside Lions Club, the Kiwanis Club, the Sunnyside Chamber of Commerce and the Sunnyside Community Services. He was a long-time parishioner at St. Raphael’s Church and was a very active volunteer at the church’s food pantry.",
    "year": 2020,
    "group": 3,
    "location": "40th Street and Greenpoint Avenue,Queens,NY",
    "lat": 30.271104590651614,
    "long": 30.24318097801349,
    "nlat": 30.271104590651614,
    "nlong": 30.24318097801349
  },
  {
    "id": "202085",
    "coname": "George S. Kaufman Way",
    "reason": "George S. Kaufman took over a studio lot in Astoria that was once used by the Famous Players-Lasky and the Marx Brothers in 1982. The studio was added to the National Register of Historic Places. He renamed the lot Kaufman Astoria Studios and transformed it into a full-service, comprehensive studio, including more than 500,000 square feet of soundstages. The surrounding area was revitalized becoming the Kaufman Arts District, home to the Museum of the Moving Image. Many movies and television shows were filmed on the lot including Hair, The Wiz, Goodfellas, Sesame Street and many more. He was an active member of the Real Estate Board of New York and also served on the boards of a number of philanthropic and civil organizations, such as The Whitney Museum, the Fashion Institute of Technology, Exploring the Arts and the Museum of the Moving Image. He was the Founding Chairman of the Fashion Center BID and also a Korean War veteran.",
    "year": 2020,
    "group": -1,
    "location": "35th Avenue and 36th Street,Queens,NY",
    "lat": 32.821930983629436,
    "long": 30.304389674054494,
    "nlat": 32.821930983629436,
    "nlong": 30.304389674054494
  },
  {
    "id": "202086",
    "coname": "Luis Alvarez Way",
    "reason": "Luis Alvarez was a retired NYPD bomb squad detective who died from complications of cancer linked to 9/11 related illness. He worked with other first responders during the search and rescue operation at Ground Zero. He also worked tirelessly for an extension of the September 11th Victim Compensation Fund.",
    "year": 2020,
    "group": 0,
    "location": "50th Avenue and Vernon Boulevard,Queens,NY",
    "lat": 30.759554544619444,
    "long": 27.370988229585226,
    "nlat": 30.759554544619444,
    "nlong": 27.370988229585226
  },
  {
    "id": "202087",
    "coname": "Tarlach Mac Niallais Way",
    "reason": "Tarlach Mac Niallais was an LGBTQ activist and disability rights advocate for over three decades. He began campaigning on LGBT and Republican prisoners’ rights issues in Belfast, Ireland in the 1980’s. He later went on to participate in the protests on Fifth Avenue with the Irish Lesbian and Gay Organization in the 1990’s until recently when the Lavender and Green Alliance and other Irish LGBT groups could finally march in the St. Patrick’s Day Parade. He protested Ian Paisley’s anti-gay Free Presbyterian Church and Democratic Unionist Party and later became the formation manager of the LGBT Lavender and Green Irish group. He died of COVID-19.",
    "year": 2020,
    "group": -1,
    "location": "49th Street and 43rd Avenue,Queens,NY",
    "lat": 31.0436438076863,
    "long": 31.192362473014544,
    "nlat": 31.0436438076863,
    "nlong": 31.192362473014544
  },
  {
    "id": "202088",
    "coname": "Edward Charles “Whitey” Ford Way",
    "reason": "Whitey Ford grew up in Queens and made his major league debut pitching for the Yankees in 1950 and spent his entire career with the team. He helped the Yankees win six World Series titles and 11 American League pennants in his 16 seasons. He had a career record of 236-106, setting the Yankees’ record for victories. He was the Cy Young Award winner in 1961 and was a 10-time All-Star. His 10 World Series victories are the most for any pitcher and he pitched 33 and two-third consecutive scoreless innings in World Series play, breaking Babe Ruth’s record. He also holds the record for World Series starts with 22, innings pitched with 146 and strikeouts with 94. He was inducted into the Hall of Fame in 1974.",
    "year": 2020,
    "group": -1,
    "location": "43rd Street,Queens,NY",
    "lat": 33.40823864961807,
    "long": 31.270029816159212,
    "nlat": 33.40823864961807,
    "nlong": 31.270029816159212
  },
  {
    "id": "202089",
    "coname": "Community Leader William L. Taitt Way",
    "reason": "Introduced by Council Member Miller",
    "year": 2020,
    "group": 2,
    "location": "Vanderbilt Avenue and Roff Street,Staten Island,NY",
    "lat": 11.460284680861875,
    "long": 14.539080452011868,
    "nlat": 11.460284680861875,
    "nlong": 14.539080452011868
  },
  {
    "id": "202090",
    "coname": "Big Punisher Way",
    "reason": "Christopher Lee Rios, better known as Big Pun, was a rapper from the Bronx. His album Capital Punishment reached No. 1 on the hip-R&B charts and was the first Latino solo rapper to go platinum. In his short career, he developed a substantial fan base and became a hero to the Puerto Rican community. When he died, thousands of fans attended his wake in the Bronx and a mural about him was painted on a building in his neighborhood.",
    "year": 2020,
    "group": -1,
    "location": "Grand Concourse and West Fordham Road,Bronx,NY",
    "lat": 48.95072075909786,
    "long": 33.03863950321409,
    "nlat": 48.95072075909786,
    "nlong": 33.03863950321409
  },
  {
    "id": "202091",
    "coname": "Pfc. Luke N. Gasparre Way",
    "reason": "Luke N. Gasparre entered military service in 1944 and was deployed to France, where he served in the 87th Infantry Division. During that time he participated in securing the city of Metz, and fought in the Battle of the Bulge. For his service, he received seven medals, including the Purple Heart and the Bronze Star.  He was later awarded the French Legion of Honor as well. After the war, Gasparre returned to Astoria, where he started a family and took a job with the U.S. Postal Service. In 1964, he took a second job with the New York Mets at the recently-opened Shea Stadium and during his 55 years as an usher, witnessed two World Series victories, the legendary concert by the Beatles, and a visit from the Pope. Although he grew up a Yankees fan (and was once even quizzed on baseball and the Yankees to prove he was an American soldier), he became one of the most familiar, beloved faces at Shea Stadium and Citi Field.",
    "year": 2020,
    "group": -1,
    "location": "43rd Street and 25th Avenue,Queens,NY",
    "lat": 34.43426562955988,
    "long": 31.81471375255956,
    "nlat": 34.43426562955988,
    "nlong": 31.81471375255956
  }
]