[
  {
    "id": "20020",
    "coname": "Harriet Tubman Square",
    "location": "Frederick Douglass Boulevard and West 122nd Street, Manhattan, NY",
    "reason": "Harriet Tubman was born Harriet Ross in Dorchester County, Maryland in 1820. Her parents were from the Ashanti tribe of West Africa, and they worked as slaves on the Brodas plantation. In addition to producing lumber, Edward Brodas raised slaves to rent and sell. Life was difficult on the plantation, and Harriet was hired out as a laborer by the age of 5. Harriet did not like to work indoors, and she was routinely beaten by her masters. By her early teens, Harriet was no longer allowed to work indoors and was hired out as a field hand. She was a hard worker but considered defiant and rebellious. When she was 15 years old, Harriet tried to help a runaway slave. The overseer hit her in the head with a lead weight, which put Harriet in a coma. It took months for her to recover, and for the rest of her life, Harriet suffered from blackouts. In 1844, Harriet married a free black man named John Tubman. Harriet remained a slave, but she was able to stay in Tubman's cabin at night. Although she was married, Harriet lived in fear of being shipped to the deep South, a virtual death sentence for any slave. In 1849, her fears were realized when the owner of the Brodas plantation died and many of the slaves were scheduled to be sold. After hearing of her fate, Harriet planned to escape that very night. She knew her husband would expose her, so the only person she informed was her sister. Harriet made the 90 mile trip to the Mason-Dixon line with the help of contacts along the Underground Railroad. She had to hike through swamps and woodland. Harriet's trip was successful, and she settled in Philadelphia. She worked as a dishwasher and made plans to rescue her family. The next year, Harriet traveled back to Maryland and rescued her sister's family. She then returned to transport her brothers to the North. She went back for her husband, but he had remarried and did not want to follow her. In 1857, Harriet finally returned for her parents and settled them in Auburn, New York. By this time, Harriet was becoming quite well known and huge rewards were offered for her capture. Harriet was the master of disguise. A former master did not even recognize her when they ran into each other on the street. She was nicknamed the \"Moses of her people\" for leading them to freedom. In all, Harriet made 19 trips on the Underground Railroad and freed more than 300 slaves. With the arrival of the Civil War, Harriet became a spy for the Union army. She later worked in Washington DC as a government nurse. Although Harriet won admiration from the military, she did not receive a government pension for more than 30 years. At the end of the war, Harriet returned to her parents in Auburn. She was extremely poor and the profits of a book by Sarah Bradford entitled “Scenes in the Life of Harriet Tubman”, published in 1869 were a great financial help. In 1870, Harriet married Nelson Davis, who she had met at a South Carolina army base. They were happily married for 18 years until Davis' death. In 1896, Harriet purchased land to build a home for sick and needy blacks. However, she was unable to raise enough money to build the house and ultimately gave the land to the African Methodist Episcopal Zion Church. The church completed the home in 1908, and Harriet moved there several years later. She spent her last years in the home telling stories of her life to visitors. On March 10, 1913, Harriet died of pneumonia. She was 93 years old. Harriet Tubman was not afraid to fight for the rights of African-Americans. Her story is one of dedication and inspiration. During her lifetime Harriet was honored by many people. In 1897, her bravery even inspired Queen Victoria to award her a silver medal. ",
    "lat": 40.8082553,
    "long": -73.95256669999999,
    "year": "2002",
    "group": 5
  },
  {
    "id": "20021",
    "coname": "Harriet Tubman Avenue",
    "location": "St. Nicholas Avenue and West 141st Street, Manhattan, NY",
    "reason": "Harriet Tubman was born Harriet Ross in Dorchester County, Maryland in 1820. Her parents were from the Ashanti tribe of West Africa, and they worked as slaves on the Brodas plantation. In addition to producing lumber, Edward Brodas raised slaves to rent and sell. Life was difficult on the plantation, and Harriet was hired out as a laborer by the age of 5. Harriet did not like to work indoors, and she was routinely beaten by her masters. By her early teens, Harriet was no longer allowed to work indoors and was hired out as a field hand. She was a hard worker but considered defiant and rebellious. When she was 15 years old, Harriet tried to help a runaway slave. The overseer hit her in the head with a lead weight, which put Harriet in a coma. It took months for her to recover, and for the rest of her life, Harriet suffered from blackouts. In 1844, Harriet married a free black man named John Tubman. Harriet remained a slave, but she was able to stay in Tubman's cabin at night. Although she was married, Harriet lived in fear of being shipped to the deep South, a virtual death sentence for any slave. In 1849, her fears were realized when the owner of the Brodas plantation died and many of the slaves were scheduled to be sold. After hearing of her fate, Harriet planned to escape that very night. She knew her husband would expose her, so the only person she informed was her sister. Harriet made the 90 mile trip to the Mason-Dixon line with the help of contacts along the Underground Railroad. She had to hike through swamps and woodland. Harriet's trip was successful, and she settled in Philadelphia. She worked as a dishwasher and made plans to rescue her family. The next year, Harriet traveled back to Maryland and rescued her sister's family. She then returned to transport her brothers to the North. She went back for her husband, but he had remarried and did not want to follow her. In 1857, Harriet finally returned for her parents and settled them in Auburn, New York. By this time, Harriet was becoming quite well known and huge rewards were offered for her capture. Harriet was the master of disguise. A former master did not even recognize her when they ran into each other on the street. She was nicknamed the \"Moses of her people\" for leading them to freedom. In all, Harriet made 19 trips on the Underground Railroad and freed more than 300 slaves. With the arrival of the Civil War, Harriet became a spy for the Union army. She later worked in Washington DC as a government nurse. Although Harriet won admiration from the military, she did not receive a government pension for more than 30 years. At the end of the war, Harriet returned to her parents in Auburn. She was extremely poor and the profits of a book by Sarah Bradford entitled “Scenes in the Life of Harriet Tubman”, published in 1869 were a great financial help. In 1870, Harriet married Nelson Davis, who she had met at a South Carolina army base. They were happily married for 18 years until Davis' death. In 1896, Harriet purchased land to build a home for sick and needy blacks. However, she was unable to raise enough money to build the house and ultimately gave the land to the African Methodist Episcopal Zion Church. The church completed the home in 1908, and Harriet moved there several years later. She spent her last years in the home telling stories of her life to visitors. On March 10, 1913, Harriet died of pneumonia. She was 93 years old. Harriet Tubman was not afraid to fight for the rights of African-Americans. Her story is one of dedication and inspiration. During her lifetime Harriet was honored by many people. In 1897, her bravery even inspired Queen Victoria to award her a silver medal. ",
    "lat": 40.8212612,
    "long": -73.9460266,
    "year": "2002",
    "group": 5
  },
  {
    "id": "20022",
    "coname": "Amadou Diallo Place",
    "location": "Wheeler Avenue, Bronx, NY",
    "reason": "Amadou Diallo was born on September 2, 1975 in the village of Sinoe, Liberia, West Africa. He was the first of four children born to Saikou and Kadiatou Diallo. Amadou has one sister, Laouratou, and two brothers, Ibrahima and Abdul Salaam. Because his father, Saikou, was a businessman, Amadou traveled throughout much of his childhood living in Togo, Guinea, the homeland of his parents, Bangkok and Singapore.Amadou grew up with a love of reading, music, dancing and sports. Once in the United States, he became an avid basketball fan, in particular, of Michael Jordan. In fact, Amadou was such a true Michael Jordan fan that he shifted from a Bulls fan to a Knicks fan when Jordan had decided to retire.Amadou had a passion for school and attended some of the finest schools in the world, including The French International School, London's Cambridge University, The British Consulate College in Thailand and the Asian Institute of Microsoft. It was Amadou's dream to one day enroll in school in the United States. At twenty, he decided to come to America to continue his computer education and he wanted to do it on his own. In September of 1996, he decided to come to New York to start a business with his cousin. His father, Saikou, was reluctant at first but later relented after he was reassured by relatives that Amadou would be taken care of. Upon his arrival in New York, he first worked as a delivery man but later became a street peddler selling gloves, socks and video tapes in Manhattan on 14th Street. He worked six days a week, 12 hours a day. However, his dream to pursue his education in America continued. A young man from Senegal who met Amadou in New York fondly recalls the times he and Amadou would sit talking for hours about school. After class, he'd stop by Amadou's stand where Amadou would always have a cold bottle of apple juice waiting for him. He'd take his usual seat while Amadou would run down his usual questions; \"So tell me, how was school in America today? How do you feel about being in the classroom?\" He'd get so excited just listening and, at the end of every conversation, he'd say, \"You know, I'm really going to go to school here someday.\"A spiritual person, when Amadou was about 18 years old, he began to focus and collect books on his religion, studying the Koran and praying five times a day in the Muslim tradition. When the family came to collect Amadou's belongings after his death, they found solace in what they discovered. Among the many things they found were writings where Amadou had begun to research the prophets. He had written the names of all the prophets along with the dates of their birth. He had highlighted passages in the Koran that spoke about the dialogues between Christians and Muslims. Amadou was on a spiritual journey.Amadou was killed on February 4, 1999, after midnight, by four New York City police officers from the Street Crime Unit. Amadou had come home from work to his apartment at 1157 Wheeler Avenue in the Soundview Section of the Bronx and decided to go back out to get something to eat. Upon his return, he encountered the police officers who ultimately fired a fuselage of 41 shots, 19 of which riddled his body. Amadou died in the vestibule of his apartment building.",
    "lat": 40.826967,
    "long": -73.87974700000001,
    "year": "2002",
    "group": 5
  },
  {
    "id": "20023",
    "coname": "Steve Mercado Stickball Boulevard",
    "location": "Stickball Boulevard, Bronx, NY",
    "reason": "Steve Mercado was born on June 1, 1963 and grew up playing stickball on the streets of The Bronx. He was widely known for his efforts to preserve and promote stickball as a healthy and accessible sport. From a young player on Bronx streets, he became a nationally recognized leader and organizer, establishing leagues in the Bronx, across the City and across the Country, including Miami, San Diego and Puerto Rico. Steve Mercado was a very civically active member of Community Board 9 who volunteered a great deal of his time to The Bronx YMCA as a coach. He also served as the President of the Emperors Stickball League which plays every weekend from March until August on Stickball Boulevard.Steve Mercado became a New York City Firefighter on October 21, 1990 and received a unit citation on October 24, 1996. His commitment to the New York City Fire Department (FDNY) was every bit as intense as his commitment to stickball. Assigned to Engine Company 40 on Manhattan’s West Side, Steve was called to the World Trade Center in answer to the September 11, 2001 terrorist attack. He died on that day along with 342 other members of FDNY. Steve Mercado was thirty-eight years old. He left a widow, Jovianna, and two sons, Sklyer, 6, and Austin, 2.",
    "lat": 40.8200322,
    "long": -73.856699,
    "year": "2002",
    "group": 5
  },
  {
    "id": "20024",
    "coname": "Bobby Bello Field",
    "location": "75th Street and Shore Road, Brooklyn, NY",
    "reason": "Bobby Bello was born and raised in Bay Ridge. The youngest of nine children, he was born on June 4, 1927 to Tony and Netti Bello. He attended P.S. 105, Pershing Junior High School and graduated from Fort Hamilton High School in 1945. After high school he served in the Air Force for two years. Bobby was a member of the Local #40 Iron Works union for the next forty years. He worked on various projects in the New York City area, among them the Twin Towers and the Verrazano Narrows Bridge. This brought him a sense of great pride and joy, especially when connecting his beloved Bay Ridge with his new home Staten Island.In 1952 at a Father Strype fund raising dance Bob met and later fell in love with Margaret Moakler. Two years later on October 16, 1954 in the upper church of Our Lady of Perpetual Help, Bob and Margie were married by her brother Father Michael Moakler. Together they had five children, Bonnie, Robert, Phillip, Stephen, and Toniann.In 1973, Bob was laid up suffering from a back injury. At that time he encouraged Maggie to go to college. Four years later she graduated with honors from Richmond College. Later, again with his encouragement, she would also acquire her Masters Degree from Saint John’s University. In the year 2000 she retired from Saint Patrick’s School after teaching the second grade for twenty years.Bob’s chosen sport was football. As a little boy on 7th avenue and 59th street, his dream was to be a good football player. He’d often reminiscence about his days at the “Dust Bowl” field. How he took old newspapers, rolled them together tightly, wrapped them with string or rubber bands and call that his football. He would take his “ball” to the Dust Bowl, throw the ball down the field, run back and catch it. Bob would be there for hours learning to “run and catch”. Since Fort Hamilton did not have a football team, Bob played with the local sand lot teams, such as The Hawks, The Imps, and the Bay Ridge Celtics where he was both a player and a coach. One year he played semi-pro football for the Indians. The last game he played was on his endeared Shore Road Football field, he was 38 years old.Bob’s coaching abilities were becoming well known in Bay Ridge. In 1955, Bob, together with the youth officer Ray Rupelli, of the 64th precinct located then on the corner of 86th street and 5th avenue, began the “Police Athletic League” (P.A.L.), which till this day still flourishes under the title of 68th precinct Youth Council. At the time he was also coaching in the Pop Warner Football League. The games were played on their home field at Shore Road and 79th street. Ironically enough, this field at 79th street and Shore Road is now the home field of the Xaverian Clippers Football team which is coached by Dom Laurendi, who was one of Bob’s early ball players. He coached and nurtured thousands of young boys through out those years, and one outstanding young man was the New York Jets John Dockery. Over the years John never forgot his “coach,” Bobby Bello. Later, Bob opened a sporting goods store on 77th street and 5th avenue and many of his “kids”, now mature young men, would stop by to recall the good times they had with the P.A.L. John Dockery was one of these “kids.” Bob was proud to know that his Bay Ridge local boy had won an athletic scholarship to Harvard University. Dockery also won a Superbowl Ring with the Pittsburgh Steelers. Shortly afterwards, Joe Namath and Dockery joined forces and began the “Joe Namath and John Dockery Football Camp”. Bob was one of the first coaches to join the camp. Further more, he was a part of that camp up to the time of his death, some 27 years in all.Bob’s world of coaching took him down many paths and to many fields as he coached New York Police Department Football teams, numerous high school teams such as, Tilden, Monsignor Farrell, and Tottenville High School. In 1992 the New York Finest were the champs in the Policeman’s Benevolent Association Fun City Bowl in Florida, and in 1997, the Tottenville “pirates” were the New York City P.S.A.L. Champions. On both Occasions he received a ring in his name, a dream come true. He was very proud of these rings and “His” boys. With all the devotion and hard work that he gave to his coaching, one would think that coaching was his first love. But this was not the case.Bobby Bello’s first and heartfelt love belonged to his family. His wife Margie, their five children, eight grandchildren, his brothers and sisters, and their children. He felt proud to have coached his sons Robert, Phillip, and Stephen, his nephews Michael, Robert, Joseph, and later his son Joseph the III, and then his grandsons Robert and Sean. This for Bob was a joyful accomplishment. Bobby Bello’s football days started alone on the “Dust Bowl” field, but his accomplishments, his achievements, and his adulation began on the fields of Shore Road. Bobby Bello died on February 16, 1999.Bobby was not only a great football player and coach, but he was an exceptional, outstanding and magnificent man. A man whose name will give honor and due respect to this field.",
    "lat": 40.6336276,
    "long": -74.0369505,
    "year": "2002",
    "group": 5
  },
  {
    "id": "20025",
    "coname": "Jonathan Nigro Place",
    "location": "Avenue P and West 2nd Street, Brooklyn, NY",
    "reason": "Jonathan Nigro was born on September 8, 1973 at 1677 West 2nd Street in Brooklyn, His parents and grandparents before him had lived at 1677 West 2nd Street, since 1938.Jonathan attended P.S. 177 on West 1st Street and Avenue P, and Mark Twain Junior High School, Lafayette High Sschool and Saint Francis College, attaining his Bachelors of Business Administration. He was in the process of obtaining his Masters in Business Administration when he was stricken with Leukemia, halting his aspirations, his dreams and his life.Jonathan’s days were spent playing on the sidewalks and Streets in and around West 2nd Street. He rode his bicycle, skated, ran, jumped and played ball. He charmed the neighbors from his birth, his smile and warm hello filled their days. Jonathan was also a lifeguard and an all around athlete. During his 8th grade year at Mark Twain JHS, while on a school trip, he saved the life of another swimmer at the Olympic Dude Ranch. He received the Borough President’s Golden Citizen’s Award and won awards at his Graduation from Mark Twain for his Humanity and Citizenship. At Lafayette High School, he was on the Football and Baseball teams. He had many friends, both students and teachers alike.During his years at Saint Francis College, he learned how to ski and became an avid skier. He graduated with a Bachelors of Business Administration, which helped him as an Asset Trader at Fidelity.Jonathan Nigro died of Leukemia on May 3, 2000. He left a legacy of love, loyalty, friendship and good citizenship. He was a loving and loyal son, brother, grandson, nephew, and friend to the young and old. Children adored him, with is playful grin and his daring personality. Almost 4,000 people attended funeral services honoring Jonathan, which was an attestation to the legacy of love and loyalty that he left behind. He will be missed forever.Jonathan was survived by his beloved fiancé, Melissa Murphy, sister, Jennifer and her husband Joseph Cianciotta, parents, Ron and Ella, grandmother Jenny, and his Aunt Faye, Uncle Tony, and cousin Jaclyn, of West 2nd Street, as well, and many other family members and friends. Because of Jonathan’s sickness and the love he generated, almost 1,000 people were registered as Bone Marrow Donors and are presently on the list for Bone Marrow Transplantation. Monies were raised for Leukemia and a Leukemia Fund is in the process of being established at North Shore Hospital, benefiting the Bone Marrow Transplant Room. A scholarship was established in Jonathan’s name at Saint Francis College, which will address Bio-Medical Students entering research in the Medical Research Field.",
    "lat": 40.6085009,
    "long": -73.9759425,
    "year": "2002",
    "group": 5
  },
  {
    "id": "20026",
    "coname": "Captain Patrick J. Brown Walk",
    "location": "Captain Patrick J. Brown Walk, Manhattan, NY",
    "reason": "Captain Patrick J. Brown, age 48, of Ladder Company 3, was a twenty-three year veteran of the New York City Fire Department (FDNY). He was one of the most decorated members of FDNY, receiving 20 citations for valor during his career. As a firefighter, Captain Brown served in Ladder Company 26 and Rescue Company 1 in Manhattan, and Rescue Company 2 in Brooklyn. After being promoted to Lieutenant in 1987, he served with Battalion 16 and Ladder Company 28 in The Bronx as well as the Special Operations Command. He was promoted to Captain in 1993 and served with Division 1 in Manhattan and Engine Company 69 in The Bronx, before transferring to Ladder 3 in 2000.Captain Brown, a resident of Manhattan and also a highly decorated Marine Corps sergeant who served his country in Viet Nam, was called along with his company to the World Trade Center on the morning of September 11, 2001. When the towers collapsed he was killed trying to rescue people who were trapped inside. Captain Brown was a highly respected and very modest man. He didn’t talk about things often, but you knew from he demeanor that he had seen and had done a lot. He was survived by a brother Michael and a sister Caroline.",
    "lat": 40.72870450000001,
    "long": -73.97145669999999,
    "year": "2002",
    "group": 5
  },
  {
    "id": "20027",
    "coname": "Father Michael J. McGivney Way",
    "location": "86th Street and 14th Avenue, Brooklyn, NY",
    "reason": "Father Michael McGivney was born in Waterbury on August 12, 1852. The oldest of thirteen children of Irish immigrants Patrick and Mary (Lynch) McGivney, Michael learned early about sorrow, the harsh grip of poverty, love and faith, and family fortitude. Six of his siblings died in infancy or childhood. At the age of 13 he left school to work in a spoon-making department of a brass factory to provide a few more dollars for family survival. When he reached the age of sixteen, he traveled to Quebec, Canada with his Waterbury pastor and registered at the French-run College of St. Hyacinthe. With the priesthood clearly in mind, he worked hard on subjects that would prepare him to apply for seminary admission. He studied two additional years at Our Lady of Angels Seminary in Niagra Falls, New York. He then moved to Montreal to attend seminary classes at the Jesuit-run St. Mary's College. When his father died in June of 1873, he went home for the funeral concerned for his family's welfare, lingering awhile in Waterbury. Then, at the request of the bishop of Hartford, he entered St. Mary's Seminary in Baltimore, Maryland. On December 22, 1877, he was ordained in Baltimore's historic Cathedral of the Assumption by Archbishop (later Cardinal) James Gibbons. A few days later, he said his first Mass at Immaculate Conception Church in Waterbury. Father McGivney began his priestly ministry on Christmas Day in 1877 as curate at St. Mary's Church in New Haven. It was the city's first parish. A new stone church had been built, after the old one burned, on one of New Haven's finest residential Streets, Hillhouse Avenue. There was neighborhood objection which even the New York Times noted in 1879, under the headline: \"How An Aristocratic Avenue Was Blemished By A Roman Church Edifice.\" So Father McGivney's priestly ministry in New Haven began with tension and defensiveness among the working-class Irish families he served. Father McGivney worked closely with the young people of St. Mary's parish, holding catechism classes and organizing a total abstinence society to fight alcoholism. In 1881 he began to explore with various laymen the idea of a Catholic, fraternal benefit society. In an era when parish clubs and fraternal societies had wide popular appeal, the young priest felt there should be some way to strengthen religious faith and at the same time provide for the financial needs of families overwhelmed by illness or death of the breadwinner. He discussed this concept with Bishop Lawrence McMahon of Hartford, and received his approval. He traveled to Boston to talk with the Massachusetts Catholic Order of Foresters, and traveled to Brooklyn to consult the Catholic Benevolent Legion. He met with other priests of the diocese. Wherever he could, he sought information that would help the Catholic laymen to organize themselves into a benefit society. William Geary, one of the Order's charter members, said that at the first council meeting in 1882, he was \"acclaimed as founder by 24 men with hearts full of joy and thanksgiving, recognizing that without his optimism, his will to succeed, his counsel and advice they would have failed.\" Father McGivney had suggested Sons of Columbus as a name for the Order. This would bind Catholicism and Americanism together through the faith and bold vision of the New World's discoverer. The word \"knights\" replaced \"sons\" because key members of the organizing group who were Irish-born Civil War veterans felt it would help to apply a noble ritual in support of the emerging cause of Catholic civil liberty. In the first public reference to the Order on February 8, 1882, the New Haven Morning Journal and Courier said the Knights of Columbus' initial meeting had been held the night before. On March 29, the Connecticut legislature granted a charter to the Knights of Columbus, formally establishing it as a legal corporation. The Order's principles in 1882 were \"Unity\" and \"Charity.\" The concepts of \"Fraternity\" and \"Patriotism\" were added later. Each of these ideals played a major role in ceremonials from the beginning. The Columbus-linked themes, says historian Christopher J. Kauffman, \"reverberated with pride in the American promise of liberty, equality and opportunity.\" In April of 1882, Father McGivney, with the permission of Bishop McMahon, wrote to all the pastors of the Diocese of Hartford. The Order's primary objective, he wrote, was to dissuade Catholics from joining secret societies by providing them better advantages at times of death or sickness. He urged each pastor to exert influence \"in the formation of a Council in your parish.\" Father McGivney personally installed the first officers of San Salvador Council No. 1 in New Haven, in May of 1882. By May 1883, Council No. 2 had been instituted in Meriden, Connecticut and Bishop McMahon, so impressed with the organization, became a member of Council No. 11 in 1884, and served it as council chaplain. By the end of 1885, there were 31 councils in Connecticut. Father McGivney's dedication to the Order was evidenced in trips he made to all parts of Connecticut and in handwritten correspondence—little of which survives—about K of C business. At St. Mary's, despite all this, he remained the energetic curate with constant concern for every parishioner's problems. Then in November of 1884, he was named pastor of St. Thomas Church in Thomaston, Connecticut, a factory town 10 miles from his hometown. It was a factory parish, heavily in debt, serving working-class parishioners with few resources beyond their faith. With prayerful acceptance, Father McGivney put his seven years at St. Mary's behind him. His New Haven parishioners, in a testimonial resolution elaborately superimposed on the drawing of a chalice and host, declared that despite burdens and afflictions, his courtesy, his kindness and the purity of his life had \"secured the love and confidence of the people of St. Mary's, which will follow him in every future field of labor.\" In six subsequent years at St. Thomas, he wrestled with the church debt and built the same close ties of devotion and charitable concern he had developed in New Haven. He continued, as well, to serve as supreme chaplain, personally involved in helping the Order to extend its membership into Rhode Island. Later, from 1901 to 1939, his younger brothers, Msgrs. Patrick and John J. McGivney, served the Order as supreme chaplains. Never robust in health, Father McGivney was suddenly stricken with a serious case of pneumonia in January 1890. It hung on. Various treatments for consumptive illness were tried, but his decline persisted. The young priest lost physical strength just as the Order he founded was moving toward new vitality. On August 14, 1890, Father Michael J. McGivney died at the age of 38. In his 13 brief, busy years as a priest, Father McGivney's piety and compassion had won the love of those he served as curate and pastor. His Christian inspiration, leadership and administrative drive had brought him the loyalty and affection of thousands who knew him as the founder of the Knights of Columbus",
    "lat": 40.612735,
    "long": -74.011712,
    "year": "2002",
    "group": 5
  },
  {
    "id": "20028",
    "coname": "Bill Thomas Sr. Lane",
    "location": "14th Street and Prospect Park West, Brooklyn, NY",
    "reason": "William D. Thomas Senior was born on June 8, 1933, on Gold Street in Brooklyn, New York, to David and Helen Thomas. As a young man his family, which consisted of his parents, a sister, Ester and brothers David and Kenneth, moved to 19th Street, between Fifth and Sixth Avenues, in Brooklyn. “Bill” attended Public School 10 graduating in1945. At age 19 he married Angela LaDuca Thomas, on September 26, 1952. The marriage produced two sons, David and William Junior.Bill Thomas’ first job was with Caputo Bakeries on Court Street. He later worked as a route man, salesman and driver for Drakes Cakes Company, Inc. In 1962 Bill and Angela purchased a brownstone home at 459 14th Street. Ten years later, in 1972, he founded the 14th Street Block Association and remained its president for the rest of his life. During this period he became a very active, and a very hands-on, community leader and activist. He was elected to be a Judicial Delegate for the Kings County Democratic Party and, in 1985, was asked to become Chairman of the Board of the 17th Street Block Association, a tenants advocate organization which he helped to found. In February 1990, Mr. Thomas was a founding member of the United Coalition to Save and Preserve the 14th Infantry Regiment Armory Conservancy Inc., an organization that he chaired from 1996 to 1998. Bill also served as Campaign Treasurer for the Honorable Bernard Fuchs’ election to the Supreme Court of the State of New York in 1986 and 1992.In 1996, Bill Thomas, along with his good friend and colleague Alfred P. Raffo and others, fought side by side for the return of “Iron Mike”, a WWI Statue of a 14th Infantry Regiment “Doughboy”, to its traditional pedestal in front of the Armory’s main entrance. Later in 1996, he worked with Department of Transportation (DOT) officers to have a traffic light installed, at the corner of 14th Street and Eighth Avenue to protect local residents. He also worked with DOT, up until his death, to bring about extensive structural repairs for 14th Street. Bill, and others, also worked with the Department of Parks and Recreation to create a parking lot in Prospect Park. The lot would benefit patrons of the Circle Restaurant and the Pavilion Theatre, with parking fees going to local non-profit community organizations. And from 1984, Bill Thomas was  member of the Board of Directors of the Seventh Avenue/Windsor Place Community Association and of Foodcare, Inc. Foodcare, Inc. is a not-for-profit entity, made up of 68 community organizations, who operate soup kitchens, food pantries and other  charitable activities 365 days a year.William D. Thomas, Sr. died on February 16, 2002. He was survived by his wife, Angela, his sister, Ester; and two sons, William Jr. and David.",
    "lat": 40.66161520000001,
    "long": -73.9793732,
    "year": "2002",
    "group": 5
  },
  {
    "id": "20029",
    "coname": "Frank LoCicero Bellerose – Hillside Civic Garden",
    "location": "Frank P. Locicero Triangle, Queens, NY",
    "reason": "Frank P. LoCicero was born on February 22nd, 1998 in Manhattan. He graduated from Harran High School where he studied art. He became, at age 17, the youngest person to have a sculpture exhibited in the Metropolitan Museum of Art. After graduating high school he attended a commercial art school and soon began to work as an artist at Norcross Greeting Cards. During World War II, Frank enlisted in the Army where he spent the next five years of his life in Hawaii drawing aerial maps.After leaving the army, he went back to work for Norcross and soon met his wife to be, Marie. They were married on November 9, 1946. Frank and Marie had two sons, Ronnie and Ricky. In 1950, they purchased a home in Bellerose, New York Soon after arriving, Frank became active at St. Gregory the Great Church, joining the Holy Name Society and Nocturnal Adoration Association. He also became a member of the Bellerose Hillside Civic Association. He enjoyed his civic activities and was later voted its president. During his tenure as president, Frank led successful campaigns against undesirable projects that were proposed to be situated at the Creedmore Psychiatric Center such as a prison and a sanitation garage. He also was responsible for editing and distributing a monthly newsletter. In addition to all his civic activities, he became the grandfather of 5 and great-grandfather of 4.Frank passed away on November 5, 1997. After his death the officers and members of the Bellerose - Hillside Civic Association arranged with New York City’s Project GreenStreets to have a triangle located at Hillside Avenue and the Cross Island Parkway replanted. A permanent memorial stone was installed there as a lasting tribute to a man who gave much to help preserve the neighborhood he loved. The Street sign will be located at this triangle.",
    "lat": 40.7339548,
    "long": -73.7234646,
    "year": "2002",
    "group": 5
  },
  {
    "id": "200210",
    "coname": "Osvaldo Vega Place",
    "location": "East 106th Street and Third Avenue, Manhattan, NY",
    "reason": "Osvaldo Vega was born in Lajas, Puerto Rico on April 29, 1921. He was the eldest of three sons born to Mrs. Lila Rodriguez de Vega and Mr. Emiliano Vega.In 1937, at age 16, Osvaldo arrived in New York, where he continued his education. He graduated from Benjamin Franklin High School, and attended New York University and Georgetown School of Social Science. After he finished his studies, he enlisted in the United States Navy, where he was in the same company as future President John. F. Kennedy. While he was in the service, Osvaldo was chosen by his superior officers to be a member of a Senatorial committee that was sent to Germany to investigate the conditions of Hispanic soldiers.Upon his discharge from the Navy, he met with a group of distinguished athletes concerned about the future of our children. They founded the Puerto Rican Hispanic Sports Council (PRHSC). Mr. Osvaldo Vega was named president – a post he held for 30 years until his death. During those 30 years, Osvaldo Vega was dedicated to working for a better future for our children and the community in general.He organized many programs and successfully celebrated them to the benefit of our children and our community. He also organized sports meets in all fields during the months of July and August, in which children of all national backgrounds participated. It also included the Puerto Rican marathon, held every year, in which up to three thousand runners participate, making it New York’s second largest marathon race.Mr. Vega was also involved in baseball clinics that took place every year at City College, under the aegis of PRHSC. Major League scouts participated in these clinics teaching children good baseball technique. He also coordinated baseball umpires training courses every year at City College, lasting six weeks. These graduating umpires would then serve the little leagues. In addition, he was the inspiration for Latin American Day at Yankee and Shea Stadiums, where every year Latin players in the Major Leagues received deserving recognition.During his lifetime Mr. Vega received awards in recognition of his work from the Institute of Puerto Rican Culture, Federacion Liqa Hispana, Federacion International De Deportes Aficianado, the Toleto Vargas League, the Canalles League, the Roberto Clemente Hall of fame, the United States Little League Federation, the Puertorrigueno /Puerto Rican Parade, Fiesta Folklouca, and Mayor Abraham Beame. Osvaldo Vega died in December 1983.",
    "lat": 40.7915312,
    "long": -73.9447036,
    "year": "2002",
    "group": 5
  },
  {
    "id": "200211",
    "coname": "Robert Rodriguez Place",
    "location": "East 120th Stree, Manhattan, NY",
    "reason": "Robert Rodriguez was born in East Harlem on August 1, 1951. He was the third of seven children born to Juan and Carmen Rodriguez. Robert attended Public School 72 and Junior High School 13, in East Harlem, before graduating from Alfred E. Smith High School in 1969. After High School, Robert attended Nyack Missionary College. Soon after college, he met and fell in love with Edith Delerme and they were married on June 9, 1974. The marriage produced two sons, Robert Jay, and Jonathan Ray, and one daughter, Tina Rasheen.During the early  70’s Robert served as Manpower Director for the East Harlem Community Corporation. In this capacity he was able to find employment for hundreds of workers. Because he believed that access to jobs determines the quality of our lives, he drew great satisfaction from his role in employee placement. Early on, Robert Rodriguez became very active in the civic life of his community. He was elected to the Board of Community School District #4, in 1973 and again in 1982, serving for a time as its president. During this period he was directly responsible for the initiation of many after school programs for young people at junior high school 45. He was a member of the Advisory Board of Metropolitan Hospital from 1973 until 1977. Robert also served as Chairman of the Community Mental Health Center (1973-1977), as Democratic District Leader of the 68th Assembly District (1973-1977), as a member of Community Planning Board #11 in East Harlem (1973-1976), as a Board Member of the Edwin Gould Services for Children Foundation (1977-1982), as a Board Member of the East Harlem Boy Scouts of America (1977-1986), and as a member of the Hunts Point Lions Club (1976-1883).In 1976, Robert Rodriguez was elected to represent the 8th Councilmanic District of the City of New York. His constituency included the South Bronx, portions of the Upper East Side and East Harlem. At the time of his election, Robert was the youngest person ever elected to the Council. He was elected a second time in 1980 and served until 1982 before leaving to serve as Director of Labor Relations at the New York City Fire Department. In 1978, while still at the Council, Robert founded the East Harlem Multiservice Center (EHMC) on 120th Street between First Avenue and Pleasant Avenue. He was especially proud of this achievement and EHMC remains a cornerstore of the East Harlem community helping thousands of families each year.Robert Rodriguez left the Fire Department in 1984 and was Vice-President of Marketing and Development for Delgado-Huegel Architects for two years before becoming chief of staff for Assemblyman Jose Serrano. He later served as Vice President for Operations and Public Affairs for SCS Business Technical Institute and was a Special Projects Director for the New York State Hispanic Housing and Economic Development Task Force. At the time of his death, Robert Rodriguez was over-seeing affirmative-action and diversity programs at the New York State Department of Civil Service. Robert Died on July 17, 1994. He was survived by his wife Edith; two sons, Robert Jay and Jonathan Ray; one daughter, Tina Rasheen; his parents, Carmen and Juan; five brothers Raul, Rene, Richard, and Juan Jr.; and one sister, Norma.",
    "lat": 40.8005138,
    "long": -73.9381432,
    "year": "2002",
    "group": 5
  },
  {
    "id": "200212",
    "coname": "Firefighter Christopher J. Pickford Street",
    "location": "122nd Street, Queens, NY",
    "reason": "Christopher J. Pickford was born on Father’s Day, June 15, 1969, in, what was then, Booth Memorial Hospital in Flushing. Hew grew up in Kew Gardens in the home in which his parents, Thomas and Linda still reside. He attended Public School 90, Junior High School 226, Forest Hills High School and Queens Borough Community College.Beginning with his early years in grammar school, Chris was awarded honors in creative writing and music. These gifts remained his passion into his adult life. He was an accomplished guitarist and song writer and used these talents in several bands throughout the years. The first band was “Riboflavin and the Vitamin D’s” – a band formed in high school mostly just for fun, but soon gained a cult following throughout Queens for its witty lyrics and ridiculous stage presence. As he matured, his music did as well. He formed the band “10 Degree Lean”, appearing regularly in Manhattan’s East Village. He continued to write poetry and screen plays and began laying down tracks for an  acoustical guitar Cd.Chris worked for the Queens District Attorneys as a paralegal before being hired as a New York City Firefighter in January, 2000. He was assigned to Ladder Company 136 in Queens and was  on a rotation to Engine Company 201 in Brooklyn. On September 11, 2001 Engine Company 201 was called to the World Trade Center in response to the terrorists attacks. Chris was killed along with 342 other firefighters as he helped to evacuate people who were trapped in the towers. ",
    "lat": 40.6775064,
    "long": -73.8168692,
    "year": "2002",
    "group": 5
  },
  {
    "id": "200213",
    "coname": "Martin J. Egan. Jr. Corner",
    "location": "Freeborn Street and Lincoln Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5720165,
    "long": -74.0949016,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200214",
    "coname": "Lt. Steven J. Bates Street",
    "location": "74th  Street, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.7501605,
    "long": -73.8919671,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200215",
    "coname": "Lt. Michael P. Warchola Way",
    "location": "84th Place, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.7249978,
    "long": -73.8713384,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200216",
    "coname": "Lt. Kevin Pfeifer Place",
    "location": "79th Place, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.705578,
    "long": -73.870943,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200217",
    "coname": "Lieutenant Kenneth J. Phelan Way",
    "location": "69th Lane, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.7235853,
    "long": -73.8912819,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200218",
    "coname": "Firefighter Vincent S. Morello Street",
    "location": "81st Street, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.7576012,
    "long": -73.8866843,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200219",
    "coname": "Firefighters Boulevard",
    "location": "Third Avenue, Bronx, NY",
    "reason": "911 heroes",
    "lat": 40.8327501,
    "long": -73.9050863,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200220",
    "coname": "Deputy Chief Orio J. Palmer Way",
    "location": "East 234th, Bronx, NY",
    "reason": "911 heroes",
    "lat": 40.89537410000001,
    "long": -73.8606994,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200221",
    "coname": "Firefighter Gregory Saucedo Triangle",
    "location": "Fillmore Avenue and Avenue T, Brooklyn, NY",
    "reason": "911 heroes",
    "lat": 40.6149411,
    "long": -73.91895199999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200222",
    "coname": "Jimmy Quinn Way",
    "location": "Batchelder, Brooklyn, NY",
    "reason": "911 heroes",
    "lat": 40.5950888,
    "long": -73.9379716,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200223",
    "coname": "Jason DeFazio Way",
    "location": "Hartford Avenue and Matthews Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6256107,
    "long": -74.1100332,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200224",
    "coname": "P.O. Moira Smith Way",
    "location": "74th Street, Brooklyn, NY",
    "reason": "911 heroes",
    "lat": 40.6233634,
    "long": -74.01086579999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200225",
    "coname": "Michael D. Mullan Way",
    "location": "Jordan Street, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.7683022,
    "long": -73.7896043,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200226",
    "coname": "Firefighter Jimmy Riches Way",
    "location": "Bay 8th Street, Brooklyn, NY",
    "reason": "911 heroes",
    "lat": 40.6082802,
    "long": -74.0139906,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200227",
    "coname": "AnnMarie Riccoboni Way",
    "location": "34th Avenue, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.7543519,
    "long": -73.8794607,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200228",
    "coname": "Lawrence Virgilio Street",
    "location": "52nd Street, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.7459214,
    "long": -73.9124641,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200229",
    "coname": "Firefighter Salvatore Calabro Place",
    "location": "Prol Place, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5331123,
    "long": -74.1533433,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200230",
    "coname": "Donald DiFranco Way",
    "location": "Rathburn Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.540213,
    "long": -74.1944481,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200231",
    "coname": "Debra Ann DiMartino Way",
    "location": "Sharrotts Road, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5372185,
    "long": -74.2306167,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200232",
    "coname": "Joseph Di Pilato Place",
    "location": "Laredo Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.549417,
    "long": -74.1710099,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200233",
    "coname": "Steven M. Hagis Way",
    "location": "Kramer Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5421109,
    "long": -74.21501239999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200234",
    "coname": "Michele B. Lanza Way",
    "location": "Wood Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5126818,
    "long": -74.2437752,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200235",
    "coname": "Lorraine Lee Way",
    "location": "Richmond Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5804079,
    "long": -74.1692118,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200236",
    "coname": "Michael Massaroli Way",
    "location": "Winchester , Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.53868490000001,
    "long": -74.15724999999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200237",
    "coname": "Charles A. Mauro Jr. Place",
    "location": "Katan Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5515441,
    "long": -74.1601278,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200238",
    "coname": "Lt. Paul T. Mitchell Place",
    "location": "North Pine Terrace, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5388151,
    "long": -74.1792256,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200239",
    "coname": "Salvatore T. Papasso Way",
    "location": "Boulder Street, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.545949,
    "long": -74.19669999999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200240",
    "coname": "Cira Marie Patti Way",
    "location": "Seidman Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5373953,
    "long": -74.1660988,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200241",
    "coname": "Mark Petrocelli Way",
    "location": "Stecher Street, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.530312,
    "long": -74.1873686,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200242",
    "coname": "Joseph Plumitallo Way",
    "location": "Justin Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5557953,
    "long": -74.13470319999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200243",
    "coname": "Patricia Puma Way",
    "location": "Lyle Court, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.56531409999999,
    "long": -74.1383213,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200244",
    "coname": "Peter Raimondi Way",
    "location": "Bennett Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5366797,
    "long": -74.1835309,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200245",
    "coname": "Joseph Reina Jr. Way",
    "location": "Salamander, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5385651,
    "long": -74.22309539999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200246",
    "coname": "Adele Sessa Way",
    "location": "Detroit Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5441084,
    "long": -74.1791834,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200247",
    "coname": "Michael Stabile Way",
    "location": "Gladwin Street, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5313557,
    "long": -74.2223021,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200248",
    "coname": "Firefighter John P. Tierney Place",
    "location": "Buffalo Street, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5445192,
    "long": -74.1255073,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200249",
    "coname": "Joseph G. Visciano Place",
    "location": "Rustic Place, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5473436,
    "long": -74.1472057,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200250",
    "coname": "Frank Thomas “F.T.” Aquilino Way",
    "location": "Shepard Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5950543,
    "long": -74.15782150000001,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200251",
    "coname": "Adam P. Arias Way",
    "location": "Forest Street, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6056079,
    "long": -74.1652589,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200252",
    "coname": "Louis F. Aversano Jr. Way",
    "location": "Shale Street, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5839373,
    "long": -74.1507578,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200253",
    "coname": "Michael E. Beekman Way",
    "location": "McClean Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.59702000000001,
    "long": -74.06957,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200254",
    "coname": "Firefighter Greg J. Buck Place",
    "location": "Windermere, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6020939,
    "long": -74.07795039999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200255",
    "coname": "Milton Gilberto Bustillo Way",
    "location": "Collfield Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6131803,
    "long": -74.14373119999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200256",
    "coname": "Monica Goldstein Way",
    "location": "Slater Boulevard, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.58018879999999,
    "long": -74.0887717,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200257",
    "coname": "Vincent Laieta Jr. Way",
    "location": "Seaver Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.58162799999999,
    "long": -74.0934406,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200258",
    "coname": "Jeannine LaVerde Way",
    "location": "Gower Street, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6046105,
    "long": -74.1237476,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200259",
    "coname": "Stephanie McKenna Way",
    "location": "North Railroad, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5791271,
    "long": -74.1098201,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200260",
    "coname": "Richard Miuccio Way",
    "location": "Piave Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5946246,
    "long": -74.0702128,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200261",
    "coname": "Lt. Philip S. Petti Place",
    "location": "Oldfield Street, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.573308,
    "long": -74.1003259,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200262",
    "coname": "Shawn E. Bowman Jr. Way",
    "location": "Morrison Avenue and North Burgher Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6285632,
    "long": -74.1132062,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200263",
    "coname": "Firefighter Thomas P. Hannafin Place",
    "location": "Jewett Avenue and Waters Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6164692,
    "long": -74.1311301,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200264",
    "coname": "Robert J. Shay Jr. Way",
    "location": "Bosworth and Bement AvenueNew York Avenue and Montgomery Street, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6320225,
    "long": -74.1117026,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200265",
    "coname": "Firefighter Manuel Del Valle Jr. Street",
    "location": "14th Street, Manhattan, NY",
    "reason": "911 heroes",
    "lat": 40.7313474,
    "long": -73.9825664,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200266",
    "coname": "Benjamin Keefe Clark Way",
    "location": "Purcell Street and Clove Road, Brooklyn, NY",
    "reason": "911 heroes",
    "lat": 40.6258579,
    "long": -74.1191145,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200267",
    "coname": "Firefighter John Heffernan Street",
    "location": "78th Street, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.7569812,
    "long": -73.88941609999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200268",
    "coname": "Firefighter Scott A. Larsen Boulevard",
    "location": "Woodhaven Boulevard and Myrtle Avenue, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.702623496,
    "long": -73.8554208,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200269",
    "coname": "Capt. Patrick Waters Road",
    "location": "69th Road, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.7257707,
    "long": -73.8402497,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200270",
    "coname": "Firefighter John J. Florio Place",
    "location": "77th Place, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.7214661,
    "long": -73.8797563,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200271",
    "coname": "Firefighter Daniel T. Suhr Place",
    "location": "Johnson Avenue, Brooklyn, NY",
    "reason": "911 heroes",
    "lat": 40.7076394,
    "long": -73.9329743,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200272",
    "coname": "Firefighter Joseph Patrick Henry Lane",
    "location": "Bay 44th Street, Brooklyn, NY",
    "reason": "911 heroes",
    "lat": 40.5886959,
    "long": -73.9914058,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200273",
    "coname": "Firefighter Sergio Gabriel Villanueva Way",
    "location": "149th Street, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.66744430000001,
    "long": -73.7903096,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200274",
    "coname": "Calvin Gooding Jr. Place",
    "location": "Sloan Street, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.6744233,
    "long": -73.75711199999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200275",
    "coname": "Firefighter Michael Cammarata Place",
    "location": "Jansen Street, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5286987,
    "long": -74.17825049999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200276",
    "coname": "Firefighter William Henry Avenue",
    "location": "133rd Avenue, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.6690038,
    "long": -73.8050031,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200277",
    "coname": "Detective Claude “Danny” Richards Way",
    "location": "West Street, Manhattan, NY",
    "reason": "911 heroes",
    "lat": 40.7236285,
    "long": -74.01157719999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200278",
    "coname": "Firefighter Angel Luis Juarbe Jr. Avenue",
    "location": "Wales Avenue, Bronx, NY",
    "reason": "911 heroes",
    "lat": 40.8114057,
    "long": -73.9077786,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200279",
    "coname": "Captain Vincent E. Brunton Way",
    "location": "16th Street, Brooklyn, NY",
    "reason": "911 heroes",
    "lat": 40.6626611,
    "long": -73.98504559999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200280",
    "coname": "Lt. Joseph Gullickson Way",
    "location": "Jewett Avenue and Victory Boulevard, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.61256909999999,
    "long": -74.1307054,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200281",
    "coname": "Carl A. DeFranco Avenue",
    "location": "Rensselaer, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5408015,
    "long": -74.1950465,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200282",
    "coname": "Brian Nunez Way",
    "location": "27th Avenue and Bayside Lane, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.7724456,
    "long": -73.7999926,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200283",
    "coname": "Firefighter Michael Weinberg Way",
    "location": "Eliot Avenue, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.72203349999999,
    "long": -73.88563409999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200284",
    "coname": "William M. Feehan Triangle",
    "location": "Cary Avenue and Bement Avenue, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.6332615,
    "long": -74.11196249999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200285",
    "coname": "Captain James J. Corrigan Way",
    "location": "Francis Lewis, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.7241362,
    "long": -73.76392609999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200286",
    "coname": "Anne Marie Martino-Cramer Way",
    "location": "Maryland Avenue and Foxhill Terrace, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6102694,
    "long": -74.07175819999999,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200287",
    "coname": "Kristen L. Montanaro Way",
    "location": "Martin Avenue and Victory Boulevard, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6114945,
    "long": -74.1402622,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200288",
    "coname": "Firefighter Lenny Ragaglia Way",
    "location": "Ingram Avenue and Victory Boulevard, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6122662,
    "long": -74.1360698,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200289",
    "coname": "Lt. Chuck Margiotta Way",
    "location": "Sanford Place and Slosson Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6149365,
    "long": -74.116976,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200290",
    "coname": "Michael A. Marti Street",
    "location": "79th Street   , Queens, NY",
    "reason": "911 heroes",
    "lat": 40.71956290000001,
    "long": -73.8759706,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200291",
    "coname": "Lt. Michael T. Quilty Way",
    "location": "Martling Avenue and Slosson Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.6217531,
    "long": -74.1196765,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200292",
    "coname": "Assistant Chief Gerard A. Barbara Way",
    "location": "Freeborn Street and Lincoln Avenue, Staten Island, NY",
    "reason": "911 heroes",
    "lat": 40.5720165,
    "long": -74.0949016,
    "year": "2002",
    "group": 4
  },
  {
    "id": "200293",
    "coname": "E.M.T. David Marc Sullins Place",
    "location": "66th Place, Queens, NY",
    "reason": "911 heroes",
    "lat": 40.7029838,
    "long": -73.8880482,
    "year": "2002",
    "group": 4
  },
  {
    "id": "20210",
    "coname": "Pandit Ramlall Way",
    "location": "133rd Street and Liberty Avenue, Queens, NY",
    "reason": "Pandit Ramlall was a scholar, author, freedom fighter for Guyana’s independence and founder of the Annual Phagwah Parade held in Richmond Hill. He was the leader of the Arya Spiritual Center which educated youths regarding religion and culture. He received a plaque for his dedication to community involvement by the Guyana Cultural Association. Before he migrated to the United States in 1974, he was highly regarded in Guyana where he was born and raised. There, he served as a Member of Parliament advocating for the working class and at one point was jailed for nearly three years at Sibley Hall for his activism. In the United States, he studied psychology and received a diploma in Education. In 1975, he received the prestigious literary award at the first Vishwa Hindi Sammelan (World Hindi Conference) in Nagpur, India and also received numerous awards from Canada and the United States for his teachings and community work. In 2003, Queens Borough President Helen Marshall declared one day of the year as Pandit Ramlall Day.",
    "lat": 40.6910528,
    "long": -73.8133943,
    "year": "2021",
    "group": 3
  },
  {
    "id": "20211",
    "coname": "Henry Clayton Street",
    "location": "169th Street, Queens, NY",
    "reason": "Henry Clayton, Jr. relentlessly served his community starting in the 1970s, providing free extermination services in his Southeast Queens community. He then went on to open what became one of the largest black owned travel agencies in NYC in March of 1988, growing to employ over 30 black and brown community members who also went on to become professional entrepreneurs. He also partnered with Greater Allen A.M.E. Cathedral of New York to provide safe, affordable, and memorable trips for seniors and their families. Additionally, he used his community route as a Frito-Lay salesman as a pathway to support, employ and mentor young men throughout Jamaica Queens. He provided holiday gifts out of his own pocket for over 150 families every year.",
    "lat": 40.7176028,
    "long": -73.79646029999999,
    "year": "2021",
    "group": 2
  },
  {
    "id": "20212",
    "coname": "Little Guyana Avenue",
    "location": "Liberty Avenue, Queens, NY",
    "reason": "This co-naming will commemorate the contributions of the Guyanese community in Richmond Hill. Guyanese now makes up the second largest immigrant group based on the 2010 census.",
    "lat": 40.68368890000001,
    "long": -73.8337902,
    "year": "2021",
    "group": 3
  },
  {
    "id": "20213",
    "coname": "Coach Skip Branch Way",
    "location": "East 100th Street and Third Avenue, Manhattan, NY",
    "reason": "Floyd Branch, Jr. founded the NYC Bombsquad Basketball Classic, a non-profit league that served disadvantaged youth and aimed to keep kids in a safe environment. He founded the league in 1995 and ran the nonprofit for nearly 25 years until his death. He was a coach and mentor to thousands of youths. He served as head basketball coach of the varsity team at Rice High School for 11 years leading the team to four championship games. He also coached at Cardinal Hayes High School in the Bronx and received the Pepsi Cola Heroes in our Community Award in 2006, sponsored by 98.7 Kiss FM and later received the Native New Yorker Award from the John Hunter Memorial Camp Fund Inc.",
    "lat": 40.7877698,
    "long": -73.9474512,
    "year": "2021",
    "group": 2
  },
  {
    "id": "20214",
    "coname": "Lou ‘Big Lou’ Torres Way",
    "location": "East 149th Street and Jackson Avenue, Bronx, NY",
    "reason": "Lou ‘Big Lou’ Torres was born in the South Bronx and served as the Tenant Association President of Robert E. Moore Houses. He secured funding to install security cameras throughout the development to ensure safety throughout the community. He also hosted block parties and other events to celebrate the community. He was also the CEO of BIG LOU Films and led a successful career in the motion picture industry.",
    "lat": 40.8132328,
    "long": -73.90908739999999,
    "year": "2021",
    "group": 2
  },
  {
    "id": "20215",
    "coname": "Terence Cardinal Cooke Way",
    "location": "Fifth Avenue and East 106th Street, Manhattan, NY",
    "reason": "Terence Cardinal Cooke was ordained a priest in 1945 and served as chaplain for St. Agatha’s Home for Children in Nanuet. Later he was appointed an Auxiliary Bishop of the Roman Catholic Archdiocese of New York by Pope Paul VI. In March 1968, he was named the seventh Archbishop of New York and was also named Vicar Apostolic for the United States Military. In 1969, he delivered the benediction at the inauguration of President Nixon. As archbishop, he founded Birthright, which offers women alternatives to abortion, the Inner-City Scholarship Fund, which provides financial aid for Catholic School students, an Archdiocesan Housing Development Program providing housing to the City’s disadvantaged and nine nursing homes. After his death, there was a movement to canonize him as a saint. In 1992, the Congregation for the Cause of Saints designated him as a Servant of God, the first step in the process that leads to beautification and then canonization as a saint. Documentation of Cooke’s life’s work was presented to Pope Benedict XVI in 2010. If approved, Cooke will receive the title Venerable, the second step leading to sainthood.",
    "lat": 40.7942448,
    "long": -73.9511546,
    "year": "2021",
    "group": 3
  },
  {
    "id": "20216",
    "coname": "Police Officer Randolph Holder Way",
    "location": "East 120th Street and the FDR Drive, Manhattan, NY",
    "reason": "Randolph Holder served with the NYPD for five years and was assigned to Police Service Area 5. He was killed in the line of duty",
    "lat": 40.79771830000001,
    "long": -73.9321015,
    "year": "2021",
    "group": 0
  },
  {
    "id": "20217",
    "coname": "Akai Gurley Way",
    "location": "Eldert Lane and Linden Boulevard, Brooklyn, NY",
    "reason": "On November 20, 2014, Akai Gurley, a 28-year-old public housing resident was fatally shot by New York City Police Department (“NYPD”) Police Officer Peter Liang in a darkened stairwell at the Louis H. Pink Houses in Brooklyn, New York. At a press conference on November 21, 2014, NYPD Commissioner William J. Bratton stated that the shooting appeared to be an accidental discharge.",
    "lat": 40.66952939999999,
    "long": -73.862847,
    "year": "2021",
    "group": 0
  },
  {
    "id": "20218",
    "coname": "MaryLou Cerqua Way",
    "location": "Wiman Avenue and Hylan Boulevard, Staten Island, NY",
    "reason": "MaryLou Cerqua was born and raised in Brooklyn, NY. She was a Con Edison employee for 30 years and upon retiring moved to Staten Island where she was heavily involved in volunteer work at St. Clare Church, Seaside Wildlife Nature Park, Crescent Beach, and cleanups at local parks.",
    "lat": 40.5409949,
    "long": -74.1470669,
    "year": "2021",
    "group": 1
  },
  {
    "id": "20219",
    "coname": "Clifford Holtermann Way",
    "location": "Arthur Kill Road and Miles Avenue, Staten Island, NY",
    "reason": "Clifford E. Holtermann was a lifelong Staten Islander who was a member of the Masonic Lodge No. 916, St. Andrew’s Episcopal Church, and Historic Richmond Town. He worked his entire life at Holtermann’s Bakery, founded by his grandfather, which is still in business today and celebrated 140 years of business in October. Holtermann’s Bakery was featured in “Cooks Illustrated” for having the “Best Crumbs” and served as a backdrop for NBC’s “The Blacklist” and FX’s “The Americans.” He won a Louis R. Miller Business Leadership Award in 2010.",
    "lat": 40.5649802,
    "long": -74.1550944,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202110",
    "coname": "Peter Catello Way",
    "location": "Arthur Kill Road and Industrial Loop West, Staten Island, NY",
    "reason": "Peter N. Catello was the owner of Catello Electrical Contracting for almost 50 years, and worked for six months as an electrician at the Fresh Kills Recovery site, working day and night to maintain the electrical and lights for the recovery operation. He will be included on the wall at the 9/11 Responders Remembered Park. He later sent several of his crews out to affected areas after Hurricane Sandy to help people restore power. He died of 9/11 related illness.",
    "lat": 40.545974,
    "long": -74.2297827,
    "year": "2021",
    "group": 0
  },
  {
    "id": "202111",
    "coname": "Anthony M. Scarpaci Sr. Way",
    "location": "14th Street and 86th Street, Brooklyn, NY",
    "reason": "Anthony Scarpaci took over the Scarpaci Funeral Home at the age of 21 after his father’s death in 1939. The Scarpaci Funeral Home was established in 1910 and still operates currently. The Scarpaci family continues to give back to the community and those in need through charitable endeavors.  Many of the family members have been active in community and service organizations including the Lions International, Knights of Columbus, Kiwanis International and Peitro’s Fight. He was a founder of the Little Sons of Italy, a charity that donates to orphanages in Sicily and New York which also established free schools to teach new Americans how to speak English while guiding them through the citizenship application process and he was a founding member and president of the Ben-Bay Kiwanis Club, which has raised millions of dollars for various children’s charities over the past 50 years and still continues today. In 1962, after St. Frances Cabrini Church burned down, he opened his funeral home so services could be held every Sunday to the community until the church was rebuilt.",
    "lat": 40.612735,
    "long": -74.011712,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202112",
    "coname": "Nilda Velazquez Way",
    "location": "West Fordham Road and Davidson Avenue, Bronx, NY",
    "reason": "Nilda Velazquez moved to New York from Puerto Rico with her mother in 1948.  In 1960, her mother died of cancer when she was 12 years old and she grew up in an orphanage. She attended school and raised her family the best way she could. She organized with her fellow mothers for better housing, better schools, and better living situations. She organized along with NYS Assemblyman Jose Rivera, and former NYC Council Member Maria Baez while serving in their state and city legislative offices respectively.  She was renowned for her legendary constituent services. In addition to her being a public servant, she also was a community activist.  She participated in the Creston Avenue Block Association, providing block parties. She started the Davidson Family Community Association. She was active in the Bronx County Democratic Party with Roberto Ramirez and Jose Rivera as a judicial delegate and also served as the Democratic District Leader of the 78th Assembly District, running the North End Democratic Club. She ran for State Committee Member, and won with the highest plurality of everyone running with her. Whether it was fighting for Criminal Justice Reform or protesting cancer clusters stemming from the United States Naval bases in Vieques, Puerto Rico or fighting for basic living conditions in the West Bronx, she fought hard for the community.",
    "lat": 40.8627253,
    "long": -73.90229479999999,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202113",
    "coname": "Five Points",
    "location": "Baxter Street and Worth Street, Manhattan, NY",
    "reason": "This co-naming would recognize the lives of tens of thousands of 19th century Irish, Italian, Chinese and Jewish immigrants, as well as the free African-Americans who lived together in this notorious slum where they faced considerable poverty and adversity while helping make the City the melting pot it is today.",
    "lat": 40.7143722,
    "long": -74.0004774,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202114",
    "coname": "Bishop Michel White Way",
    "location": "White Plains Road, Bronx, NY",
    "reason": "Bishop Michel White was the founder and pastor of the Cathedral at Greater Faith and served the Bronx community for over 30 years.  Her contributions were numerous as she worked tirelessly to support less fortunate members in the community by hosting an annual Thanksgiving food drive, an annual coat drive, created a prison ministry, annual back to school rally, conducted neighborhood health fairs, toy drives for children, provided drug rehabilitation program, free concerts for the community, provided immigrants with immigration lawyers, visited the sick in hospitals, taught children how to sing and play instruments and worked closely with the NYPD for the safety of the community. In 2017, she gave the Opening Prayer for the New York State Assembly in Albany. She was a member of the Fresh Winds Ministry Alliance, Presiding Prelate of the Churches of the Living God and served on the Executive Council and later became the First Assistant to the Presiding Prelate.",
    "lat": 40.8563009,
    "long": -73.8676435,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202115",
    "coname": "Lt. Paramedic Edith Elida Torres Way",
    "location": "21st Street and 34th Avenue, Queens, NY",
    "reason": "Edith Elida Torres served as a paramedic for 23 years, as saving lives was the only calling she ever had. Like many of her fellow Bravest and Best, she rushed to the World Trade Center despite being off duty on the morning of September 11, 2001. She spent the rest of the day working the pile, rescuing survivors and looking for her colleague Carlos Lillo, who unbeknownst to Torres, had lost his life in the collapse of the south tower. She continued on in her duty, rising to the rank of lieutenant in 2005. She also collaborated with Lillo’s family to honor him by having a park named in his memory as well as with the Carlos Lillo Memorial Paramedic Scholarship. She died of 9/11 related illness.",
    "lat": 40.7628425,
    "long": -73.9339816,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202116",
    "coname": "Yusuf Kirriem Hawkins Way",
    "location": "Verona Place, Brooklyn, NY",
    "reason": "On the evening of Wednesday August 23rd, 1989, Yusuf Kirriem Hawkins, a 16-year-old from East New York was shot in the chest and killed in Bensonhurst, Brooklyn, marking the third killing of a black male by white mobs in New York City during the 1980’s. Yusuf was a smart young man who was accepted to a technical school and had the brightest of futures ahead of him. On the night of August 23rd, Yusuf and his friends were visiting Bensonhurst to look at a used car. The group's attackers had been lying in wait for black youths that were expected to attend a party at the home of a teenage girl in the neighborhood. Some say the girl had previously dated one of the killers and/or she had invited black youths to her neighborhood to taunt the neighborhood boys. Hawkins and his friends walked onto the ambushers' block unaware that local residents were waiting to attack any group of black youths they saw. After the murder of Hawkins, police said that he had not in any way been involved with the neighborhood girl whom the killers believed Hawkins was dating. Yusuf’s death led to demands of greater racial justice within New York City. A few days after his murder, 300 demonstrators marched through Bensonhurst in his name facing opposition from local residents in their fight for justice.",
    "lat": 40.6809276,
    "long": -73.9476785,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202117",
    "coname": "Richard Wright Way",
    "location": "Carlton Avenue, Brooklyn, NY",
    "reason": "Richard Wright was an African American writer and poet who was employed by the Federal Writer’s Project and received critical acclaim for “Uncle Tom’s Children,” a collection of four stories and was also well known for his 1940 bestseller “Native Son,” and his 1945 autobiography, “Black Boy.” Raised in Jackson, Mississippi, he was interested in American literature. By the age of 16, a short story he wrote was published in a Southern African American newspaper. In 1927, he moved to Chicago and joined the Communist Party after being frustrated with American capitalism. He joined the Federal Writers’ Project and moved to New York City in 1937. In 1938, “Uncle Tom’s Children” was published earning him a $500 prize from Story magazine and led to a 1939 Guggenheim Fellowship. He published “Native Son” in 1940, which became a bestseller and the first novel written by an African American to be selected by the Book-of-the-Month Club. After becoming disillusioned with both the Communist Party and white America, he moved to Paris and wrote four more novels and lived there until his death.",
    "lat": 40.6876061,
    "long": -73.9717129,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202118",
    "coname": "Melquain Jatelle Anderson Drive",
    "location": "Gold Street and York Street, Brooklyn, NY",
    "reason": "Melquain Jatelle Anderson was killed while waiting at a bus stop outside of the Farragut Houses. His family later started a scholarship and emergency fund in his name at John Jay College where he earned his bachelor degree.",
    "lat": 40.7013974,
    "long": -73.9828512,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202119",
    "coname": "Ida B. Wells Plaza",
    "location": "Barclays Times Plaza, Brooklyn, NY",
    "reason": "Ida B. Wells was an African-American journalist, abolitionist and feminist who led an anti-lynching crusade in the United States in the 1890s.  She went on to found and become integral in groups for African-American justice.  She was a teacher who became a vocal critic of the condition of African-American only schools in Memphis.  In 1896, she formed the National Association of Colored Women and later became a founding member of the National Association for the Advancement of Colored People.  She worked with the National Equal Rights League to end discriminatory hiring practices for government jobs and also created the first African-American kindergarten in her community and fought for women’s suffrage.",
    "lat": 40.6826465,
    "long": -73.97541559999999,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202120",
    "coname": "Jitu Weusi Plaza",
    "location": "Putnam Plaza, Brooklyn, NY",
    "reason": "Jitu K.Weusi, formerly known as, Leslie R. Campbell, was a long-time educator and activist throughout his life.  He was born and raised in Brooklyn and was very active in education, politics, social justice and music. He began his career in education with the New York City Department of Education in 1962 and was a founding member of the African-American Teachers Association (ATA).  He was widely known for his involvement in the Ocean-Hill/Brownsville conflict that proved to be instrumental in bringing about changes nationwide in community control of public education.  In the late 1960’s, he left the Department of Education and opened the first Black independent private school for inner-city youth: Uhuru Sasa Shule (Freedom Now School). The school was one of the founding member schools of the Council of Independent Black Institutions (CIBI), an international umbrella organization for independent schools.  Among his political accolades, he was essential in forming the New York Chapter of the National Black United Front (NBUF); African-Americans United for Political Power, which was a vital force in the election of Mayor David Dinkins; and, he worked vigorously on Reverend Sharpton’s campaign to become the first black US Senator from New York.  In 1970, he was the principal operator of the East Cultural and Educational Center, where he presented Jazz programs weekly which featured Freddie Hubbard, Max Roach, Betty Carter, Roland Kirk, Gary Bartz, Randy Weston, Pharoah Sanders, McCoy Tyner, Hugh Masekela, Sun Ra and a host of other performers.  An avid enthusiast, collector of and writer on Jazz music, he served as the chairperson of the Central Brooklyn Jazz Consortium for several years.",
    "lat": 40.6825563,
    "long": -73.9619276,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202121",
    "coname": "Dr. Sam Pinn Way",
    "location": "Fulton Street, Brooklyn, NY",
    "reason": "Dr. Sam Pinn Jr. was born in Rice, Virginia and later moved to New York to become a life-long resident of Bedford-Stuyvesant, Brooklyn. He served in the United States Army Reserves for eight years and was honorably discharged with the rank of Lieutenant. He earned his Bachelor of Arts degree in sociology from Morgan State University, a Masters of Social Work Degree from Rutgers University, and two Doctors of Law degrees bestowed by Mary Holmes College and Morgan State University. He was also a Licensed Master of Social Work (LMSW) in the State of New York. In May 1973, he helped found and then served as Chairman of the Fort Greene Council Inc. Under his leadership, the Council expanded its sponsorship of senior centers, offering a range of comprehensive services, from their first center located in Fort Greene-Clinton Hills to its present sponsorship of 13 centers located throughout Brooklyn. The expansion also included a meals-on-wheels program, two child care centers, COMPASS, and UPK for ALLs. He was a visionary who created and organized Jazz 966 in November 1990, opening its doors to the Brooklyn community at affordable admission fees at a modest $15.00 donation, which was an alternative to the expensive Jazz clubs in New York City. Jazz 966 featured world renowned artist, such as Wynton Marsalis, Trumpeter; Houston Person, Saxophonist; Etta Jones, Jazz Singer; and their own Danny Mixon, Pianist. For five years, he hosted and produced \"The Grand Ones,\" a weekly radio show formerly aired on WNYE, 91.5FM. He served as Chairman of Independent Brooklyn CORE for 16 years and helped fight for social justice and political empowerment. He was elected to Central Brooklyn's Community School Board No. 16, where he held the position of Chairman and was instrumental in initiating policies which dramatically improved the districts overall reading and math scores as well as its attendance rating. He was the recipient of more than 90 awards and accolades from various elected officials, block and tenant associations, PTAs, academic and religious orders, schools, fraternal groups, cultural institutions and other groups and was also honored by Ramapo College's Board of Trustees with its most prestigious award, the Fred and Florence Thomas Award. He was also the recipient of the inaugural Sam Pinn Educator Activist Award presented by Ramapo College's Minority Faculty and Staff Association for his years of advocacy on behalf of Ramapo's students, faculty and staff of color.",
    "lat": 40.689699,
    "long": -73.982957,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202122",
    "coname": "Joe Torres Way",
    "location": "Westchester Avenue and Thieriot Avenue, Bronx, NY",
    "reason": "Joe Torres decided from a young age that he wanted to become a cook and eventually he opened Joe’s Place, renowned for its Puerto Rican cuisine. Many famous people visited Joe’s Place and author Kevin Fitzpatrick referred to Mr. Torres as one of the most beloved chefs in the Bronx in his book, 111 Places in the Bronx That You Must Not Miss. He died of the coronavirus.",
    "lat": 40.8323889,
    "long": -73.864573,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202123",
    "coname": "Janta-Połczyńska Polish Heroes Way",
    "location": "43rd Avenue and Judge Street, Queens, NY",
    "reason": "Walentyna Janta-Połczyńska (1913 -2020) and Aleksander Janta-Połczyński (1908 – 1974) were heroes in the fight against Nazism. Walentyna was one of the last surviving members of the Polish government in exile which was formed after Nazi Germany invaded Poland. They moved to New York and opened an antiquarian bookstore and opened their home to Polish artists and writers who escaped Communist dictatorship that had taken power after the War. Walentyna was known as the first lady of American Polonia. When Poland was invaded in 1939, she became a personal secretary to General Wladyslaw Sikorski, the prime minister of the Polish government in exile and commander of the Free Polish Armed Forces. She translated and prepared reports by Jan Karski, the underground courier who delivered eyewitness accounts of atrocities against Jews in the Warsaw ghetto and helped organize Dawn, a clandestine radio station that broadcast to Poland from an intelligence complex in England. She was active with the Jozef Pilsudksi Institute of America, a scientific research organization and archive in Brooklyn and the Kosciuszko Foundation (the American Center of Polish Culture). She was awarded the Medal of Merit for Polish Culture by Poland’s Ministry of Culture and National Heritage in 2011 and received the Jan Karski Eagle Award in 2016. Aleksander Janta-Połczyński was awarded the Cross of Valor, the Award of the Association of Polish Writers In Exile, Award for the Jurzykowski Foundation, among others for his writings. He was president of the American Council of Polish Cultural Clubs, a board member of the Polish Institute of Arts and Sciences of America and was second lieutenant of the cavalry of the Polish Army.",
    "lat": 40.742646,
    "long": -73.87676,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202124",
    "coname": "Dr. Roy Hastick Sr. Way",
    "location": "Caton Avenue and Flatbush Avenue, Brooklyn, NY",
    "reason": "Roy Hastick Sr. was uniquely adept at forging bonds and creating relationships with elected officials and business leaders that led to new opportunities for New Yorkers. He was a driving force in uniting businesspeople and a valued partner on so many issues directly impacting the Caribbean community. He joined the Battlehill Seminary in Grenada where he studied as a Catholic Priest for two years and later became the head detail for the Chief of Police in Tortola. He migrated to the United States in 1972 and worked at the Port Authority. He later joined the Brooklyn Economic Development Corporation to start discussions leading to the formation of a Caribbean American Chamber of Commerce (CACCI). In 1985, he founded the Caribbean American Chamber of Commerce and Industry, Inc. with 10 founding members and is still a well-recognized business entity. He was a well sought out motivational speaker and convened over 600 business development seminars. He was an elected delegate to the 1995 White House Conference on Small Business and was successful in getting Two-Way trade with the Caribbean region into the final recommendations that were submitted to the United States Congress. CACCI has provided emergency disaster relief in response to hurricane disasters in the Caribbean region and accomplished initiatives including providing weekly small business clinics, business services for microenterprises on how to start, manage, operate and expand a business in New York, workshops and business seminars. He received an Honorary Doctorate of Humane Letters from CUNY, the Goodwill Ambassador Award from the Jewish Community among many more.",
    "lat": 40.652921,
    "long": -73.95938509999999,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202125",
    "coname": "Bishop Ceacer Gooding Road",
    "location": "Macombs Road and West Mount Eden Avenue, Bronx, NY",
    "reason": "Ceacer Gooding served in the United States Army and was later employed by the United States Postal Service. He attended the Manhattan Bible Institute and in 1958, was ordained as an Elder at Washington Temple COGIC and served as the Junior Pastor and Assistant Pastor of the Gospel Temple Church of America in New York City. He was Pastor of Gospel Temple Church of America in May 1965 for four years. In 1969, he and his wife founded Miracle Revival Center Church in Harlem, however, the congregation grew so much that they relocated to the Bronx. He was consecrated to the Bishopric in 1984 and became known as the “Radio Preacher” for 19 years, he was the recipient of numerous awards and was a very popular guest speaker and counselor.",
    "lat": 40.8449165,
    "long": -73.9174034,
    "year": "2021",
    "group": 3
  },
  {
    "id": "202126",
    "coname": "Naimah Bilal Way",
    "location": "Macombs Road and Goble Place, Bronx, NY",
    "reason": "Naimah Bilal was a lifelong, tireless community advocate born and raised in Harlem, NY. She began her community involvement at an early age under the leadership of other prominent community members, who marched for the construction of an overpass for the FDR Drive. The community successfully won the attention of the city who addressed the public safety concern. Later, Ms. Bilal and her family moved to Lenox Avenue in Harlem, and she continued to be active on several committees at Masjid Malcolm Shabazz. Ms. Bilal worked for the NYS Division of Housing & Community Renewal (DHCR) Representing the Clerical Staff of this Agency and Delegate of DC 37 until retiring after 22 years in October 2007. Upon moving to the Bronx, she became involved with several community-based organizations, including the 44th Precinct Community Council, CASA (Community Action for Safe Apartments), the Tenant, Block, and Neighborhood Council for District 16, and the Bronx Community Board 4. She advocated for Bronx residents to know their rights, to have more affordable housing, to prevent displacement, to organize tenant associations, and to become vocal community members. Naimah Bilal was the President of the 1515 Macombs Road Tenant Association.  She modeled for her community civil engagement through her membership with the Bronx Democratic Club and her local community board.  Furthermore, she was an active member of the DC37 Retirees. Ms. Bilal was a proud and accomplished mother, grandmother, great-grandmother, and a community organizer.  She encouraged all to get involved, especially the Youth, so they have a full understanding of what is going on in their communities and awareness of their rights and responsibilities; she empowered her community to become civically engaged and united. Ms. Bilal served as a beautiful example of those essential values. She made significant contributions to the Bronx. District 16 mourned the passing of an incredible community leader and advocate, Ms. Naimah Bilal, on July 17, 2018. She was persistent and steadfast in her efforts to fight for affordable housing and improved quality of life for Bronxites. Her work and her memory will live on. Council Member Vanessa L. Gibson, Congressman Jose Serrano, and NYS Senator Jose Serrano have had the honor and the privilege of working with and honoring Ms. Bilal and her many contributions.",
    "lat": 40.8441929,
    "long": -73.91745,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202127",
    "coname": "Joanne Webb-Dixon Way",
    "location": "Trinity Avenue and 161st Street, Bronx, NY",
    "reason": "Joanna Webb Dixon was a prominent member of her community. She was well known for her advocacy as a member of Community Board 3, participant of the 42nd precinct, and founding member of OEMs Bronx CERT 3. Joanne Webb-Dixon joined the Bronx 3 team in 2007, serving as deputy team chief until she passed away in 2017. Her accomplishments led to the annual Joanne Webb-Dixon NYC Cert Ambassador Award for community service. Each spring, NYC Emergency Management will present the award in Joanne’s honor to the CERT team that shows exemplary service in preparing communities for emergencies through education and resiliency. The Bronx 3 CERT team serves neighborhoods including Claremont Village, Concourse Village, Crotona Park, Morrisania, Woodstock, and Melrose. She was a member of the Parkchester Branch of the NAACP – Executive Committee Member; SDFCA community School District Twelve Advisory Council Member; Big Brother/Big Sister Program – School Volunteer; The Taino Lions Club; South East Bronx Neighborhood Centers (SEBNC); Woodstock Terrace Board of Directors; Voz Entertainment Group – Administrator; Vice President; NYPD 42nd Precinct Community Council Inc. – Correspondence Secretary, City of New York Community Board #3 – Chairperson of the Health and Human Services Committee and an active supporter of the Williamsbridge Club of the National Association of Negro Business and Professional Women’s Clubs Inc (NANBPWC).   In addition to her many acts and deeds of kindnesses throughout her lifetime, The Williamsbridge Club was proud to present their Community Service Award to Joanne Webb-Dixon in May 2003 for her commitment and service to the community.   Joanne served the seniors of the Davidson Center in the Bronx by helping them to monitor blood pressures through the New York City Department of Health.",
    "lat": 40.8217274,
    "long": -73.9064758,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202128",
    "coname": "Brandon Hendricks-Ellison Boulevard",
    "location": "Park Avenue and East 156th Street, Bronx, NY",
    "reason": "Brandon Hendricks-Ellison was killed a week after he graduated from Metropolitan Soundview High School. He was the victim of random gun violence at a party. He was a star athlete on his high school basketball team and had earned a scholarship to St. John’s University. A vigil was held in the Bronx after his death to protest gun violence and honor his life. As a result of his death, his family, along with local politicians and activists called for justice and change.",
    "lat": 40.8240665,
    "long": -73.9186345,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202129",
    "coname": "Daniel C. Cestaro Way",
    "location": "Morris Park Avenue and Hone Avenue, Bronx, NY",
    "reason": "Daniel C. Cestaro was a veteran during the Korean War 1950-1953 and businessman who was the owner of Cestaro furniture located on Morris Park Avenue since the 1960’s. In 1973, he was one of the original founders of the Morris Park Community Association, serving as the first president and remained an active member throughout his life. He helped establish and develop the Morris Park Patrol and the Morris Park Columbus Day Parade. He helped establish Community Associations in Allerton Avenue, Pelham Parkway, Pelham Bay and Zerega Avenue which are vital associations in the community currently. He served on the advisory board of Jacobi Hospital, Westchester Square Hospital and Calvary Hospital for over 30 years. He actively campaigned for numerous local politicians for the benefit of the community and was an active member of St. Francis Xavier Church where he founded the Home School Association.",
    "lat": 40.8488184,
    "long": -73.8546562,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202130",
    "coname": "Beatrice Castiglia Catullo Way",
    "location": "Morris Park Avenue and Matthews Avenue, Bronx, NY",
    "reason": "Beatrice Castiglia Catullo was a humanitarian and nurse who devoted her life to charity work. She helped build a chapel for the Sister Servants of Mary, organized and became the first president of the Parkchester chapter of Cancer Care Inc. and founded the Medical Mission Aid Center at St. Raymonds Parish. In 1964, she founded a home attendant service for the elderly being discharged from hospitals without proper home care. In 1965, she incorporated and named this organization Regional Aid for Interim Needs R.A.I.N., which has since become one of the largest non-profit social services agency in the Bronx. R.A.I.N. was awarded its first government contract by the New York City Department for the Aging in 1975 to provide home care services and continues today. She was the first female inducted into the Rotary Club of the Bronx, which created an award in her honor called the Beatrice Castiglia Catullo Award in 2016 and she was also awarded with an Honorary Doctorate Degree by Mercy College.",
    "lat": 40.846145,
    "long": -73.8617144,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202131",
    "coname": "Joe DeSimone Way",
    "location": "Middletown Road and Stadium Avenue, Bronx, NY",
    "reason": "Joseph Thomas DeSimone was born in the South Bronx. He attended Blessed Sacrament Cardinal Hayes. He was a gifted athlete and an even bigger sports fan, and from childhood filled his days with basketball, football, and baseball. Over the years, Joe took his passion for youth sports, determination, teamwork, hard-earned victories, and community to Spellman High School, where he coached both junior varsity and varsity football, leading his team to two A Division City Championships in 2006 and 2008 and joining the Catholic High School Football League Board of Governors. In 2018, he was inducted into the Spellman High School Hall of Fame, honored for his years of youth mentorship, the sense of family he created among his players, and the absolute conviction he cultivated that every single one of them was capable of and worthy of excellence.  In 2015, he returned to the Warriors, and served three more years as League President. During this time, he evolved the league with a transition to technology and connectivity, while maintaining Warrior traditions and values. He led the Warriors until 2018, during which he also initiated a free youth training clinic, open to all children of the community. Each spring, more than 100 children participate in the free program that was dedicated to ‘taking children back outdoors for fitness and fun. In 2019, he was honored by the Morris Park Community Association for his lifelong commitment as a Bronxite, demonstrated through his level of involvement with Little League baseball and football in the Bronx. Youth sports was his passion, and made him a local celebrity in the neighborhood. On 9/11, he was at the World Trade Center performing search and rescue efforts with his team from Con Ed, and continued for weeks with16-hour shifts. In 2006, Joe was diagnosed with Chronic Lymphocytic Leukemia. In 2008, the family had organized its first Team DeSimone for the Lymphoma Research Foundation’s Lymphomathon. Over the next 12 years the family, and the dear friends who are part of that family, have helped raise over $100,000 to find a cure in Joe’s honor, and in 2018 were recognized with the LRF’s Marnie Gordon Founder’s Award.",
    "lat": 40.8484445,
    "long": -73.8204104,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202132",
    "coname": "Lorraine Nugent Way",
    "location": "Bayshore Avenue and Ampere Avenue, Bronx, NY",
    "reason": "Lorraine Nugent was a dedicated community leader who devoted her time and leadership to many senior organizations in her community. Since 1990, she ran the local AARP group of seniors hosting monthly meetings. She was the first woman to be given the title of “commodore” for the Turner Club in Throggs Neck, which was originally organized in 1850 to give men a place to exercise and develop their physical abilities.  She was president of the local chapter of the Red Hat Society, (One of the premier women's social organizations in the world, the Red Hat Society based in Fullerton, CA, began with the gift of a red hat and has grown into a universal symbol for women around the globe as they victoriously celebrate turning 50 and entering into the next phase of their lives. The social message behind the first red hat has resonated with millions of women around the globe regardless of race, creed, occupation, age or socio-economic status. Today, it is commonplace to see Red Hat Society members out frolicking and embracing life to the fullest in their now famous symbol, the \"red hat.\") a group for women 50 years old and over that offered several community service events and programs. It provides women with opportunities for social interaction, both for reconnecting with old friends and making new ones.",
    "lat": 40.8460897,
    "long": -73.8164728,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202133",
    "coname": "5th Bombardment Squadron Memorial Way",
    "location": "Hillside Avenue and 239th Street, Queens, NY",
    "reason": "5th Bombardment Squadron was a bomber squadron based in Mitchel Field on Long Island. In the early morning of June 17, 1940, two Army B-18 bombers took off from Mitchel Field on for training drills. At 8:49 a.m., while the planes were flying at approximately 2,500 feet, the two Army B-18s locked wings. The two planes burst into flames and crashed into the residential community of Bellerose, Queens below. Local residents, many of whom were women, desperately tried to save the victims of the plane crash before the fire department and emergency medical staff arrived. Neighbors used garden hoses, a fire extinguisher and blankets to treat burn victims and put out fires. Three fire trucks, two engines and a rescue squad responded to the crash. Ultimately, the efforts of the community and the first responders were not enough to combat the impact of the crash and the subsequent heat and fire caused by the gasoline used to power the large planes. All eleven Army Airmen were killed as was Mrs. Emily Kraft, who died the next day from burns she received after her home was set ablaze by one of the planes.",
    "lat": 40.7335,
    "long": -73.72609609999999,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202134",
    "coname": "Council Member Thomas V. Ognibene Way",
    "location": "83rd Street and Furmanville Avenue, Queens, NY",
    "reason": "Thomas V. Ognibene was elected to the New York City Council in the November 1991 election in the newly created 30th Council District, and subsequently re-elected in 1993 and 1997, serving the full ten years allowed by term limits. During this time, he served on the Finance, Public Safety, Housing and Buildings, Standard and Ethics, and General Welfare committees. In 1995, he was appointed by Speaker Peter F. Vallone to the Council’s Leadership Team and Budget Negotiating Committee, where he gained extensive experience in negotiating the City’s legislative and financial agenda with the Mayor. On November 23, 1994, he was elected as the Minority Leader of the New York City Council. As Minority Leader, he was well known as respected for his passionate defense of his communities’ middle class principles. He made numerous appearances on national and local television and radio and was particular well known for his appearances on NY1, where he was earned a reputation as an aggressive debate. He was instrumental in the complete renovation and reconstruction of Juniper Valley Park in the 1990s and early 2000s. He served as Executive Vice Chairman and Executive Director of the Queens County Republican Party, President of the Evergreen Republican Club, Law Chairman of the Queens County Conservative Party and was a member of the Blackstone Lawyers Club, Catholic War Veterans, American Legion, Americans of Italian Heritage and Glendale Kiwanis.",
    "lat": 40.7185353,
    "long": -73.869575,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202135",
    "coname": "Neir’s Tavern Way",
    "location": "78th Street and 88th Avenue, Queens, NY",
    "reason": "Neir’s Tavern recently celebrated 191 years in existence as a staple in the local community of Woodhaven. According to its website, founded in October of 1829, “it is one of the few old drinking establishments that have been in almost continuous operation (Prohibition notwithstanding) and in the same location, for its entire history.” Neir’s Tavern has been included in several Hollywood films, including Goodfellas starring Robert DeNiro, Joe Pesci, Ray Liotta, and Lorraine Bracco, and Tower Heist, starring Ben Stiller, Eddie Murphy, Tea Leoni, and Alan Alda. The Tavern has survived several ownerships and attempts to sell the property. Recently, Council Member Holden, along with the Queens Chamber of Commerce, Assembly Miller Mike Miller, Community Board 9, and the Mayor’s office, helped broker a lease agreement deal that would allow for the Tavern’s continued operation at this location. Neir’s Tavern has contributed to several philanthropic efforts over the years and has hosted food giveaways during the coronavirus pandemic. Under the leadership of Loycent Gordon, an active FDNY firefighter, Neir’s Tavern continues to serve the community with honor and distinction.",
    "lat": 40.6897101,
    "long": -73.8633435,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202136",
    "coname": "Detective Jeffrey A. Lee Way",
    "location": "Yellowstone Boulevard and Austin Street, Queens, NY",
    "reason": "Detective Lee served with the NYPD for 25 years. He was assigned to the 112th Precinct Detective Squad and made hundreds of arrests, earning him promotions to Detective Investigator and Detective 2nd Grade. He died as a result of 9/11 related illness following his assignment to the search and recovery efforts at Ground Zero.",
    "lat": 40.7225788,
    "long": -73.85138309999999,
    "year": "2021",
    "group": 0
  },
  {
    "id": "202137",
    "coname": "Rabbi Dr. Asher Murciano Way",
    "location": "108th Street and 67th Avenue, Queens, NY",
    "reason": "Rabbi Dr. Asher Murciano was the Rabbi for the Sephardic Jewish Center for 67 years making him the country’s longest serving Sephardic rabbi of the same congregation. Additionally, he was a noted rabbinical scholar. He was sent to Menkes, Morocco, to the home of the Chief Rabbi, where he studied and sang with the famous Sephardic singer, Joe Amar. Ordained by Rabbi Baruch Toledano, he achieved the highest degree of Yore Yore Yadin Yadin, an ordination that permits a rabbi to make rabbinical decisions on Jewish law. In 1948, arrangements were made by the Mirrer Yeshiva in Brooklyn, to bring the top eighteen students from Morocco to study at the world-renowned graduate school for Talmudic scholars. Shortly after arriving, he officiated at both Sephardic and Syrian synagogues in Brooklyn. While attending the Mirrer Yeshiva and Yeshiva University (YU) on weekdays, he commuted to Philadelphia to officiate at Mikve Israel, the Spanish and Portuguese Synagogue, as Assistant Rabbi and Hazan for three years. In 1953, he became the rabbi of the Sephardic Jewish Center of the Bronx. He earned his Ph.D. at NYU. He taught at York College and YU. He became a respected member of the Rabbinical Council of America and the New York Board of Rabbis. He was Chaplin to the Sephardic Jewish Brotherhood of America and the Sephardic Home for the Aged. For thirty-five years, he was a chaplain at Jacobi Hospital. He was beloved by all who knew him for his distinct religious services, Tora reading, Haftarot, scholarship, divre Tora. His services and compassion touched so many people, young and old, from all the Sephardic communities in the greater New York area.",
    "lat": 40.728962,
    "long": -73.8475642,
    "year": "2021",
    "group": 3
  },
  {
    "id": "202138",
    "coname": "Mary Sansone Way",
    "location": "DeGraw Street and Henry Street, Brooklyn, NY",
    "reason": "Mary Sansone was a lifelong community activist. She founded the Congress of Italian-American Organization, a social services organization and CURE, a nonprofit corporation dedicated to reducing ethnic and racial tension and building diverse relationships throughout the community. When her son was killed in a plane accident, she created a scholarship program in his name for high school graduates. Working for the United Nations Relief Fund, she accompanied two orphaned children to twenty-three states to raise funds for war torn Italy. The trip culminated in a visit with President Truman where she was awarded his pen used to sign the bill allocating funding for this cause. In conjunction with Bayard Rustin, she formed the first coalition of Italian, African and Spanish Americans to stop gang violence that was plaguing the city. She helped establish the New Era Democratic Club, a group which backed candidates based on their platform not party ties and also helped start the first pre-K programs and after school and senior center activities",
    "lat": 40.684816,
    "long": -73.99908099999999,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202139",
    "coname": "Joseph A. Ferris Way",
    "location": ", Brooklyn, NY",
    "reason": "Joseph A. Ferris was a five term New York State Assembly Member from Brooklyn, fighting against redlining policies and chairing the Science and Technology Committee, where he advocated for projects utilizing reusable energy. He also co-founded the Slope Independent Democrats which would become the Central Brooklyn Independent Democrats, a very important civic organization today. After his time in the Assembly, he stayed through the Park Slope Civic Council, the Kensington Community Council, both which he also co-founded, and the Magnolia Tree Institute. All remain important community organizations to this day. Afterwards, he remained active in the community, testifying at community board hearings, working as a substitute teacher, and advocating for local issues ranging from manufacturing jobs to City Council term limits. Additionally, he worked to preserve important cultural touchstones, namely the Old Stone House in Washington Park, and helped found the Brooklyn Irish-American Day Parade. He passed away from COVID-19.",
    "lat": 40.6781784,
    "long": -73.9441579,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202140",
    "coname": "Jose A. Perez Way",
    "location": "3rd Street and Prospect Park West, Brooklyn, NY",
    "reason": "Jose A. Perez died after giving his life in the line of duty while responding to another officer’s request for help. He was an outstanding and devoted man of peace who offered himself for the sake of saving others, and was posthumously awarded the New York Police Department Purple Shield Medal for his sacrifice.",
    "lat": 40.6682422,
    "long": -73.973857,
    "year": "2021",
    "group": 0
  },
  {
    "id": "202141",
    "coname": "Pete Hamill Way",
    "location": "7th Avenue, Brooklyn, NY",
    "reason": "Pete Hamill was born in Park slope to Irish immigrants, and was the editor of three New York daily newspapers, working for over 40 years covering events and issues like conflicts in Vietnam, Lebanon, Nicaragua, and Northern Ireland as well as racial and class tensions throughout New York City. He wrote for the New York Daily News, the New York Post, Newsday, the Village Voice, New York magazine, and Esquire, among other publications. He won a Grammy award in 1975 for writing the liner notes to Blood on the Tracks by Bob Dylan, and is considered a legendary columnist and journalist for his extensive work and dedication covering New York City. He also authored numerous novels that popularized his writing style and love for New York City. He was considered a bona fide New York celebrity, featured in numerous gossip columns for being associated with figures like Jacqueline Kennedy, promoting his books on television, and attending numerous charity events and parties. He was also well-known for his advocacy, standing up to publishers over pay and treatment of employees, and also made news when, as Editor-in-Chief of the New York Post, promoted and hired several women and minority employees and reporters. He was a nationally recognized author and journalist for his books and columns, and won a George Polk Career Award in 2014 for his lifetime contributions to journalism.",
    "lat": 40.6674769,
    "long": -73.9811658,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202142",
    "coname": "Firefighter John “Jack” Toomey Way",
    "location": "Hoyt Street, Brooklyn, NY",
    "reason": "John Toomey was assigned to Brooklyn’s Ladder Company 123. He died in the line of duty when he suffered a heart attack while fighting a fire in a building on Crown Street.",
    "lat": 40.6836302,
    "long": -73.989791,
    "year": "2021",
    "group": 0
  },
  {
    "id": "202143",
    "coname": "St. Raphael of Brooklyn Place",
    "location": "State Street, Brooklyn, NY",
    "reason": "Raphael Hawaweeny was the first Orthodox bishop consecrated in North America in 1904. He founded The Word, the official news magazine of the Antiochian Archdiocese which is still published monthly today, and informs readers of Orthodox news and also educates and inspires with articles on faith and practice. He traveled throughout the United States and founded thirty parishes in North America. His feast day is celebrated in the Antiochian Archdiocese on the first Saturday of November. He founded a cathedral in Brooklyn’s Little Syria and became St. Raphael of Brooklyn.",
    "lat": 40.6891515,
    "long": -73.9884695,
    "year": "2021",
    "group": 3
  },
  {
    "id": "202144",
    "coname": "Cecil Corbin-Mark Way",
    "location": "143rd Street and Convent Avenue, Manhattan, NY",
    "reason": "Cecil Corbin-Mark was a long-time Harlem activist and was the Deputy Director of the non-profit WE ACT for Environmental Justice. He was an environmental advocate from Harlem who advocated for health protections and climate action and was instrumental in getting environmental laws passed. Prior to joining WE ACT, he worked for the Bronx County District Attorney, NYS Justice Hon. W. T. Martin, the Mellon Minority Scholars Program and the NY Public Library. He served on the Center for Environmental Health, Clean and Healthy New York, the Louis E. Burnham Fund, the West Harlem Development Corporation, and Friends of the Earth USA and was the recipient of the 2010 Earth Day New York Award and the 2018 Marshall England Memorial Public Health Award. He assisted in the passage of a number of environmental justice laws, from lead paint regulations to emission reductions targeting climate change. He advocated at City Hall and the State Capitol, and testified before Congress about the health risks of climate change. He helped run summer basketball teams for neighborhood youth and mentored formerly incarcerated teens through the Friends of Island Academy.",
    "lat": 40.8233663,
    "long": -73.947191,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202145",
    "coname": "Lewis A. Fidler Way",
    "location": "Avenue R and Haring Street, Brooklyn, NY",
    "reason": "Lewis A. Fidler was a Council Member who represented the 46th District in Brooklyn, New York. While he served at the Council, he chaired the Youth Services Committee and served as assistant majority leader under Speaker Christine Quinn. He was president and chairperson of Hillel Foundation of Brooklyn, president of Brooklyn Division of American Jewish Congress, chairperson of the Wyckoff House Neighborhood Advisory Board, board member of the B’nai Brith Metro North Region and Community Advisory Board Member of the Fenichel House Home for Disabled Adults. He also was the Democratic State Committeeman and District Leader of the 41st Assembly District and Chairperson of Community Board 17.",
    "lat": 40.6082274,
    "long": -73.9423625,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202146",
    "coname": "Mary “Mary C” Cali-Dalton Way",
    "location": "Cedar Grove Avenue and Milbank Avenue, Staten Island, NY",
    "reason": "Mary “Mary C” Cali-Dalton attended Bishop Kearney where she graduated in 1971 and spent her early years performing as a singer in a band called \"The Underground Railroad\" where her and her friend Maryanna performed a different variety of genres of music including Rock, Jazz and Disco. They were based in Brooklyn and Manhattan and performed at bars in the neighborhood and venues for parties and weddings. In 2002, she moved to New Dorp Beach and instantly fell in love with the neighborhood and was widely known throughout her neighborhood and community. When New Dorp Beach was hit by Hurricane Sandy in October 2012, although a victim herself of the storm, she worked tirelessly to make sure her neighbors and co-workers who were also affected did not go without help. She set up clothing and food donations within the Recreation Centers on the island and helped set up housing situations for those who had lost their homes. She joined the New York City Parks and Recreation in 1999 as a WEP participant and is recognized as a true success story for the Parks Department. In 2000, she was promoted to a Playground Associate and 5 months later, was promoted to a Recreation Specialist position. In 2002, she was promoted to Borough Director of Recreation. She was Chief of Recreation for Staten Island from 2003 until 2019 and was nicknamed \"The Chief of Magic.\" She was Vice President of the Emerald Society in 2006 and became President of the Emerald Society in 2009 until her passing in 2019. Mary dedicated herself to everything she did in her life and she juggled many plates. No matter the situation at hand she always faced it with a smile and a coffee in hand for back up. She had the ability to make anyone laugh even through the toughest times. She had a hand in so many things in our community between the parks department and outreach for people struggling with addictions. Mary had struggled with alcohol addiction herself and was 20 years sober to the date of her death.",
    "lat": 40.5604738,
    "long": -74.1012466,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202147",
    "coname": "Floyd H. Flake Boulevard",
    "location": "Merrick Boulevard, Queens, NY",
    "reason": "Rev. Floyd H. Flake is a former member of the United States House of Representatives serving from 1987 to 1997, former president of Wilberforce University and senior pastor of the Greater Allen African Methodist Episcopal Cathedral. Greater Allen African Methodist Episcopal Cathedral has become one of the nation’s foremost Christian churches and is listed among the top twenty churches in America in Outreach Magazine’s Annual Survey. He also authored a best-selling book called, The Way of the Bootstrapper: Nine Action Steps for Achieving Your Dreams, and the, African American Church Management Handbook. In Congress, he funded the Nation’s first One Stop Small Business Capital Center which is the model for additional centers that are now operating in the Federal Empowerment Zones and provides technical assistance and loans to small businesses.",
    "lat": 40.6837389,
    "long": -73.769544,
    "year": "2021",
    "group": 3
  },
  {
    "id": "202148",
    "coname": "David F. Bluford Way",
    "location": "178th Place and Murdock Avenue, Queens, NY",
    "reason": "David Franklin Bluford served in the U.S. Army during the Korean War, and earned an honorable discharge. Upon completing his undergraduate studies at Fayetteville State University in North Carolina, he earned a Masters of Arts from CUNY Hunter College, as well as certifications for Advanced Study in Education at Columbia University and St. John’s University. He later served as an Assistant Superintendent and Junior High School Principal in East Harlem’s Community School District 4, and a middle school teacher in Brooklyn’s Community School District 23. His history as an administrator included stints as director of the Upward Bound college preparatory program at CUNY Queens College, and adjunct professor of educational administration at CUNY Brooklyn College and St. John’s University. Locally, he served on the Board of Directors of the Queens Urban League, and as Chairman of the Alpha Phi Alpha Senior Center and Community School Board 29 in Southeast Queens. His personal affiliations also include the Jamaica NAACP branch, Freemasons, and Alpha Phi Alpha Fraternity, Inc. He received many awards, such as Outstanding Educator, Jamaica Branch of the NAACP, the Jackie Robinson Junior High School Man of the Year Award, The Distinguished Citizens Service Award and the Community Service Award.",
    "lat": 40.6952236,
    "long": -73.7718677,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202149",
    "coname": "Priscilla Carrow Way",
    "location": "98th Place and 57th Avenue, Queens, NY",
    "reason": "Priscilla Carrow was a community activist and public servant who dedicated her life to the East Elmhurst/Corona community. She worked with the New York State Department of Labor and the New York State Senate. In 1994, she worked for the New York City Health and Hospitals/Elmhurst. She was a member of the Communications Workers of America Local 1180 since 2006, was a Senior Shop Steward in her Union and was a long time member of Queens Community Board 4. She served as Executive Director for the Lefrak City Youth and Adult Activities Association and Program Director for the Kenny Anderson Basketball Classic to assist in encouraging healthy sports activities and opportunities for all ages. She served as a Delegate for the 11th Judicial Convention and County Committee person of the 35th Assembly District, Queens County. She also served as the chairperson of the National Council of Negro Women/Empress Life Members Guild, secretary for the Better Community League (BCL), member of the Ericsson Street Block Association 27th & 29th Avenues, the Fredrick Douglas Democratic Association, a member of the Corona East Elmhurst N.A.A.C.P., Friends of the Queens Library, chair of EHC Sports and Recreation Committee, You Can Go To College Committee, Co-Founder/Vice-President of the Democratic Association of the 21st Century Club,  Sherwood Village Tenant Association President, member of First Baptist Church and received numerous awards from various civic organizations and elected officials. Her latest award from the late New York State Senator Jose Peralta who presented her with the 2015 Woman History Month Award in recognition of her Outstanding Community Service. She died of complications from COVID-19.",
    "lat": 40.7379575,
    "long": -73.8614235,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202150",
    "coname": "Lorena Borjas Way",
    "location": "83rd Street, Queens, NY",
    "reason": "Lorena Borjas was born in Veracruz, Mexico in 1960 and came to the United States in 1980. She became an advocate for the LGBT Community and inspired many people. She made sure people were treated fair and justly whether it be at health clinics or courthouses. In 2012, she co-founded the Lorena Borjas Community Fund and was actively involved in many organizations including the Latino Commission on Aids, AIDS Center of Queens County, Hispanic AIDS Forum, the Latino Commission on AIDS and she became a counselor for the Community Healthcare Network's Transgender Family Program, where she worked to obtain legal aid for victims of human trafficking. She died of complications from COVID-19.",
    "lat": 40.7413989,
    "long": -73.8816969,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202151",
    "coname": "Vera E. Thompson Way",
    "location": "94th Street and Astoria Boulevard, Queens, NY",
    "reason": "Vera E. Thompson was a dedicated Funeral Director in East Elmhurst who opened the Vera E. Thompson Funeral Home On January 26, 1955 and continued to serve the community for over 50 years while providing comfort to hundreds of family’s during their time of loss. She became the first African-American female Funeral Director in the history of Queens as she made her career in a then male dominated industry while balancing her profession and raising five children. She was a devoted catholic and standing member of the St. Gabriel Catholic Church and school where she raised her children. Her name and business graced Astoria Blvd along 94th Street for five decades as she became a true staple in the community.",
    "lat": 40.76292970000001,
    "long": -73.8752919,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202152",
    "coname": "Lamont “Big L” Coleman Way",
    "location": "140th Street and Malcolm X Boulevard, Manhattan, NY",
    "reason": "Lamont “Big L” Coleman was an American rapper and songwriter from Harlem who was considered one of the greatest rappers of all time. He was known amongst underground hip-hop fans for his freestyling ability and eventually signed to Colombia Records. He was killed by an unknown assailant in 1999 and since then, many tributes have been given to him by The Source magazine and a mural was constructed in his honor at 140th Street and Malcolm X Boulevard. The mural attracts over 4,000 visitors each year.",
    "lat": 40.8173232,
    "long": -73.9386045,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202153",
    "coname": "Calle Frenchie",
    "location": "Marcy Avenue and Broadway, Brooklyn, NY",
    "reason": "Santos “Frenchie” Ramos grew up in Puerto Rico and later came to New York in his 20’s. When he was 36 years-old, he opened Frenchie’s Gym in Williamsburg and remained open for 43 years, helping kids stay off the streets and away from drugs and gang violence. He also was a referee at the first WrestleMania.",
    "lat": 40.7084091,
    "long": -73.95791609999999,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202154",
    "coname": "Antoinette Ali-Sanders Way",
    "location": "Beach 17th Street and Seagirt Boulevard, Queens, NY",
    "reason": "Antoinette Ali-Sanders was a 3rd generation college graduate. She worked to improve the society as a community developer, organizer, and scholastically trained as a Landscape Architect, with a minor in Civil Engineering. She was one of the first Black women, to graduate in Landscape and Architecture from Rutgers University in New Brunswick, NJ. She worked for the NYC Parks Department for 35 years. As a Parks employee, she worked with the first group of women out in the field in 1981. While working for the Parks Department, she prepared contract drawings and documents, inspected, monitored, managed and supervised the construction of parks, playgrounds, structures, and the restoration of monuments. She founded a construction company called Metro Skyway Construction, a foundation for PEACE (Progressive Economics and Cultural Enrichment) and a trade union Jersey City Monitoring Trade Association. She worked closely with Rev. Al Sharpton, Mayor Dinkins and Dr. Fulani where she became a member of the Committee for Independent Community Actions. One of her last architectural projects was for a Pan African activist named Queen Makkada who was planning to build a school in Africa. She was given the honorary title of Lady Jamilah before her passing.  She also hosted a cable access show promoting fairness and equal opportunities in education and wellness in the black community and was a member of the Association of Black Educator of New York.",
    "lat": 40.5952283,
    "long": -73.7512564,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202155",
    "coname": "Chanta Howard Way",
    "location": "Hassock Street and Beach Channel Drive, Queens, NY",
    "reason": "Chanta Monique Howard served as president of Redfern Housing Advisory Board, served as manager of the Stack Angels Dance group, co-founded the Rockaway Female Softball league and she was a strong pillar for the NYCHA Redfern Housing Development. She organized barbeque events and offered free school supplies for students. She assisted in founding multiple organizations. She founded the Redfern’s Fallen Angels, an event where hundreds of residents gather in the middle of Redfern and honor former residents of Redfern that have lost their lives to gun violence or sickness. She organized the It Takes a Village to Raise a Child event to honor all the seniors in the development by providing certificates labeled as Redfern Heroes.",
    "lat": 40.6094937,
    "long": -73.75366799999999,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202156",
    "coname": "Benjamin Wright Way",
    "location": "158th Street and 140th Avenue, Queens, NY",
    "reason": "Benjamin Wright Jr. moved to New York City in 1950. He was employed by the City of New York for twenty-seven years, retiring as Assistant Deputy Commissioner of the Department of Homeless Services (DHS) in 1996. After retirement, he founded Green World Unlimited, Inc., located on Wall Street where he served as Chairman. He then spent the rest of his life organizing Southeast Queens and working with community based organizations. He served as president of the Southeast Queens Democratic Club, president of the Thurgood Marshall Regular Democratic Club, chairman of the board of the S.G.G.C. Community Service Agency, and afterschool service program which includes tutoring and free meals five days a week, was a lifelong member of the NAACP and was a board member as the treasurer of the Jamaica Branch, was a board member of the United Black Men of Queens where he served as vice president and treasurer, was a member of the Advisory Board of the Emblem Health Insurance Plan, was a member of the of the York College Community Advisory Committee, served on Community Board 12, was a member of the administrative board of the Springfield Gardens United Methodist Church and served as administrator of a GED Program for Adolescents in the Riker’s Island Correctional Institution for Women.",
    "lat": 40.669334,
    "long": -73.776997,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202157",
    "coname": "Jules Taylor Way",
    "location": "232nd Street and Edgewood Avenue, Queens, NY",
    "reason": "Jules Taylor, Jr. was born in Port-au-Prince, Haiti and later moved to the United States. He began his career in Human Resources and worked in various positions over the course of his more than 30-year career. His last position was at East Side House Settlement in the Bronx as their Human Resources Manager. After settling in Rosedale, Queens, NY, he became active with the JFK Rotary Club, and served as president from 2008 until 2010. As president, he assisted in helping the biggest fundraiser for the JFK Rotary Club, the “5K Runway Run” go from 150 runners to 1,500 runners and from $10,000 to $40,000 in 5 years. In addition, he served as president of the Brookville Park Tennis Club where he was instrumental in securing a brand new tennis court for the club. He was also served on the Board of the Rosedale Civic Association, Inc. for many years, where he held the positions of second vice-president and co-chair of the fundraising committee. He died of COVID-19.",
    "lat": 40.6618406,
    "long": -73.7461852,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202158",
    "coname": "Harry T. Burleigh Place",
    "location": "East 16th Street and 3rd Avenue, Manhattan, NY",
    "reason": "Henry “Harry” Thacker Burleigh was a baritone singer, composer and arranger. Born in Erie, Pennsylvania, he later became the first African-American soloist at St. George’s Episcopal Church of New York, a position he held for over 50 years. He also became the first African-American chosen as a soloist at Temple Emanu-El, a synagogue. He also worked as an editor for G. Ricordi, a music publisher. Several of his compositions were published, including Ethiopia Saluting the Colors, Jubilee Songs of the USA and Deep River, his most memorable composition. He was a charter member of the American Society of Composers, Authors and Publishers (ASCAP) when it was established in 1914 and became a member of its board of directors in 1941. He received numerous awards, including the Spingarn Medal in 1917 and also received honorary degrees from Atlanta University and Howard University for his contributions as a vocalist and composer.",
    "lat": 40.73461820000001,
    "long": -73.986211,
    "year": "2021",
    "group": 3
  },
  {
    "id": "202159",
    "coname": "Walther Delgado Way",
    "location": "207th Street and Post Avenue, Manhattan, NY",
    "reason": "Walther Delgado was born in the Dominican Republic and migrated to New York City when he was 11 years-old. He saw a neighborhood, Washington Heights, with so much promise but plagued with inequality and lack of access to basic resources like education, housing and economic development. He made it his life mission to fill the gap through community actions by leading from the front and engaging Washington Heights' best resource; its people. He was on the steering committee that founded both Alianza Dominicana and the Audubon Partnership. If not for his contribution, Alianza Dominicana would not have been the agent for change that it was for the community in the 1990’s. Alianza Dominicana offered the first drug treatment program in the neighborhood, access to immigration lawyers, and so much more. The majority of his efforts, however, were spent on launching the Audubon Partnership based in Inwood, which allowed residents of Washington Heights and Inwood access to development services through lending and business advocacy classes. His goal was to teach residents how to help themselves, so that immigrants could create a fruitful, sustainable, and equitable livelihood. In 1998, the federally financed Upper Manhattan Empowerment Zone provided his organization with a $750,000 revolving loan to fund commercial development within Community Board 12. As a result, many small businesses were begun which still function today. From 1998 until 2002, he served on the community board and eventually as the board Chair.  In 2003, he helped create Sherman Creek Park.",
    "lat": 40.8648123,
    "long": -73.919394,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202160",
    "coname": "Victor Victor Way",
    "location": "176th Street and Fort Washington Avenue, Manhattan, NY",
    "reason": "Victor José Victor Rojas was born in Santiago de los Caballeros. His professional life began in 1972, with the authorship of La Casita (The Little House), which he sang with Wilfrido Vargas. This piece became such a great success that it inspired the budding author to launch his career as a performer and composer, work that kept him busy for the rest of his life. In the 1970s, his dissatisfaction with domestic politics and economic policies in the Dominican Republic, added to increasing international turmoil, inspired him to write songs with social and political content as his aesthetic compass. Mr. Víctor also took part in the movement opposed to the Dominican dictator Rafael Trujillo, and he began to write protest songs. As a young man he traveled the country as part of youth groups protesting the government while receiving an education in local rhythms. Between 1973 and 1978, he founded and led the group Nueva Fortuna, with which he traveled all over the country. In 1978, he created the group Flamboyán, through which he projected his music as a sample of rhythmic intermixing. For five years he shared the stage with the most important figures of the Latin American song and performed in Puerto Rico, Venezuela, Cuba, the United States and Italy. Victor Victor studied the musical roots of merengue and bachata, recreated the genre and enriched it. Successes such as “Mesita de noche”, “Ando buscando un amor” y “Así es mi amor” were made with simplicity and beautiful metaphors and have been performed by leading Dominican and foreign vocalists. In 1990, he released his fourth album, entitled “Un chin de veneno”, which was an international success. It succesfully fuses Caribbean rhythms in a new style. Victor Victor has to his credit the long-running albums entitled “Álbum rojo”, “Flamboyan”, “Con sus flores y sus vainas”, “Cotidiano”, “Artistas por la paz”, “Inspiraciones”, “Tu corazón” y “Alma de Barrio”. In 2007, he recorded the social-themed album “Verde y negro” as a tribute to the freedom fighters of the Dominican Republic. Victor died of COVID-19 at a hospital in Santo Domingo at age 71. The artist was awarded the Awards: Premios A Lo Nuestro, Aplauso 92, Ronda, ACE, Aplauso 98, ASCAP and ONDA. Victor Victor remains a beloved and influential artist for hundreds of thousands of Dominicans in New York City.",
    "lat": 40.84722989999999,
    "long": -73.9397819,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202161",
    "coname": "Miguel A. Melenciano Way ",
    "location": "Broadway and 213th Street, Manhattan, NY",
    "reason": "Miguel A. Melenciano was a renowned communicator and supervisor of the Central Electoral Board (JCE) in the United States. Many personalities of the Quisqueyan community in the City, including politicians, professionals, journalists, businessmen, artists, community members, winemakers, taxi drivers and ordinary citizens have lamented his death. He was a good communication and legal professional. He excelled as a JCE official during the 2004, 2008, 2010 and 2016 elections and was later transferred to the headquarters of that body in New Jersey, where he was appointed to supervise in all the states of the aforementioned constituency, which includes Canada. He was also financial and marketing manager of the Association of Winemakers of the United States (ASOBEU), where he did administrative work and began his first steps in media communication in the program \"Enlace\" that he produced and co-led with a reporter and Elías Barreras Corporán on a radio station and channel 35 of Time Warner Cable. He collaborated with several national media including El Nuevo Diario, and was one of the first publishers on the European platform Globedia. The three of them ventured as pioneers of one of the first community FM radio stations that broadcast from CULTURARTE on Audubon Avenue in Upper Manhattan. He worked for years in the public relations team of the entertainment entrepreneur Félix Cabrera, with whom he organized the deliveries of turkeys on Thanksgiving Day and toys to poor children at Christmas. He was part of the organization and assembly of large shows staged by the JCE at the United Palace Theater in Upper Manhattan, stages in New Jersey, Florida and Puerto, to attract the Dominican vote abroad with great success. He was currently the co-anchor of the program \"El Show de Carlos de La Vega\", which is broadcast on Super Canal from 9:00 to 10:30 at night. His most recent media project was the newspaper \"El Nacional USA\" in digital and printed editions. He was also working with businessman Carlos Gómez and other leading figures in the Dominican diaspora in New York, being a business advisor and aspiring candidates for elective positions.",
    "lat": 40.86892,
    "long": -73.9175552,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202162",
    "coname": "Healthcare Heroes Way",
    "location": "West 168th Street, Manhattan, NY",
    "reason": "This co-naming honors the thousands of dedicated medical and nursing professionals, EMT’s, social workers, administrators, custodial and food service staff, volunteers and others vital to the continuity of care during the COVID-19 pandemic, especially those at New York Presbyterian/Columbia University Irving Medical Center.",
    "lat": 40.8394861,
    "long": -73.9360329,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202163",
    "coname": "Hon. Vito J. Titone Way",
    "location": "Hyatt Place and Central Avenue, Staten Island, NY",
    "reason": "Hon. Vito J. Titone served as an Associate Judge of the New York Court of Appeals from 1985 to 1998. He taught law at Staten Island College and also St. John’s. He ran for the State Senate twice unsuccessfully but was elected to the State Supreme Court on Staten Island in 1969. Governor Hugh L. Carey named him to the Appellate Division in 1975. Staten Island Legal Services holds an annual Hon. Vito J. Titone Awards Luncheon celebrating individuals and programs that improve the quality of life for all Staten Island residents.",
    "lat": 40.642378476,
    "long": -74.0770704,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202164",
    "coname": "Coach John Tobin Corner",
    "location": "Oakland Avenue and Nutly Place, Staten Island, NY",
    "reason": "John Tobin was an athlete, coach, and administrator, who was also considered to be one of the founders of modern interscholastic track on Staten Island. He was a Staten Island Sports Hall of Famer, Advance Service Award recipient, founding president of Board of Trustees of New World Prep Charter School. He was a high school principal, administrative superintendent, assistant to three Chancellors of the former New York City Board of Education and vice president of the Siemens Foundation. He coached cross country, track and field at St. Peter’s, Port Richmond and Tottenville where he led his teams to many championships. His Tottenville team of 1982 holds the record for scoring the most points in New York City PSAL outdoor track and field championships with over 240 points. He was active with Staten Island Track, Running and Community, a member of the Staten Island Catholic Regional strategic planning committee, a member of the Ancient Order of Hibernians and a member of the Board of Advisors for the Gateway to Higher Education Program at CUNY’s City College.",
    "lat": 40.6265547,
    "long": -74.109403,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202165",
    "coname": "Nurse Patricia Mary Farrington Way",
    "location": "Prospect Avenue and Pendleton Place, Staten Island, NY",
    "reason": "Patricia Mary Farrington was the founder and executive director of Pax Christi Hospice who offered comfort and compassion to patients facing their last days of life. She attended St. Joseph’s of Yorkville Elementary School and St. Jean Baptist High School before going on to attend the former St. Vincent’s Nursing School in West Brighton in 1969. She earned her Bachelor of Science degree in nursing at C.W. Post College in Brookville, N.Y. and held a Master of Science degree in nursing from Wagner College. In 1988, she founded and became the executive director of Pax Christi Hospice at the former St. Vincent’s Hospital. She was named a 2003 Staten Island Advance Woman of Achievement. She was on the boards of the American Cancer Society, Meals on Wheels, the Staten Island Zoo and the Alzheimer’s Association. She was honored by the Deputy Borough President, the Richmond University Medical Center and the CEO of the Sisters of Charity Healthcare System for her work.",
    "lat": 40.6396059,
    "long": -74.0920782,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202166",
    "coname": "Educator & Athlete Arnold Obey Way",
    "location": "Jersey Street and Crescent Avenue, Staten Island, NY",
    "reason": "Arnold Obey was a long-time educator and a pillar in Staten Island’s sports community starting from when he starred on Wagner College’s basketball team in the mid-1960s.  He grew up in the Bronx and helped lead DeWitt Clinton H.S. to a 38-1 record, two public school city championship games and one city title between his junior and senior years. He went on to a Hall of Fame career at Wagner, starting three years for the Seahawks and leading them to a 54-29 record during his tenure. He scored 1,018 career points on Grymes Hill. He became the boys’ varsity basketball coach at Staten Island Academy. He was a Drug Awareness Teacher during his tenure. He was an Assistant Principal at PS 16 in Tompkinsville in the mid-1980s and later became principal at PS 31 in New Brighton. He ran the night center at PS 18 in West Brighton for several years. The Brighton Kiwanis Club honored him by naming a race after him in 2017 when the club held the Arnold Obey/Armed Forces Day 5K Run. The fundraiser helped collect funds for Staten Island’s high school track & field teams. He was the recipient of numerous awards, specifically by Lifestyles for the Disabled of Staten Island for his leadership and dedication. He was also recognized by the Brown Bombers.",
    "lat": 40.6425707,
    "long": -74.0865426,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202167",
    "coname": "Albert “Al” Quinones Way",
    "location": "Avenue St. John and Kelly Street, Bronx, NY",
    "reason": "Albert Quinones was born on Avenue of St. John in the South Bronx. He attended St. Anselm’s Grammar School, Rice High School in Harlem, and the Borough of Manhattan Community College. He was a community and cultural activist who kept Playground 52 and Latin Jazz alive in the South Bronx. The late 1970’s was a pivotal time for Alberto as he witnessed his childhood neighborhood burning and suffering neglect. In May 1980, he and three others founded 52 People for Progress, Inc. Now, 39 years later, over 250,000 hours of volunteer work, 52 People for Progress have created one of the best playgrounds in the South Bronx. Playground 52 is a living testament to Al’s vision through a philosophy of community service, leadership development, empowerment, brotherhood, and caring, while providing access to world class music, culture and the arts. His other accomplishments in the South Bronx include the opening of Rainey Garden in 1984, and in 1989, the opening of Demera/Santiago Garden on Avenue St. John and Kelly Street. In 1990, the Miranda Theater was inaugurated and gave life to the 52 Latin Jazz Concert Series. Since then, over 200 concerts have been performed there, showcasing the talents of Johnny Pacheco, Conjunto Clasico, Tito Nieves, Manny Oquendo and Libre, and nine-time Grammy-award winner, Eddie Palmieri, among others. The success of 52 People for Progress, Inc. has to do with the many partners involved in realizing the dream. It has taken the effort of city-wide agencies, the community at large and the city with the leadership, passion and tenacity of Mr. Quinones.",
    "lat": 40.8152948,
    "long": -73.90260669999999,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202168",
    "coname": "Heidi Hynes Way",
    "location": "East 178th Street and Mapes Avenue, Bronx, NY",
    "reason": "Heidi Hynes graduated from Fordham University in the Bronx. She joined the Friars of Atonement's mission in Jamaica before returning to the Bronx. She participated in her community, in her parish, on the street, in civic organizations as a leader and advocate, agitator of the status quo and problem-solver with openness and humility. She served as the executive director at the Mary Mitchell Family and Youth Center in the Crotona neighborhood of the Bronx for many years and managed to secure funding to keep the doors open and start new programs and initiatives even during the austerity of recession. As executive director, she expanded programming to including after school programs, GED, sports, dance, music and youth employment initiatives. She started a farmer’s market and community garden to provide healthy foods for the community and launched a food delivery service that distributed healthy produce to low-income households. She also started a Safe and Healthy Neighborhood Campaign to address gun violence and helped create Bronx Peace Action to oppose the Iraq War. She was a member of the Northwest Bronx Community and Clergy Coalition, the Catholic Worker Movement and the Atlantic Life Community.",
    "lat": 40.8446523,
    "long": -73.88723519999999,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202169",
    "coname": "Rev. Wendell T. Foster Way",
    "location": "Forest Avenue and 161st Street, Bronx, NY",
    "reason": "The late Rev. Foster was a trailblazer well known for his community advocacy. He was empowered to run for the City Council by the indifference of the political leaders before him. After numerous attempts, he led a successful campaign empowered by the African-American community’s support. In 1978, he became the first African-American from the Bronx to hold any political office. This historic achievement marked the start of diversity among Bronx political and government representation. As the former Council Member of District 16, he responded to the “Burning of the Bronx,” by creating low-income homeownership opportunities in Highbridge and expanding parks and open space throughout his district. He served as Council Member for 24 years before passing the reign onto his daughter, Helen Diane Foster. His retirement from the City Council allowed him to dedicate his time fully to the congregation of Christ Church UCC.  As their Pastor, he offered powerful sermons that encouraged worshippers to become more engaged in their spiritual and civic duties. He would serve in this role for 40 years before he became Pastor Emeritus.",
    "lat": 40.82138399999999,
    "long": -73.9048653,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202170",
    "coname": "Union Grove Missionary Baptist Church Way",
    "location": "East 172nd Street and Hoe Avenue, Bronx, NY",
    "reason": "Founded on October 23, 1946, by the late Reverend Jeremiah Crawford, Union Grove Missionary Baptist Church (UGMBC) has served thousands of New Yorkers of all backgrounds, age and race. From a membership of 13 at its original location at 221 East 98th Street, UGMBC has grown into one of the most respected members of the community in the Bronx, where they currently operate at 1488 Hoe Avenue, and the City. Currently under the leadership of Reverend Frederick Crawford, the third generation of the Crawford family to pastor at UGMBC, Union Grove continues to carry out many of the community service programming created under Rev. Jeremiah Crawford. Leaned upon by community leaders and elected officials alike, UGMBC has served as a critical partner to enhance the quality of life of New Yorkers. UGMBC’s congregants have spearheaded numerous volunteer opportunities to serve the community beyond the walls of the parish. For those less fortunate, UGMBC runs food distribution programs and organizes an annual winter coat program that collects warm clothing to distribute to members of the community. During the warmer months, UGMBC organizes outdoor community events to give neighborhood youth a safe place to enjoy and play.",
    "lat": 40.8337469,
    "long": -73.8888161,
    "year": "2021",
    "group": 3
  },
  {
    "id": "202171",
    "coname": "Reverend Dr. Henry Bolden Boulevard",
    "location": "Elton Avenue and East 156th Street, Bronx, NY",
    "reason": "Reverend Dr. Henry Bolden was born in Bluston, South Carolina. He eventually left South Carolina to pursue God’s calling at Grace Baptist Church in Detroit, Michigan, under the pastorate of Rev. F.R. Robinson. Three years later, due to the sudden transition of Rev. Robinson, Rev. Bolden was elected to pastor. He then moved to the Bronx where he united with Greater Zion Baptist under the pastorate which he shared with Rev. Dr. Charles Britt. In the Bronx, his skills and gifts made room for him as he preached across the country for many years. In 1962, he became pastor of the New Tabernacle Baptist Church. After six years at New Tabernacle Baptist Church, he left to become the founding pastor of his lifelong church, the Greater Eternal Baptist Church, located in the South Bronx, 1969. During his time at Greater Eternal Baptist Church, he taught, licensed and ordained countless individuals into the two offices of the gospel ministry. He ordained Mount Lebanon Baptist Church’s pastor, the Reverend James Morrison, as well as the Reverend Leon Davis and the Reverend Daniel E. Kelley, Jr., among others. He was also a lifetime member of the National Baptist Convention, the Baptist Ministers Conference of Greater New York and the Baptist Ministers Evening Conference of the Bronx, of which he was a founding member. At the commemoration of his 50th year of as a pastor, the National Baptist Convention honored him for his five decades of service to God and the community.",
    "lat": 40.8204033,
    "long": -73.91397309999999,
    "year": "2021",
    "group": 3
  },
  {
    "id": "202172",
    "coname": "Frederick ‘Fred The Godson’ Thomas Avenue",
    "location": "Leggett Avenue and Kelly Street, Bronx, NY",
    "reason": "Frederick ‘Fred The Godson’ Thomas was a DJ and rapper from the South Bronx.  He first broke into the rap scene with his 2010 mixtape, \"Armageddon,\" with features from Busta Rhymes and Waka Flocka Flame and was named a part of the best emerging hip-hop talent in XXL Magazine’s freshman class in 2011, alongside present-day rappers Kendrick Lamar, YG, Meek Mill, Lil B and the late Mac Miller. On April 23, 2020, he died of COVID-19. He also recorded with Kevin Gates, Diddy, Meek Mill, Jadakiss, The Game, Fat Joe, Raekwon, Pusha-T, French Montana, Erick Sermon, Keith Murray and many more. He appeared on the “25/8 (Remix)” from the Queen of Hip-Hop Soul, Mary J. Blige. YouTube videos in which Fred The Godson appears or performs as a featured artist have been viewed over a combined fifty million times. On datpiff, his mixtapes have been downloaded over a million times and streamed over twelve and a half million times to date. A staple on the New York hip-hop scene, he frequently appeared on radio shows on Hot 97 with Funkmaster Flex as well as DJ Enuff, The Breakfast Club on Power 105, and Sway In The Morning on Sirius Radio. His last studio effort, the mixtape “Gordo” featured New York artists, such as Dave East, Jim Jones, Joelle Ortiz, Vado and Jaquae has been streamed over three million times and downloaded over thirty thousand times to date.  His last freestyle video with Hot 97’s Funkmaster Flex has a combined 15 million views with over two hundred and fifty thousand shares on social media. His music will inspire future generations.",
    "lat": 40.8158701,
    "long": -73.900472,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202173",
    "coname": "Pastor Marie C. Norwood Way",
    "location": "Bronx Park South and Mohegan Avenue, Bronx, NY",
    "reason": "Pastor Marie C. Norwood joined the Gospel Temple Church of God in Christ in 1952 and served as a missionary and charity board worker for over nine years. She then served was an Evangelist in the Deliverance Evangelistic Center for over a decade. She then founded the Bronx Deliverance Center of Faith Church. She was also the Executive Director of Carroll M. Christian Day Care Center, Director of Louis Irby After School Center, Founder and Director of the Bronx Christian Business Women Association, member of the Council of Churches of New York, a member of the Bronx Shepherds Restoration Inc., Executive Board Member of the Interdenominational Women’s Conference, President of the Bronx Chapter of the IWC and served on the Community Board.",
    "lat": 40.8472391,
    "long": -73.88199949999999,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202174",
    "coname": "Carl Reiner Lane",
    "location": "Arthur Avenue and 188th Street, Bronx, NY",
    "reason": "Carl Reiner was an actor, comedian, director, screenwriter, and author whose career spanned seven decades. He was part of Sid Caesar’s legendary team and went on to create “The Dick Van Dyke Show” and direct several hit films. He was born in the Bronx and graduated from high school at 16 and worked as a machinist while studying acting. He served the United States Army during WWII and later began his acting career. In 1995, he received the Writers Guild’s Laurel Award, a lifetime achievement award for a career in TV writing. In 2000 he won the Mark Twain Prize for Humor, presented by the Kennedy Center. In 2009 he was presented with the WGA’s Valentine Davies Award, recognizing both his writing legacy and valued service to the guild, the entertainment industry and community at large. He authored several memoirs and novels, including a sequel to “Enter Laughing,” “Continue Laughing,” “My Anecdotal Life” and “I Remember Me.”",
    "lat": 40.85642989999999,
    "long": -73.8868179,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202175",
    "coname": "Anne Bancroft Way",
    "location": "Arthur Avenue and 188th Street, Bronx, NY",
    "reason": "Anne Bancroft was born in the Bronx and became an actress, director, screenwriter and singer. Through her career she received an Academy Award, three BAFTA Awards, two Golden Globe Awards, two Tony Awards and two Primetime Emmy Awards. She is also one of 24 thespians to achieve the Triple Crown of Acting. She was well known for her acting roles in The Graduate, The Turning Point and Agnes Of God.",
    "lat": 40.85642989999999,
    "long": -73.8868179,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202176",
    "coname": "Joseph Migliucci Way",
    "location": "Arthur Avenue, Bronx, NY",
    "reason": "Joseph Migliucci was the fourth generation of the venerable Migliucci family of chefs and restaurateurs who opened Mario’s Pizzeria in 1919 at 2342 Arthur Avenue in the Little Italy section of The Bronx. Joseph was the son of Mario and Rose, grandson of Giuseppe and great grandson of Scolastica whom collectively guided Mario’s from a small pizzeria to a renowned Italian eatery patronized and beloved by multiple generations of customers. His parents urged Joseph to higher education and a professional career. While studying engineering in college he decided on a different course and left to join the family business. Joseph brought boundless energy, superior technical and mechanical skills and love for people, food and life to the restaurant. He learned all facets of the business: cooking, prepping, cleaning, repairing, purchasing, serving, hosting, marketing and finances. Trained by Mario and uncle Clemente, Joseph became both a world class chef and master pizza maker of Mario’s signature thin crust Neapolitan style pies for which it remains famous. Generations of customers fortunate enough to eat a Joseph made pie attest that no one did it better. Far beyond preparing meals, Joseph touched countless individuals though his acts of love, kindness and friendship. Employees struggling with all kinds of life’s obstacles, customers seeking comfort or advice, fellow businessmen needing assistance, friends needing help - or bail – and the ‘down and out’ fighting addiction needing guidance or a second chance, found it from Joseph. With a gentle heart, large frame and even bigger hands, he provided compassion to his fellow man so many times that the touching expressions of tribute arising from his sudden departure are far too many to list. Joseph displayed his generosity to the end. In his final days of life at the hospital as his condition deteriorated, he chose his fate and told the night nurse “…give the ventilator to somebody else who needs it…” Even in these trying times, true to his nature, he managed to touch the lives of those around him. He died of COVID-19.",
    "lat": 40.8534729,
    "long": -73.88938019999999,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202177",
    "coname": "Teitel Brothers Lane",
    "location": "Arthur Avenue and 186th Street, Bronx, NY",
    "reason": "Teitel Brothers Wholesale and Retail Grocery Company is located at 2372 Arthur Avenue in Little Italy of the Bronx.  A third generation, family owned and operated business, Teitel Brothers offer the finest Italian imported, gourmet specialty items and the lowest retail and wholesale prices at market value. Jacob and Morris Teitel, brothers and Jewish Austrian immigrants, first arrived in America, through Ellis Island, in 1912.  Tailors by trade, the brothers assimilated to the area, people, customs and way of life.  In 1915, Jacob and Morris decided to start a new business together and opened Teitel Brothers Grocery Store.  Although the neighborhood was, predominantly, Italian, it was not uncommon to find merchants of Jewish descent.  In fact, Jacob learned to speak Italian before he learned to speak English. The family lived upstairs from the grocery store in a three bedroom apartment with five people. At the foot of the store’s entrance sits a mosaic tile Star of David.  Jacob had the Jewish Star installed during the Great Depression. Culture, religion and family values are at the heart of what makes Teitel Brothers still in business today. The store is run by Gilbert and his sons Jean, Michael, Eddie and Billy Fassbender, Eddie’s childhood friend. Teitel Brothers is open year round Monday-Saturday, 7:00am-5:30m, except for Jewish Holidays. The store is, always, stocked with the best olive oils, tomatoes, jarred and bulk olives, aged vinegars, beans, pastas, imported and domestic cheeses, baccala, prosciutto, soppressata, fresh and dried sausages, flours, rice, nuts, candied and dried fruits, cookies, panettones, and much more. For over 100 years, Teitel Brothers has catered to a vast and distinctive clientele, including neighborhood retail customers and wholesale grocery stores and restaurants spanning the tri-state area and beyond.",
    "lat": 40.8547728,
    "long": -73.88824009999999,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202178",
    "coname": "Cosenza Way",
    "location": "86th Street, Bronx, NY",
    "reason": "Cosenza’s fish market is on a very short list of family-owned businesses that have lasted for a century. The business celebrated its 100th year in business in January 2018.",
    "lat": 40.7780641,
    "long": -73.9521899,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202179",
    "coname": "Madonia Way",
    "location": "Arthur Avenue, Bronx, NY",
    "reason": "Madonia Bakery was established in the Bronx in 1918, selling traditional Italian breads and later expanding to desserts. Through its existence, the bakery has lasted through economic downturns and ownership changes. Still, the bakery draws many foodies and tourists from around the world each year.",
    "lat": 40.8534729,
    "long": -73.88938019999999,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202180",
    "coname": "Lawrence Fisk Way",
    "location": "East 2nd Street and Avenue Z, Brooklyn, NY",
    "reason": "Lawrence S. Fisk served in the United States Navy on the U.S.S. Forrestal, from which he was honorably discharged on June 1, 1966. He became an accountant working in large firms before becoming a sole proprietor. He was very involved in community activities. He founded the local chapter of the New York State Society of Independent Accountants and was a delegate to the State and National societies. He also held several offices, as well as President of the local chapter. He was an officer and active member in the Parent-Teacher Association of every school that his children attended and even ran for the school board of District 21 because he believed that a parent of a child attending the public school should have a voice in decisions being made. As a former minor league baseball player, he enjoyed being a volunteer umpire for local neighborhood groups. He served as a member of the 70th Precinct rescue squad for many years. For thirty years, he was a member of Community Board 13, where he served as a chair and was a member of various committees, such as street closing, police, fire and public safety, education, housing and zoning and land use. For several years, he was recognized for perfect attendance at board meetings.",
    "lat": 40.5865212,
    "long": -73.9675719,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202181",
    "coname": "Carmela ‘Mrs. C’ Casamento Way",
    "location": "Avenue U and McDonald Avenue, Brooklyn, NY",
    "reason": "Carmela ‘Mrs. C’ Casamento ran the Eagle Cheese Company in Gravesend, Brooklyn. She was known for her famous mozzarella cheese. She ran Eagle Cheese from 1979 until 2013. She donated food to the NYPD during the Holiday’s, donated food and clothing to the poor and donated to local charities.",
    "lat": 40.5969922,
    "long": -73.9732223,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202182",
    "coname": "Glenda Cohen Street",
    "location": "153rd Avenue and 84th Street, Queens, NY",
    "reason": "Glenda Cohen was very involved in charitable community activities. In 1960, she joined Women’s American ORT (Obschestvo Remeslenovo i. Zemledelcheskovo Trouda (Society for Trades and Agricultural Labor)). She also volunteered for Cancer Care. In the early 1960s, she became a Cub Scout Den Mother for neighborhood boys. Around 1970, she began a career as a local, Howard Beach real estate agent. Over a span of forty years, her expertise earned her the title “Queen of the Condos” by her realtor peers. She was PS 232’s first school crossing guard from 1962 until 1964.",
    "lat": 40.6663291,
    "long": -73.85034739999999,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202183",
    "coname": "Msgr. John C. Tosi Way",
    "location": "Clintonville Street and Locke Avenue, Queens, NY",
    "reason": "Msgr. John C. Tosi was a lifelong Queens resident. He was born in Flushing and attended St. Ann’s School and later went to Monsignor McClancy Memorial High School in Jackson Heights. He later studied at Cathedral College in Douglaston and Immaculate Conception Seminary in Huntington, LI. He was named a Monsignor in 1997 and also was a member of the Knights of the Holy Sepulchre. He served as an assistant at Our Lady of Grace, Howard Beach, 1973-87 and Resurrection-Ascension, Rego Park, 1987-91. In 1991, he was appointed executive secretary of the Diocesan Liturgical Commission, a position he held until 2005. In 1995, he assumed the additional duty of rector of St. James Cathedral in Downtown Brooklyn. In January 2005, he was named pastor of St. Luke’s, where he remained until his death.",
    "lat": 40.7846784,
    "long": -73.809107,
    "year": "2021",
    "group": 3
  },
  {
    "id": "202184",
    "coname": "Don McCallian Way",
    "location": "40th Street and Greenpoint Avenue, Queens, NY",
    "reason": "Don McCallian was a Sunnyside civic leader and member of Community Board 2, vice president of the NYPD 108th Precinct Community Council and former president of the United Forties Civic Association.  He was also a member of numerous clubs such as the Sunnyside-Woodside Lions Club, the Kiwanis Club, the Sunnyside Chamber of Commerce and the Sunnyside Community Services. He was a long-time parishioner at St. Raphael’s Church and was a very active volunteer at the church’s food pantry.",
    "lat": 40.739528,
    "long": -73.92512099999999,
    "year": "2021",
    "group": 1
  },
  {
    "id": "202185",
    "coname": "George S. Kaufman Way",
    "location": "35th Avenue and 36th Street, Queens, NY",
    "reason": "George S. Kaufman took over a studio lot in Astoria that was once used by the Famous Players-Lasky and the Marx Brothers in 1982. The studio was added to the National Register of Historic Places. He renamed the lot Kaufman Astoria Studios and transformed it into a full-service, comprehensive studio, including more than 500,000 square feet of soundstages. The surrounding area was revitalized becoming the Kaufman Arts District, home to the Museum of the Moving Image. Many movies and television shows were filmed on the lot including Hair, The Wiz, Goodfellas, Sesame Street and many more. He was an active member of the Real Estate Board of New York and also served on the boards of a number of philanthropic and civil organizations, such as The Whitney Museum, the Fashion Institute of Technology, Exploring the Arts and the Museum of the Moving Image. He was the Founding Chairman of the Fashion Center BID and also a Korean War veteran.",
    "lat": 40.7562576,
    "long": -73.9245044,
    "year": "2021",
    "group": -1
  },
  {
    "id": "202186",
    "coname": "Luis Alvarez Way",
    "location": "50th Avenue and Vernon Boulevard, Queens, NY",
    "reason": "Luis Alvarez was a retired NYPD bomb squad detective who died from complications of cancer linked to 9/11 related illness. He worked with other first responders during the search and rescue operation at Ground Zero. He also worked tirelessly for an extension of the September 11th Victim Compensation Fund.",
    "lat": 40.7427315,
    "long": -73.9540547,
    "year": "2021",
    "group": 0
  },
  {
    "id": "202187",
    "coname": "Tarlach Mac Niallais Way",
    "location": "49th Street and 43rd Avenue, Queens, NY",
    "reason": "Tarlach Mac Niallais was an LGBTQ activist and disability rights advocate for over three decades. He began campaigning on LGBT and Republican prisoners’ rights issues in Belfast, Ireland in the 1980’s. He later went on to participate in the protests on Fifth Avenue with the Irish Lesbian and Gay Organization in the 1990’s until recently when the Lavender and Green Alliance and other Irish LGBT groups could finally march in the St. Patrick’s Day Parade. He protested Ian Paisley’s anti-gay Free Presbyterian Church and Democratic Unionist Party and later became the formation manager of the LGBT Lavender and Green Irish group. He died of COVID-19.",
    "lat": 40.7445947,
    "long": -73.91555919999999,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202188",
    "coname": "Edward Charles “Whitey” Ford Way",
    "location": "43rd Street, Queens, NY",
    "reason": "Whitey Ford grew up in Queens and made his major league debut pitching for the Yankees in 1950 and spent his entire career with the team. He helped the Yankees win six World Series titles and 11 American League pennants in his 16 seasons. He had a career record of 236-106, setting the Yankees’ record for victories. He was the Cy Young Award winner in 1961 and was a 10-time All-Star. His 10 World Series victories are the most for any pitcher and he pitched 33 and two-third consecutive scoreless innings in World Series play, breaking Babe Ruth’s record. He also holds the record for World Series starts with 22, innings pitched with 146 and strikeouts with 94. He was inducted into the Hall of Fame in 1974.",
    "lat": 40.7601029,
    "long": -73.9147768,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202189",
    "coname": "Community Leader William L. Taitt Way",
    "location": "Vanderbilt Avenue and Roff Street, Staten Island, NY",
    "reason": "William L. Taitt was a political consultant and community liaison for many local political leaders, including Michael McMahon and Howard Golden, the former borough president of Brooklyn and for Democratic Staten Island Borough President Ralph Lamberti. He served in the Merchant Marines in 1965 and also served in the U.S. Air Force from 1969 to 1971 earning the rank of sergeant. He was a member of Occupy the Block and Get Out the Vote and served as president of Citizens Organized for Political Empowerment. He was appointed as a full voting member of the HIV Health and Human Services Planning Council of New York which established over 300 community-based programs to care for those affected by AIDS and HIV infection. He also served on the Community Board 1 and did political commentary for the television show Live and Direct on Staten Island Cable.",
    "lat": 40.6161572,
    "long": -74.08331989999999,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202190",
    "coname": "Big Punisher Way",
    "location": "Grand Concourse and West Fordham Road, Bronx, NY",
    "reason": "Christopher Lee Rios, better known as Big Pun, was a rapper from the Bronx. His album Capital Punishment reached No. 1 on the hip-R&B charts and was the first Latino solo rapper to go platinum. In his short career, he developed a substantial fan base and became a hero to the Puerto Rican community. When he died, thousands of fans attended his wake in the Bronx and a mural about him was painted on a building in his neighborhood.",
    "lat": 40.86203829999999,
    "long": -73.8969603,
    "year": "2021",
    "group": 2
  },
  {
    "id": "202191",
    "coname": "Pfc. Luke N. Gasparre Way",
    "location": "43rd Street and 25th Avenue, Queens, NY",
    "reason": "Luke N. Gasparre entered military service in 1944 and was deployed to France, where he served in the 87th Infantry Division. During that time he participated in securing the city of Metz, and fought in the Battle of the Bulge. For his service, he received seven medals, including the Purple Heart and the Bronze Star.  He was later awarded the French Legion of Honor as well. After the war, Gasparre returned to Astoria, where he started a family and took a job with the U.S. Postal Service. In 1964, he took a second job with the New York Mets at the recently-opened Shea Stadium and during his 55 years as an usher, witnessed two World Series victories, the legendary concert by the Beatles, and a visit from the Pope. Although he grew up a Yankees fan (and was once even quizzed on baseball and the Yankees to prove he was an American soldier), he became one of the most familiar, beloved faces at Shea Stadium and Citi Field.",
    "lat": 40.7668321,
    "long": -73.9092898,
    "year": "2021",
    "group": 2
  },
  {
    "id": "20110",
    "coname": "Police Officer Kenneth Mahon Place",
    "location": "East 147th Street and Southern Boulevard, Bronx, NY",
    "reason": "Officer Kenneth Mahon joined the New York City Police Department in 1968 after serving in the United States Army in the Vietnam War.  While serving as an officer, he was decorated by the department thirty-six times, including eighteen excellent police citations, ten meritorious service citations and five departmental commendations.  He was serving in the anticrime unit for the last three years until the time he was killed in the line of duty and had over 259 arrests and disarmed about fifty people.  He was killed in the line of duty while trying to apprehend a suspect in a robbery that had taken place on December 27, 1974.",
    "lat": 40.8107479,
    "long": -73.9061813,
    "year": "2011",
    "group": 6
  },
  {
    "id": "20111",
    "coname": "Richard Akbar Salahuddin Drive",
    "location": "Williams Avenue and Riverdale Avenues, Brooklyn, NY",
    "reason": "While incarcerated in the 1970’s, Richard Akbar Salahuddin brought many lawsuits against the New York State Department of Corrections such as, getting his name change recognized by the penitentiary, which he won, and other lawsuits pertaining to inmate’s rights. After completing his prison term he became active in his neighborhood and made great contributions to his community.  He became president of the Williams/Riverdale Avenues Block Association and was a strong advocate for human rights and worked to keep drug dealers off of Williams Avenue.  He was also a member of Community Board 5, ACORN and the Reverend Al Sharpton’s organization, Veterans Affairs and a legal mediator for several Muslim committees.  He also established the Summer Play Street Program on Williams Avenue.",
    "lat": 40.6626604,
    "long": -73.89736909999999,
    "year": "2011",
    "group": 7
  },
  {
    "id": "20112",
    "coname": "Harry Wieder Way",
    "location": "Forsyth Street and Rivington Street, Manhattan, NY",
    "reason": "Harry Wieder was a member of Community Board 3 (CB 3) and was an activist for gay rights and people with disabilities.  He was a member of CB 3’s Transportation Committee, as well as, Human Services, Health, Disability and Seniors/Youth and Education Committees.  He was also a member of 504 Democrats, Disabled in Action and the Coalition for a District Alternative.  He was also a member of the activist group Act-Up and was profiled in Betty Adelsen’s 2005 book entitled, “The Lives of Dwarfs: Their Journey from Public Curiosity Toward Social Liberation.”",
    "lat": 40.7210328,
    "long": -73.991483,
    "year": "2011",
    "group": 7
  },
  {
    "id": "20113",
    "coname": "University Settlement",
    "location": "Eldridge Street and Rivington Street, Manhattan, NY",
    "reason": "University Settlement was founded in 1886 and was the first settlement house in the United States and addresses the needs of over 20,000 people a year.  It provides childhood programs, mental health services, after school and day camp programs, college preparation and guidance, eviction prevention, domestic violence services, specialized programs for older adults and adult literacy classes.",
    "lat": 40.7207713,
    "long": -73.99063869999999,
    "year": "2011",
    "group": 8
  },
  {
    "id": "20114",
    "coname": "Jack Johnson Plaza",
    "location": "Lenox Avenue and 142nd Street, Manhattan, NY",
    "reason": "Jack Johnson was an American boxer, the second African-American boxing champion and the first African-American world heavyweight boxing champion. He was inducted into the Ring Boxing Hall of Fame in 1954 and the International Boxing Hall of Fame in 1990. He was also known for being the first celebrity athlete appearing regularly in the press, radio, and movies. He was also a connoisseur of Harlem night life and opened his own club called Club Deluxe at 142nd Street and Lenox Avenue.  In 1910, Congress passed the Act of June 25, 1910 known as the “White Slave Traffic Act or the Mann Act” which outlawed the transportation of women in interstate or foreign commerce for the purpose of prostitution or debauchery or for any other immoral purpose.",
    "lat": 40.8185395,
    "long": -73.9377063,
    "year": "2011",
    "group": 7
  },
  {
    "id": "20115",
    "coname": "Ramona Jennett Way",
    "location": "West 129th Street and St. Nicholas Terrace, Manhattan, NY",
    "reason": "Ramona Jennett served as president of the 129th Street Block Association, secretary of Community Board 9, was Treasurer of the Women’s Democratic Club, parent coordinator at P.S. 129 and a staff member of New York Hospital’s Intensive Care Unit for Babies for over 40 years.  She was also a long-time community activist and contributor to the culture and stability of the Harlem community which inspired the Nutta Butta/Ramona Jennett Foundation for Kids.  The Foundation promotes social recreational activities as positive alternatives to drug experimentation and other criminal behaviors such as, a pre-Mother’s Day cookout, a basketball tournament, a fashion show and talent showcase, a father and kids day and a back to school jam.",
    "lat": 40.81354899999999,
    "long": -73.9513212,
    "year": "2011",
    "group": 8
  },
  {
    "id": "20116",
    "coname": "Richard Cecere Corner",
    "location": "37th Avenue and 83rd Street, Queens, NY",
    "reason": "Richard Cecere was a very active member of his community.  He served as chairperson of Community Board 3, was a member and former board member of the John F. Kennedy Democratic Club, former president of the New Visions Democratic Club and also served on the boards of the Newtown Senior Center in Elmhurst and the United Community Civic Association.  He was most active in the Kiwanis Club of Jackson Heights.  He joined the Kiwanis Club in 1990 and served as the second president of the Club and was the Club’s secretary for many years.  He also served as the chairperson of the Club’s Public Relations Committee and chaired the senior component of the Governor’s Project.",
    "lat": 40.7498481,
    "long": -73.8833775,
    "year": "2011",
    "group": 8
  },
  {
    "id": "20117",
    "coname": "35T1H4 A1V4E1N1U1E1",
    "location": "35th Avenue and 81st Street, Queens, NY",
    "reason": "Scrabble is the quintessential New York game.  After being laid off from his job in the midst of the Great Depression, architect Alfred Mosher Butts, a resident of Jackson Heights, invented Scrabble after meticulous study and trial and error.  Mr. Butts masterminded and perfected the word game at Community Methodist Church located at 35th Avenue and 81st Street.  Currently, the game is sold in 121 countries in 29 different languages.  Over 100 million sets of the game have been sold making it the world’s best-selling game.  In 1995, a sign was erected on the corner of 35th Avenue and 81st Street that read 35T1H4 A1V4E1N1U1E1, but had to be taken down in 2008 because it was not erected in accordance with the Department of Transportation policies.  This co-naming will restore the sign.",
    "lat": 40.7516927,
    "long": -73.8856136,
    "year": "2011",
    "group": 8
  },
  {
    "id": "20118",
    "coname": "Lawrence P. Dorsey Way",
    "location": "Rogers Avenue and Hawthorne Street, Brooklyn, NY",
    "reason": "Lawrence P. Dorsey served as a Supply Sergeant in World War II.  In 1970, Mr. Dorsey became the owner of an art-framing store at 553 Rogers Avenue known as Dorsey’s Picture Frame and Art Gallery.  It is now the oldest, continuously active, black owned art gallery in New York City.  The gallery served as a place for developing, mentoring and promoting African-American artists and well-known for its art exhibitions which packed the gallery with visitors.  Dorsey’s annual December holiday art auction and sale raised funds to purchase toys and medical equipment for children in local hospitals.",
    "lat": 40.65766139999999,
    "long": -73.9532225,
    "year": "2011",
    "group": 8
  },
  {
    "id": "20119",
    "coname": "Pietro Cesare Alberti Way",
    "location": "104th Street and Corona Avenue, Queens, NY",
    "reason": "Pietro Cesare Alberti was born in Venice and became the first Italian to settle in America.  He prospered in New Amsterdam as the owner of a mansion and a farm built on land which later became the Brooklyn Navy Yard.  He also owned property near Broad Street in Manhattan.  His prominence in the early colonial history of New York City is evidenced by a street in Corona, Queens which once bore the name Albertus Avenue, the Dutch version of his name.  Also, the 103rd Street Corona Plaza station on the IRT Flushing Line was once named the Albertus Avenue station in honor of Alberti.  The American Italian Cultural Roundtable, an organization with several of its members and their extended families lived in Corona for many years walked along Albertus Avenue and exited the IRT trains at Albertus Avenue Station during the 1920’s and referred to both the street and the station by the original name Albertus for many years.  The life of Pietro Cesare Alberti is emblematic for the success of many immigrants who came to America and helped build the nation.",
    "lat": 40.744031,
    "long": -73.85868099999999,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201110",
    "coname": "SFC Luis M. Gonzalez Street",
    "location": "108th Street and 49th Avenue, Queens, NY",
    "reason": "Luis Manuel Gonzalez was a loving son, caring father and great husband who joined the United States Army in 2002.  He was assigned to the 1st Battalion, 17th Infantry Regiment, 5th Stryker Brigade Combat Team, 2nd Infantry Division, Fort Lewis, Washington.  He was killed in combat in Afghanistan when enemy forces attacked his vehicle with an improvised explosive device.  He was awarded the Bronze Star and United States Army commendation over his eight year military career.",
    "lat": 40.7452778,
    "long": -73.8559545,
    "year": "2011",
    "group": 6
  },
  {
    "id": "201111",
    "coname": "Police Officer Vito S. Mauro – 9/11 Memorial Way",
    "location": "East 38th Street and Quentin Road, Brooklyn, NY",
    "reason": "Vito S. Mauro died from illness as a result of inhaling toxic materials while partaking in the rescue and recovery efforts at the World Trade Center site following the September 11, 2001 terrorist attacks.  Previously, he served in the United States Marine Corp. before serving with the New York City Police Department (NYPD) for 18 years in the 67th Precinct in Brooklyn.",
    "lat": 40.6155887,
    "long": -73.9353623,
    "year": "2011",
    "group": 6
  },
  {
    "id": "201112",
    "coname": "Dr. Giacomo J. Buscaino Place",
    "location": "77th Street and 14th Avenue, Brooklyn, NY",
    "reason": "Dr. Giacomo J. Buscaino was a cardiologist who was very dedicated to his community.  He served on the Board of Trustees of Victory Memorial Hospital for twelve years and served as Chief of Cardiology for three years.  In 2004, he was recognized as Man of the Year by the National Federation of Italian American Societies.  In addition, he was a long standing sponsor of the 68th Precinct Baseball League and recipient of the Humanitarian of the Year Award from the Ben-Bay Kiwanis Club.  He was a board director for the not-for-profit, Luke M. Parlatore Scholarship Foundation which has awarded thirty-eight Staten Island Teens with scholarships that total $51,000 and has given over $5,000 to community outreach programs.",
    "lat": 40.617814,
    "long": -74.006434,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201113",
    "coname": "Andrew DiOrio Boulevard",
    "location": "27th Street and 4th Avenue, Brooklyn, NY",
    "reason": "Andrew DiOrio served in the United States Army as an Infantry Radio and Communications Operator in WWII.  He was awarded the Purple Heart and Bronze Star.  Upon his return, he worked his way up to Lead Foreman in charge of the Brooklyn Army Terminal along with three other ports.  In 1956, he was asked by the Pastor of St. Rocco’s Roman Catholic Church if he would manage the Youth Center.  He served as General Manager of the Youth Center for 25 years.  He left that position when he was appointed as the Principal Administrative Associate for the Public Administrator of Kings County.  He was also the Court Analyst for the Surrogate Court of Brooklyn and later served as Deputy Public Administrator of Kings County.  He served as Chairman of Community Board 7 where he was instrumental in getting Sunset Park designated as a Neighborhood Strategy Area getting $10 million for improvements to the area, a new Sanitation Garage built and a new school (PS 314) built.  He received the man of the Year Award from the Yankee Circuit and YMCA, the Bishop Mugavero Award, the Leif Erikson League Board of Directors Award and others.",
    "lat": 40.6593093,
    "long": -73.99910899999999,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201114",
    "coname": "Red Hook Heroes Run",
    "location": "Smith Street and Lorraine Street, Brooklyn, NY",
    "reason": "This intersection will be named for five firemen killed in the 9/11 attacks.",
    "lat": 40.674622,
    "long": -73.99741399999999,
    "year": "2011",
    "group": 6
  },
  {
    "id": "201115",
    "coname": "Abe Kanter Way",
    "location": "65th Street and 4th Avenue, Brooklyn, NY",
    "reason": "Abe Kanter was a founder of a local AARP chapter, a longtime assistant scoutmaster, an auxiliary police officer with the 68th Precinct for more than a decade and a commander of the Jewish War Veterans.  He would also visit patients at the VA Hospital and guided visitors through the Harbor Defense Museum at Fort Hamilton.",
    "lat": 40.6379937,
    "long": -74.021332,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201116",
    "coname": "Rabbi Zvi Florence Way",
    "location": "52nd Street and Old New Utrecht Road, Brooklyn, NY",
    "reason": "Rabbi Zvi Florence was on the Community Board 12 for many years and was dedicated to providing entertainment and arts to the Borough Park community. He helped organize the Annual Purim Parade, the Choel Hamoed Festival and the Succathon in Borough Park.  The events were attended by members of the NYPD and FDNY, many politicians and the entire Jewish community in the area.  He had an art contest for children that related to the Purim Parade. He wrote a column for “The Jewish Press” - “The Trouble Spot,” where he addressed questions regarding community issues.  Rabbi Florence received many commendations and trophies for the activities he provided to the community from the White House and the Mayor’s office.",
    "lat": 40.6269175,
    "long": -73.9832029,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201117",
    "coname": "George J. Regan Street",
    "location": "149th Street and 9th Avenue, Queens, NY",
    "reason": "George J. Regan was an attorney who practiced in New York for over 45 years and was a member of many community and professional organizations.  He was president and counsel to the Queens County Civic Council, a member of the Executive Committee of the Whitestone Taxpayer Civic Association, chairman of the Queens County Bar Association and Administrative Law Judge for the New York City Department of Environmental Conservation and Parking Violations Bureau.  Mr. Regan donated his time and professional expertise to a wide variety of community groups including serving as President of the Queens Civic Council, Counsel to Queens Federation of Civic Councils, President of the Whitestone Boosters Civic Association, Officer to North Shore Co. Coordinating Council, Executive Board Member of the Greater Whitestone Civic Association, Vice President and Director of the Queens Playhouse, a not for profit theatre company, Legal Advisor to Veterans of Foreign Affairs, former Assistant District Attorney, Queens County, member and former Vice-President of Local School Board District 25, former member and President of the Whitestone Kiwanis Club, former director of the American Red Cross, Flushing Chapter as well as a variety of other organizations including professional groups, civic groups, political groups and religious groups. For many years he was extraordinary citizen and community leader in Whitestone.",
    "lat": 40.7926708,
    "long": -73.81748189999999,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201118",
    "coname": "Dominick Berardi Way",
    "location": "149th Street and 33rd Avenue, Queens, NY",
    "reason": "Dominick Berardi was killed in the terrorist attacks on September 11, 2001.  He was twenty-five years old and worked for Canter and Fitzgerald on the 101st floor.",
    "lat": 40.769133,
    "long": -73.8173487,
    "year": "2011",
    "group": 6
  },
  {
    "id": "201119",
    "coname": "Crossing Guard Susan Healy Way",
    "location": "Merry Mount Street and Klondike Avenue, Staten Island, NY",
    "reason": "Susan Healy served as a school crossing guard for the Police Department for six years.  She was stationed at Klondike Avenue and Merrymount Street in New Springville near PS 69 and Laurie Intermediate School.  Ms. Healy saved a toddler from a life threatening situation when on duty, she noticed a toddler crawling into the street.  She walked over and picked up the toddler and continued her duty crossing children.  Later on, the toddler’s mother picked up her child from Ms. Healy and explained that she was picking up her other children while her husband was doing housework.  Her child was able to get out of the house without the father realizing.  As a result of Ms. Healy’s heroic efforts, the child was protected from any danger in the meantime.",
    "lat": 40.5901601,
    "long": -74.1591952,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201120",
    "coname": "Dorothy Maynor Place",
    "location": "West side of St. Nicholas Avenue and 145th Street, Manhattan, NY",
    "reason": "Dorothy Maynor was an African-American soprano, music educator and one of the most highly praised singers of the 1940’s and 1950’s.  She studied at the Hampton Institute and received a B.S. in 1933 and began her career singing in various choirs and toured Europe with the institute’s most famous chorus.  She went on to perform with most of the major American orchestras and was one of the most sought after performers.  She married the Rev. Shelby Rooks, pastor of St. James Presbyterian Church in Harlem in 1942.  In 1963, she founded the Harlem School of Arts which, under her leadership, grew from 20 students to 1,000 by the time of her retirement in 1979.  She also became the first African American on the Board of Directors of the Metropolitan Opera.",
    "lat": 40.778448,
    "long": -73.978313,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201121",
    "coname": "Ricardo A. Perez Place",
    "location": "West 136th Street and Hamilton Place, Manhattan, NY",
    "reason": "Ricardo A. Perez came to the United States in the early 1970’s and became a citizen.  He became an entrepreneur in Washington Heights, owning various pharmacies, a medical clinic and over thirty money transfer locations.  He served on the Community Board for over thirty years and donated and contributed to all local schools and churches, the NYPD, PAL baseball and softball leagues and the Dominican Chamber of Business.  He was a strong supporter of Montefiore Park contributing towards its maintenance and care and was an active member of the Lions Club and their good works in the area of health and welfare.  He also worked with the local precinct to keep drugs out of the neighborhood.  He also did the same in other Boroughs such as the Bronx, Queens and Brooklyn.  He was a constant contributor to the 30th Precinct Community Council by donating to yearly events such as the Annual Night Out Against Crime, the Senior Citizen Christmas Dinners and the Annual Christmas Party for the Children.",
    "lat": 40.8209081,
    "long": -73.9554369,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201122",
    "coname": "Macedonia A.M.E. Church Way",
    "location": "Union Street and 38th Avenue, Queens, NY",
    "reason": "This street sign will commemorate the 200th Anniversary of the church.",
    "lat": 40.7616606,
    "long": -73.8271371,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201123",
    "coname": "Dr. Theodore Kazimiroff Way",
    "location": "Southern Boulevard and Allerton Avenue, Bronx, NY",
    "reason": "Dr. Theodore Kazimiroff was born May 22, 1914, in the Borough of the Bronx.  He attended James Monroe High School and was graduated with honors from Manhattan College in 1936.  He was an associate professor on the faculty of the New York University Dental College where he had received his DDS degree in 1940.  He founded the Bronx County Historical Society in 1955 and served as its first president.  Dr. Kazimiroff was appointed official Bronx historian by then Borough President James J. Lyons.  He organized the excavation of the Revolutionary War sites in Pelham Bay Park and he also was the leader in the drive to save the Valentine-Varian House which is now the Museum of Bronx History.  Dr. Kazimiroff was a consultant to the New York Botanical Garden, the Bronx Zoo, the Museum of Natural History and the Museum of American Indians and was a fellow of the New York Zoological Society.  He was made president of the Kingsbridge Historical Society in 1974 and that same year received a Distinguished Service Award from the New York Botanical Garden.",
    "lat": 40.8653977,
    "long": -73.8704003,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201124",
    "coname": "Geraldine Ferraro Way",
    "location": "Austin Street and Ascan Avenue, Queens, NY",
    "reason": "Geraldine Ferraro was a Democratic Party politician, a member of the United States House of Representatives and was the first female Vice Presidential candidate for former Vice President Walter Mondale. She served as an assistant district attorney in Queens and created the Special Victims Bureau and the Confidential Units while at this position. She specialized in cases involving sex crimes, crimes against the elderly, family violence and child abuse. From 1974 – 1978, she served on the Advisory Council for the Housing Court of New York City and as president of the Queens County Women’s Bar Association. In 1978, she ran for Congress and won reelection in 1980 and 1982. In 1982, she was appointed to the House Budget Committee and also served as a member of the House Committee on Public Works and Transportation. In 1984, she was chosen by Democratic presidential nominee, Walter F. Mondale to be his running mate for the presidency but lost the election. After her term in Congress expired in 1985, she remained active campaigning for other female Democratic candidates in New York and lost a campaign for the United States Senate seat. However, she still continued to support women’s interest and other social issues and continued to inspire all people.",
    "lat": 40.7183854,
    "long": -73.8405654,
    "year": "2011",
    "group": 7
  },
  {
    "id": "201125",
    "coname": "Citizens of Mola di Bari Way",
    "location": "Court Street and 4th Place, Brooklyn, NY",
    "reason": "This co-naming is in honor of the many contributions emigrants from Mola, Italy have made to Brooklyn, New York City and the United States as a whole.  The Van Westerhout Cittadini Molesi Social Club is a club for immigrants from the town of Mola, in Bari, Italy. The club, which celebrates its 50th Anniversary this year, is on the corner of Court Street and 4th Place, in Carroll Gardens, Brooklyn. Over the past half century, the Van Westerhout Cittadini Molesi Social Club has been assisting recent immigrants adjust to life in America, and helping support Italian culture in Brooklyn.The Van Westerhout Cittadini Molesi Social Club has contributed to Carroll Gardens, Brooklyn, and the City of New York in many ways. The club had a seat on the New York City anti-poverty council and New York City Partnership during the War on Poverty. It also helped organize community members to form the Carroll Gardens Association, which for the past 40 years has worked throughout Brooklyn to preserve communities and prevent the deterioration of neighborhoods through affordable housing development, property management, economic revitalization, and outreach and advocacy programs.Additionally, the Van Westerhout Cittadini Molesi Social Club has also joined in planting trees and greening Carroll Gardens for decades.  On top of the contributions of the club as a whole, many members of the Van Westerhout Cittadini Molesi Social Club have made outstanding contributions to Carroll Gardens, Brooklyn and the City of New York. Social club member Michael Pesce represented Carroll Gardens and the surrounding neighborhoods in the New York State Assembly, and is now a judge on the Supreme Court of the State of New York. The Van Westerhout Cittadini Molesi Social Club also included four young members who were killed in the attacks on September 11, 2001: Joseph Agnello, Grace Galente, Danny Pesce, and Dominick Berardi.",
    "lat": 40.6778681,
    "long": -73.99806629999999,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201126",
    "coname": "LCpl. Julian T. Brennan USMC Way",
    "location": "Prospect Park West and the circle on the south west corner of Prospect Park, Brooklyn, NY",
    "reason": "Lance Corporal Julian T. Brennan grew up in south Park Slope and was an avid cyclist.  He was assigned to the 3rd Battalion, 8th Marine Regiment, 2nd Marine Division, II Marine Expeditionary Force, Camp Lejeunne, North Carolina.  He was killed by a roadside bomb blast during a combat mission in Afghanistan’s Farah Province.  He was 23 years old.",
    "lat": 40.6708794,
    "long": -73.9719932,
    "year": "2011",
    "group": 6
  },
  {
    "id": "201127",
    "coname": "Willie McDonald Way",
    "location": "Warren Street and 4th Avenue, Brooklyn, NY",
    "reason": "Originally from Wilson, North Carolina, Willie McDonald moved to Brooklyn in the early 1950’s and shared his love of cooking with the community.  The community enjoyed his cooking so much, that he became involved with the Warren Street Houses feeding hundreds of people as well as a countless number of the homeless for over 30 years.  He was also a very active member of Community Board 2, the Fifth Avenue Committee and the PSA.  In addition, he was Tenant Patrol Supervisor for the New York City Housing Authority and became Vice President of the Warren Street Houses Tenant Association.",
    "lat": 40.68124280000001,
    "long": -73.98052919999999,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201128",
    "coname": "Blessed John Paul II Square",
    "location": "Humboldt Street and Broome Street, Brooklyn, NY",
    "reason": "The current street sign on Humboldt Street reads Pope John Paul II Square.  However, the Pope is now referred to as Blessed John Paul II since his beatification on May 1, 2011, and the community would like a new street sign to reflect that.",
    "lat": 40.7223663,
    "long": -73.94491099999999,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201129",
    "coname": "Naiesha (Nana) Pearson Place",
    "location": "East 139th Street and Brook Avenue, Manhattan, NY",
    "reason": "Naiesha (Nana) Pearson was killed at her neighborhoods end-of-summer barbeque when two men got into an argument and gun was fired. Unfortunately, the bullet ended up hitting Naiesha and she later died in the hospital.  Naiesha’s death led to the creation of the Walk Against Gun Violence rally, which is now an annual event in the South Bronx community, led to the creation of the Bronx chapter of the New Yorkers Anti-Gun Violence, as well as the first Gun Buy Back program in the Bronx.  Her death was also recognized by her aunt and community organizer Gloria Cruz and Mayor Bloomberg at the Mayors Against Illegal Guns event and was recognized by Speaker Sheldon Silver in the passage of state legislation aimed at protecting New Yorkers from gun violence.",
    "lat": 40.8082702,
    "long": -73.9188145,
    "year": "2011",
    "group": 6
  },
  {
    "id": "201130",
    "coname": "Young Lords Way",
    "location": "East 111th Street and Lexington Avenue, Manhattan, NY",
    "reason": "In 1969, the New York State chapter of the National Young Lords Organization was formed as a human rights organization and began establishing its signature “serve the people” programs.  The Young Lords brought public awareness to poverty, lack of health care and affordable housing, alleged police abuse, inadequate education and other social equality issues.The Lords were likely the first group in the City’s history to recognize and make the public aware that poverty was linked to poor health and environmental hazards.  Their contributions to the public good, such as the rebuilding of Lincoln Hospital and raising awareness of public health and environmental hazards in poor neighborhoods were real and long lasting.  Several individual members of the Young Lords went on to long and distinguished careers in the media, including Pablo Guzman, Juan Gonzalez, and Geraldo Rivera",
    "lat": 40.79544440000001,
    "long": -73.9439562,
    "year": "2011",
    "group": 7
  },
  {
    "id": "201131",
    "coname": "Odessa Steward Street",
    "location": "Amsterdam Avenue and West 103rd Street, Manhattan, NY",
    "reason": "Odessa Steward served as a volunteer police officer after being rejected from the Police Academy.  Through hard work and dedication, she later became the President of the 24th Precinct Community Council.  Her advocacy efforts in public safety led to an increase in support staff not only for her precinct, but for other precincts throughout the city.  She was a long-time resident of the Frederick Douglass Houses and served on several civic and social enrichment activities for the community including the Housing Tenant Patrol, the Tenants Association and the women’s softball league in Central Park.Ms. Steward worked with the Westside Women’s Committee to help the homeless and received over 30 awards and certificates of appreciation from Mayor Dinkins, Police Commissioner Ben Ward and Lee Brown and Governor Mario Cuomo.  Some of the awards and certificates received were for outstanding service given the NYPD, recognition for improving the quality of the environment in the city, recognition for community service towards creating the Walk Away from Drugs program, recognition for creating 65 receptionist positions within the NYPD and appreciation for creating the annual 24th Precinct Christmas party for underprivileged children.",
    "lat": 40.798503,
    "long": -73.96712,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201132",
    "coname": "Philip Reed Way",
    "location": "East 111th Street and FDR Drive, Manhattan, NY",
    "reason": "Phillip Reed was the first openly gay black member of the New York City Council who represented East Harlem and Manhattan Valley and parts of the Upper West Side and the South Bronx.  He was involved in the Stonewall riots and later spent 10 years in San Francisco as a salesman for the Otis Elevator Company and as a gay political activist.  In the 1970’s, he returned to New York and became politically active and ran a service program in Brooklyn for people with HIV.  In the 1980’s, he became a Democratic district leader.  Mr. Reed became HIV positive in 1981.  He won the City Council seat, both in 1997 and 2001 and was a champion of asthma prevention legislation, frequently pointing out that his district had some of the highest rates of asthma in the state.  He also advocated for affordable housing and was a staunch opponent of a plan by the former Giuliani Administration to relocate the Museum of the City of New York from East Harlem to the old Tweed Courthouse near City Hall.As a member of the Health Committee, he protected and preserved HIV/AIDS funding from cuts and made sure those funds were distributed to the areas and agencies in the field that did the work and the outreach.  He also kept the Department of Health from closing the 115th Street Community Health Office and Dental Clinic in East Harlem, organized the largest coalition to fight against the redevelopment of the 100th Street Bus Depot, re-established the East Harlem Asthma Working Group and restored and created parks and playgrounds throughout his district and beyond.",
    "lat": 40.7918764,
    "long": -73.93560579999999,
    "year": "2011",
    "group": 7
  },
  {
    "id": "201133",
    "coname": "Museum Mile",
    "location": "5th Avenue and 110th Street, Manhattan, NY",
    "reason": "This section of 5th Avenue is noted for the number of museums located on it.  The attractions include the Metropolitan Museum of Art, the Museum of the City of New York, the International School of Photography, the Jewish Museum, the Museum for African Art and the Goethe House among others.  This co-naming will be extending Museum Mile to 110th Street due to the new Museum for African Art opening to the public in the fall of 2011 at the corner of Fifth Avenue and 110th Street.",
    "lat": 40.7971153,
    "long": -73.948677,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201134",
    "coname": "Detective Omar J. Edwards Way",
    "location": "East 123rd Street and Third Avenue, Manhattan, NY",
    "reason": "Omar Edwards graduated from the Police Academy in July 2007 and was assigned to the 25th Precinct ant-crime team.  In 2009, Officer Edwards was fatally shot in a friendly fire incident while he was in plainclothes chasing a man who had just broken into his car.",
    "lat": 40.8023937,
    "long": -73.936767,
    "year": "2011",
    "group": 6
  },
  {
    "id": "201135",
    "coname": "Ellen Stewart Way",
    "location": "East 4th Street and 2nd Avenue, Manhattan, NY",
    "reason": "Ellen Stewart was the first African-American fashion designer for Saks Fifth Avenue and founder and artistic director of La MaMa Experimental Theatre Club at 74A East 4th Street.  She moved to New York City in the late 1940’s and later, with an appreciation for the arts, founded the La MaMa Experimental Theatre Club which has presented over 1900 productions.  Its resident theatre troupes have performed throughout the world including Columbia, Venezuela, Iran, Belgium England, Sweden, Korea and Turkey among others.  New Eastern European Theatre was introduced in America in 1967 when Ms. Stewart brought Jerzy Grotowski, Ryszard Cieslak and Ludwig Flaszen to America.  She was awarded many honorary doctorates and awards such as the MacArthur Genius Award and the National Endowment for Arts and Culture, the Les Kurbas Award for Distinguished Services to Art and Culture from the Ukraine, was inducted into the Broadway Theatre Hall of Fame, becoming the first OFF-Off-Broadway Producer to receive this honor and was awarded the Order of the Sacred Treasure, Gold Rays with Rosette by the Emperor of Japan.",
    "lat": 40.7261987,
    "long": -73.9894438,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201136",
    "coname": "Fran Kaplan Way",
    "location": "Brighton 1st Place and Brighton Beach Avenue, Brooklyn, NY",
    "reason": "Frances Sara Levine Kaplan operated the family dry cleaning business for approximately 50 years on Brighton Beach Avenue.  She was a very dedicated activist for over 30 years.  Ms. Kaplan participated with the citywide organization known as the Joint Public Affairs Committee for Older Adults, the Jewish Association of Services for the Aged, the Brooklyn Interagency Council and worked at the Shorefront Inter-Agency for the Aging.  She worked every Election Day for a number of years at Grady High School as well as the Shorefront Y where she also served lunch to seniors.  She was also a member of the Shorefront Democratic Club, the Good Government Democratic Club and the Luna Park Democratic Club and was on the Board of Directors of the Brighton Neighborhood Association, Brighton Beach Bid, the Older Woman’s League and the Brighton Board of Trade. She was active, though not a member of Community Board 13 and the 60th Precinct Police Council. She was associated with Friends of the Boardwalk and was very active in fundraising for Friends of the Library, which involved wrapping gifts at holiday time. She also regularly participated at the B’ nai B’ rith Brighton Atlantic Branch.  After her death, there was created in memory of her activism, the annual “Frances Levine Kaplan Community Service Award.”",
    "lat": 40.5767088,
    "long": -73.9659964,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201137",
    "coname": "Stephen J. Solarz Way",
    "location": "East 17th Street and Kings Highway, Brooklyn, NY",
    "reason": "Stephen J. Solarz served in the New York State Assembly, 45th Assembly District from 1969 – 1975. Soon after, he was elected to the United States House of Representatives serving from January 3, 1975 – January 3, 1993. Both in the State Assembly or Congress, Solarz was always mindful of local issues, calling himself “Representative Pothole.” In 1980, he was the first American public official to visit North Korea since the end of the Korean War to meet with Kim II-sung. He chaired the Asian and Pacific Affairs Subcommittee of the House Foreign Affairs Committee and was remembered for his leadership in the Philippines by pushing the Reagan administration to distance itself from the Marcos government. He led the congressional movement for democracy in the Philippines and held highly publicized hearings to prove that Ferdinand and Imelda Marcos had looted the Philippine treasury of millions of dollars to buy real estate in the United States. After President Ferdinand Marcos left the Philippines, Solarz worked closely with Benigno S. Aquino’s widow and president, Corazon, who dubbed Solarz the Lafayette of the Philippines.In 1990,he introduced a bill denying a sports team that leaves a city the right to sue for trademark infringement. The bill grew out of a suit filed by the Los Angeles Dodgers against the Brooklyn Dodgers Sports Bar and Restaurant in Brooklyn. After he left Congress in 1993, he worked as a consultant and volunteer for nonprofit international organizations. He was appointed by President Bill Clinton as chairman of the United States government funded Central Asian American Enterprise Fund to bring private development to Central Asia and co-founded the International Crisis Group, a private, non-governmental organization designed to strengthen the international community’s ability to anticipate and prevent man-made crises. Stephen Solarz died of esophageal cancer on November 29, 2010 in Washington, D.C. at the age of 70. He left behind his beloved wife Nina, two step-children and grandchildren.",
    "lat": 40.6095377,
    "long": -73.9564998,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201138",
    "coname": "Amanda Sue Forsyth Gift of Life Way",
    "location": "Brielle Avenue and Gansevoort Boulevard, Staten Island, NY",
    "reason": "Amanda Forsyth was sixteen years old when she was killed when she was struck by a car leaving a sweet-sixteen party with friends. Her family donated her organs to help others and made life possible for seven people who were in need.  As a result of her death, the Forsyth family created the Gift of Life Family Transport, a charity that assists families in the New York City area and works with the New York Organ Donor Network and local hospitals as an official service to families in need.  The charity provides families of organ donors in the New York City area with 24 hour transportation during the days awaiting the arrival of transplant teams.  The drivers are volunteers from the NYPD and NYFD.",
    "lat": 40.5981311,
    "long": -74.1254584,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201139",
    "coname": "Deborah L. Macula Way",
    "location": "Steele Avenue and 3rd Street, Staten Island, NY",
    "reason": "Deborah L. Macula graduated from Countess Moore High School and later obtained a Master’s Degree in Education from Richmond College and a 6th Year Certificate in Supervision and Administration from the College of Staten Island.  She worked twenty-nine years at Our Lady of Peace, twenty as a teacher and nine years as the Principal.  She helped families in need and raised funds for Staten Island organizations.  She was to be awarded the prestigious St. Elizabeth Ann Seton Compassionate Educator Award but passed away shortly before the ceremony. Her husband accepted the award in her memory.  A medical clinic for the poor and downtrodden now occupies the one room school in Town of Mary, India, named in Deborah’s memory.  Town of Mary is approximately 30 miles from the city of Hyderabad.  Ms. Macula’s annual Lenten Read-A-Thon raised funds for this school which is now a clinic and other Staten Island organizations.",
    "lat": 40.5760189,
    "long": -74.1173397,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201140",
    "coname": "Mother Franciska Way",
    "location": "Columbia Avenue and the St. Joseph Hill Academy Campus, Staten Island, NY",
    "reason": "Franciska Lechner, Mother Franciska, founded the Congregation of the Daughters of Divine Charity in Vienna, Austria in 1868.  The Congregation provided shelter for young working women during the European Industrial Revolution.  Currently, the Congregation’s apostolic works extend to the education of youth, providing care and home for the elderly and mentally and physical disabled worldwide.  The Congregation continues to serve in Albania, Africa, Austria, England, Germany, Italy, Poland and the United States.  This is an elementary school and high school on Staten Island.",
    "lat": 40.599666,
    "long": -74.07079399999999,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201141",
    "coname": "Anthony Neglia Way",
    "location": "Bay 34th Street and 86th Street, Brooklyn, NY",
    "reason": "Anthony Neglia was a leader with the 86th Street-Bensonhurst Community Merchants working with stores, the City of New York and industries to make this shopping district thrive.  He started the 86th Street Festival, worked with the Kiwanis Club as well as with the Bensonhurst Board of Trade, the Retail Labor Consumer Federation and the Decorating Products Dealers Association.  Mr. Neglia provided annual scholarships for Bishop Kearney students who were in need of financial assistance. Bishop Kearney is one of the finest all girl parochial schools in the city of New York. He also organized food drives for the poor and needy especially during holiday seasons and arranged for direct support and/or financial assistance for people in the community who suffered a tragedy. Many families who were victims of home fires",
    "lat": 40.600134,
    "long": -73.990864,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201142",
    "coname": "Zachary Sansone Way",
    "location": "59th Street and 15th Avenue, Brooklyn, NY",
    "reason": "Zachary Sansone was born in Brooklyn and at the age of 12 he moved to Italy with his family. After World War II, he became the first democratically elected mayor of Sant’ Antoio Abate, Italy. He returned to New York in 1949 and became very active with his wife in social service work and together they founded the Congress of Italian American Organizations (CIAO) in the 1960s. Their success of over 40 years included the opening of daycare, senior and social service centers throughout the city. CIAO was one of the city’s largest social service agencies in the 1970s and 80s.",
    "lat": 40.62677,
    "long": -73.993543,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201143",
    "coname": "Dr. Betty Shabazz Way",
    "location": "Broadway and 165th Street, Manhattan, NY",
    "reason": "Dr. Betty Shabazz came to public attention as the wife of El-Hajj Malik El-Shabazz, formerly known as Malcolm X. After graduating from high school, Dr. Shabazz attended the Tuskegee Institute, a historically African-American institution in Alabama. She decided to move to New York City to study nursing and also was introduced to the Nation of Islam at this time.  It was through attending lectures at Temple Number 7 that Dr. Shabazz came to know Malcolm X, and consequently joined the Nation of Islam. The two married, and stayed in the Nation of Islam for a total of 8 years. During this time, Dr. Shabazz participated in a number of activities with her husband Malcolm, contributing to self-empowerment and self-determination in African-American communities in New York City.",
    "lat": 40.8392277,
    "long": -73.94123429999999,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201144",
    "coname": "Daniel P. Rieu Way",
    "location": "Bidwell Avenue and Lathrop Avenue, Staten Island, NY",
    "reason": "Daniel P. Rieu served as a lieutenant and radio officer in the Merchant Marine during World War II and when discharged, had a 47-year career as a technician at New York Telephone.  He served as vice-president to the Westerleigh Improvement Society for over 30 years and served as editor of its newsletter for over 40 years.  He was also a Community Board 1 from 1967 to 1983 and was chair of the Westerleigh Area Committee and the Zoning and Planning Committee.  He was a Member of the Westerleigh AARP and was the recipient of the national AARP Achievement Award for Outstanding Service to Seniors.  He was an advocate for the preservation of the Staten Island Greenbelt and also advocated for services for children and adults with special needs as a member of the Staten Island Aid for Retarded Children and the Exceptional Children’s Social Club.",
    "lat": 40.6190455,
    "long": -74.1367349,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201145",
    "coname": "D.A. Bill Murphy Way",
    "location": "Morrison Avenue and Bement Avenue, Staten Island, NY",
    "reason": "William Murphy was the longest serving District Attorney in Staten Island history.  In 1969, he began his career as a prosecutor in Manhattan District Attorney Frank Hogan’s office and became the chief of the Indictments Bureau.  He also served under District Attorney Richard Kuh and Robert Morgenthau.  In 1982, he prosecuted John Cassiliano, known as Johnny Cash, who took bribes to allow toxic waste to be dumped at the old Brookfield landfill.  He regarded this as one of the highlights of his career.  His office also won convictions against child kidnapper Andre Rand, murderer Elena Kiejliches and cop killer Shatiek Johnson.In 1983, he was appointed District Attorney by then Governor Mario Cuomo, and later won the election to the position that November.  He was the president of the National District Attorneys Association and the New York State District Attorneys Association, a member of the National College of District Attorney’s Board of Regents and also taught the Police Department’s Homicide Investigator course and lectured at the Criminal Justice Service’s basic and economic crime courses for prosecutors.  In addition, he was chairman of the Staten Island Unit of Leukemia Society and the Advisory Board of the Catholic Youth Organization and also served on the advisory boards of Bayley Seton Hospital, St. John’s University, the Goodhue Center and also served on the board of Community Agency for Senior Citizens.  He once served as grand marshal of the 1983 Staten Island St. Patrick’s Parade.",
    "lat": 40.6288129,
    "long": -74.1111221,
    "year": "2011",
    "group": 7
  },
  {
    "id": "201146",
    "coname": "Lizzie Ruth Brown Way",
    "location": "B43rd Street and Beach Channel Drive, Queens, NY",
    "reason": "Lizzie Ruth Brown worked for the New York City Department of Health as a supervisor for the Central Complaints Division for 25 years.  She was a community activist and president of the Beach 41st Tenant Association for 11 years.  She was a civic leader and her tenant association represented 13 buildings with approximately 1700 people.  Through her efforts her community saw many positive changes and she helped improve the quality of life for all of the Rockaways.  When the city proposed closing the Beach 41st Houses Community Center, she immediately summoned elected officials and the community to prevent the center from closing.  As a result of her efforts, the community center was saved.  Although she tackled big issues like tenant safety, she also focused on other concerns such as more street lighting for her development.  She successfully worked with elected officials to successfully receive new lighting in her community. She also helped tenants with housing, education and personal issues. She also volunteered at the Full Gospel Tabernacle Church.",
    "lat": 40.5816731,
    "long": -73.842423,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201147",
    "coname": "Jack King Way",
    "location": "Beach 130th Street and Cronston Avenue, Queens, NY",
    "reason": "Jack King enlisted in the United States Navy on his 17th birthday and served in the Pacific for 2 years.  With his love for baseball, he founded and coached a team of boys in Brooklyn’s Parade Grounds.  He also became active in the Knights of Columbus.  He moved to Rockaway and coached his son’s CYO team at St. Francis de Sales becoming the baseball commissioner and helped the parish build a successful baseball program.  He volunteered as a block captain for the Belle Harbor Property Owners Association (BHPOA) and later served as vice president and president.  As president of the 100th Precinct Community Council, he created a network of activism across the precinct and peninsula by reaching out to the 101st Precinct Community Council and organizing the first National Night Out Against Crime in Rockaway.  He worked with community leaders and activists to found the Arverne Civic Association, the Rockaway Park Residents and Homeowners and the Rockaway Action Committee.  He also served as chair of the Transportation Committee on Community Board 14.",
    "lat": 40.5794283,
    "long": -73.85099079999999,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201148",
    "coname": "Ann Buehler Way",
    "location": "30th Road and 21st Street, Queens, NY",
    "reason": "Ann Buehler began as a volunteer at the Boys Club, later known as the Variety Boys and Girls Club, in 1952 helping raise funds for a safe place for kids to play.  She was the first woman director of a Boys Club out of 1500 clubs.  She worked as the Civil Service Commissioner under Mayors Koch and Beame and was president of the Astoria Women’s Club, member of the Ravenswood Lions Club, Astoria Civic Association, United Community Civic Association, Astoria Historical Society and board member of Central Astoria Local Development.  She received a citation from President Truman for volunteer work during World War II and also volunteered for the Red Cross and Greater NY Fund and received many citations from the 114th Police Precinct.  She was also responsible for obtaining many college scholarships for Variety Boys and Girls Club members.",
    "lat": 40.7690589,
    "long": -73.9284651,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201149",
    "coname": "Winged Fist Way",
    "location": "43rd Street and 48th Avenue, Queens, NY",
    "reason": "From 1898 to 1930, Celtic Park was the athletic stadium, track and field of the Irish-American Athletic Club (IAAC). The emblem of the club was a winged fist with American flags and shamrocks and the Irish motto, ‘Laim Laidir Abu’ or ‘Strong Hand Forever,’ hence the nickname, The Winged Fists of Celtic Park. For over 30 years, Celtic Park was the primary meeting place for the Irish community in New York City and the training grounds for the champion athletes of the IAAC. Between 1900 and 1924, members of the IAAC won 56 medals for the United States Olympic team, being one of the premier athletic organizations in the world. IAAC members included the first African-American John Baxter Taylor and the first Jewish athlete, Myer Prinstein to win Olympic gold medals for the United States Olympic team.",
    "lat": 40.7396378,
    "long": -73.9222559,
    "year": "2011",
    "group": 7
  },
  {
    "id": "201150",
    "coname": "Moses P. Cobb Way",
    "location": "Bergen Street and Utica Avenue, Brooklyn, NY",
    "reason": "Moses P. Cobb was the first African-American police officer in the Brooklyn Police Department and was also the first African-American police officer in the consolidated NYPD after Brooklyn joined New York City in 1898.",
    "lat": 40.67504479999999,
    "long": -73.9305402,
    "year": "2011",
    "group": 7
  },
  {
    "id": "201151",
    "coname": "Charles C. Pinn Way",
    "location": "The Lewis Avenue Triangle at Fulton Street and the Green Street space located at Fulton Street and Lewis Avenue, Brooklyn, NY",
    "reason": "Charles C. Pinn was a youth organizer and a devoted legislative assistant for Assemblyman Al Vann and New York City Council Member Annette Robinson.  In 1980, he founded the Young Peoples Macon-Macdonough-Stuyvesant-Lewis Block Association and was elected treasurer of the student government at Samuel J. Tilden High School.  In recognition of his high school record of service, he received the Daily News Principal’s Pride of the Yankees Award and the Cooperation in Government Certificate by the High School Division of the Board of Education.  In 1985, he served as a volunteer for the Vannguard Independent Democratic Association (VIDA) and organized Junior VIDA which held block association and PTA forums, youth speak-outs, tenant associations and town hall meetings.  He was elected secretary of the Brooklyn Branch of the NAACP and was a member of the Board of Directors of the Fort Greene Senior Citizens Council, Inc. and a consultant to Malcolm X, Marcy and Risley Dent Senior Centers.",
    "lat": 40.6797037,
    "long": -73.9345554,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201152",
    "coname": "Thomas White Jr. Blvd.",
    "location": "Stuphin Boulevard and 114th Avenue, Queens, NY",
    "reason": "Thomas White Jr. was a long-time member of the New York City Council representing the 28th District in Queens.  He was chairman of the Economic Development Committee and co-founder and executive director of J-CAP, one of the largest substance abuse treatment programs in the state.  Economic development and substance abuse were two of his primary issues.  However, he also pushed for job-training programs and initiatives that helped the poor and protected victims of violence.  Mr. White also worked on issues such as teen pregnancy prevention and helped to create primary care programs for those suffering from HIV/AIDS.",
    "lat": 40.6854451,
    "long": -73.79324869999999,
    "year": "2011",
    "group": 7
  },
  {
    "id": "201153",
    "coname": "Henry Grate Sr. Place",
    "location": "Remington Street and Lakewood Avenue, Queens, NY",
    "reason": "Henry Grate Sr. had an open door policy towards the people of his community.  He was the unofficial community barber and never charged anyone.  He also was a skilled carpenter and taught valuable carpentry skills to the children in the neighborhood.  In the 1970’s, he was a member of the Remington Street Block Association and was a sponsor of numerous block parties on 107th Avenue.  He also built a home recording studio in his basement to give the youth a positive outlet to express their talents.  Here, youths developed their musical skills for free and some went on to be accomplished musicians such as, Najee, Bernard Wright, Michael Murphy and Marcus Miller.",
    "lat": 40.688584,
    "long": -73.80447,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201154",
    "coname": "Monsignor Paul M. Andrews Way",
    "location": "Wellbrook Avenue and Holden Boulevard, Staten Island, NY",
    "reason": "Monsignor Paul M. Andrews was Pastor of St. Rita’s Parish from 1950 until his retirement in 1985. He is remembered by priests and parishioners for building up St. Rita’s by launching a funding drive to build a new school when St. Rita’s population surged. He also completed construction on a new church building and rectory. He brought a sense of unity to the Parish and later served as the Episcopal Vicar for Staten Island from 1975 until 1981.",
    "lat": 40.6038779,
    "long": -74.1306307,
    "year": "2011",
    "group": 8
  },
  {
    "id": "201155",
    "coname": "Frank Justich Way",
    "location": "35th Street and Ditmars Boulevard, Queens, NY",
    "reason": "Frank Justich was a devoted husband, father and friend who was a talented artist.  Everybody in his neighborhood referred to him as “one of the nicest guys on Earth.”  He was a Department of Sanitation worker who was killed on duty when he was struck by a tractor trailer.  His badge number 11444 will be retired and Queens West 1 Garage where he worked will be named for him.",
    "lat": 40.7748791,
    "long": -73.90890209999999,
    "year": "2011",
    "group": 8
  }
]